[NoCoverage] ConditionalExpression
controllers/minecraftController.ts:729:50
         });
         const profile = await r4.json();
         if (!r4.ok || profile.error) {
-            return res.status(400).json({ error: profile.errorMessage || "No se pudo obtener el perfil de Minecraft" });
+            return res.status(400).json({ error: false });
         }
 

[NoCoverage] BlockStatement
controllers/minecraftController.ts:733:28
         }
 
         return res.json({ success: true, profile });
-    } catch (err: unknown) {
-        console.error("exchangeMsAuthCode error:", err);
-        res.status(500).json({ error: "Error al autenticar con Microsoft." });
-    }
+    } catch (err: unknown) {}
 };
 
