[NoCoverage] BlockStatement
controllers/calendarController.ts:4:73
 import { Request, Response } from 'express';
 import { listEvents, createEvent } from '../services/googleCalendarService.js';
 
-export const getCalendarEvents = async (req: Request, res: Response) => {
-    try {
-        const events = await listEvents(20); // Get next 20 events
-        res.json(events);
-    } catch (error) {
-        console.error(error);
-        res.status(500).json({ error: 'Failed to fetch calendar events' });
-    }
-};
+export const getCalendarEvents = async (req: Request, res: Response) => {};
 
 export const syncTaskToCalendar = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/calendarController.ts:5:9
 import { listEvents, createEvent } from '../services/googleCalendarService.js';
 
 export const getCalendarEvents = async (req: Request, res: Response) => {
-    try {
-        const events = await listEvents(20); // Get next 20 events
-        res.json(events);
-    } catch (error) {
+    try {} catch (error) {
         console.error(error);
         res.status(500).json({ error: 'Failed to fetch calendar events' });

[NoCoverage] BlockStatement
controllers/calendarController.ts:8:21
     try {
         const events = await listEvents(20); // Get next 20 events
         res.json(events);
-    } catch (error) {
-        console.error(error);
-        res.status(500).json({ error: 'Failed to fetch calendar events' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/calendarController.ts:10:39
         res.json(events);
     } catch (error) {
         console.error(error);
-        res.status(500).json({ error: 'Failed to fetch calendar events' });
+        res.status(500).json({ error: "" });
     }
 };

[NoCoverage] BlockStatement
controllers/calendarController.ts:14:74
     }
 };
 
-export const syncTaskToCalendar = async (req: Request, res: Response) => {
-    try {
-        const { title, description, date } = req.body;
-        
-        if (!title || !date) {
-            return res.status(400).json({ error: 'Title and Date are required' });
-        }
-
-        const event = await createEvent({
-            summary: `[Kanban] ${title}`,
-            description: description || 'Synced from CrystalTides Kanban',
-            start: date // Expecting ISO string or understood date format
-        });
-
-        res.json({ success: true, event });
-    } catch (error) {
-        console.error(error);
-        res.status(500).json({ error: 'Failed to sync task to calendar' });
-    }
-};
+export const syncTaskToCalendar = async (req: Request, res: Response) => {};
 
 export const getCalendarSubscribeLink = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/calendarController.ts:15:9
 };
 
 export const syncTaskToCalendar = async (req: Request, res: Response) => {
-    try {
-        const { title, description, date } = req.body;
-        
-        if (!title || !date) {
-            return res.status(400).json({ error: 'Title and Date are required' });
-        }
-
-        const event = await createEvent({
-            summary: `[Kanban] ${title}`,
-            description: description || 'Synced from CrystalTides Kanban',
-            start: date // Expecting ISO string or understood date format
-        });
-
-        res.json({ success: true, event });
-    } catch (error) {
+    try {} catch (error) {
         console.error(error);
         res.status(500).json({ error: 'Failed to sync task to calendar' });

[NoCoverage] BooleanLiteral
controllers/calendarController.ts:18:23
     try {
         const { title, description, date } = req.body;
         
-        if (!title || !date) {
+        if (!title || date) {
             return res.status(400).json({ error: 'Title and Date are required' });
         }

[NoCoverage] BlockStatement
controllers/calendarController.ts:18:30
     try {
         const { title, description, date } = req.body;
         
-        if (!title || !date) {
-            return res.status(400).json({ error: 'Title and Date are required' });
-        }
+        if (!title || !date) {}
 
         const event = await createEvent({

[NoCoverage] StringLiteral
controllers/calendarController.ts:23:22
         }
 
         const event = await createEvent({
-            summary: `[Kanban] ${title}`,
+            summary: ``,
             description: description || 'Synced from CrystalTides Kanban',
             start: date // Expecting ISO string or understood date format

[NoCoverage] ConditionalExpression
controllers/calendarController.ts:24:26
 
         const event = await createEvent({
             summary: `[Kanban] ${title}`,
-            description: description || 'Synced from CrystalTides Kanban',
+            description: true,
             start: date // Expecting ISO string or understood date format
         });

[NoCoverage] LogicalOperator
controllers/calendarController.ts:24:26
 
         const event = await createEvent({
             summary: `[Kanban] ${title}`,
-            description: description || 'Synced from CrystalTides Kanban',
+            description: description && 'Synced from CrystalTides Kanban',
             start: date // Expecting ISO string or understood date format
         });

[NoCoverage] BooleanLiteral
controllers/calendarController.ts:28:29
             start: date // Expecting ISO string or understood date format
         });
 
-        res.json({ success: true, event });
+        res.json({ success: false, event });
     } catch (error) {
         console.error(error);

[NoCoverage] BlockStatement
controllers/calendarController.ts:29:21
         });
 
         res.json({ success: true, event });
-    } catch (error) {
-        console.error(error);
-        res.status(500).json({ error: 'Failed to sync task to calendar' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/calendarController.ts:35:80
     }
 };
 
-export const getCalendarSubscribeLink = async (req: Request, res: Response) => {
-    const calendarId = process.env.GOOGLE_CALENDAR_ID;
-    if (!calendarId) {
-        return res.status(500).json({ error: 'Calendar ID not configured' });
-    }
-    // Standard Google Calendar subscribe URL
-    const subscribeUrl = `https://calendar.google.com/calendar/u/0/r?cid=${encodeURIComponent(calendarId)}`;
-    res.json({ url: subscribeUrl });
-};
+export const getCalendarSubscribeLink = async (req: Request, res: Response) => {};
 

[NoCoverage] ConditionalExpression
controllers/calendarController.ts:37:9
 
 export const getCalendarSubscribeLink = async (req: Request, res: Response) => {
     const calendarId = process.env.GOOGLE_CALENDAR_ID;
-    if (!calendarId) {
+    if (true) {
         return res.status(500).json({ error: 'Calendar ID not configured' });
     }

[NoCoverage] BooleanLiteral
controllers/calendarController.ts:37:9
 
 export const getCalendarSubscribeLink = async (req: Request, res: Response) => {
     const calendarId = process.env.GOOGLE_CALENDAR_ID;
-    if (!calendarId) {
+    if (calendarId) {
         return res.status(500).json({ error: 'Calendar ID not configured' });
     }

[NoCoverage] StringLiteral
controllers/calendarController.ts:38:46
 export const getCalendarSubscribeLink = async (req: Request, res: Response) => {
     const calendarId = process.env.GOOGLE_CALENDAR_ID;
     if (!calendarId) {
-        return res.status(500).json({ error: 'Calendar ID not configured' });
+        return res.status(500).json({ error: "" });
     }
     // Standard Google Calendar subscribe URL
