[Survived] BlockStatement
services/auditService.ts:26:91
 /**
  * Logs a security event to the audit system.
  */
-const logSecurityEvent = async ({ userId, username, action, details, ip }: AuditEntry) => {
-    return await createLog({
-        user_id: userId,
-        username: username,
-        action: action,
-        details: {
-            ...details,
-            ip,
-            timestamp: new Date().toISOString()
-        },
-        source: 'security-auditor'
-    });
-};
+const logSecurityEvent = async ({ userId, username, action, details, ip }: AuditEntry) => {};
 
 /**

[Survived] ObjectLiteral
services/auditService.ts:27:28
  * Logs a security event to the audit system.
  */
 const logSecurityEvent = async ({ userId, username, action, details, ip }: AuditEntry) => {
-    return await createLog({
-        user_id: userId,
-        username: username,
-        action: action,
-        details: {
-            ...details,
-            ip,
-            timestamp: new Date().toISOString()
-        },
-        source: 'security-auditor'
-    });
+    return await createLog({});
 };
 

[Survived] StringLiteral
services/auditService.ts:36:17
             ip,
             timestamp: new Date().toISOString()
         },
-        source: 'security-auditor'
+        source: ""
     });
 };

[NoCoverage] BooleanLiteral
services/auditService.ts:43:95
 /**
  * Specifically logs authentication or authorization failures (401/403).
  */
-export const logSecurityFailure = async (req: Request, reason: string, isForbidden: boolean = false) => {
+export const logSecurityFailure = async (req: Request, reason: string, isForbidden: boolean = true) => {
     const user = req.user;
     return await logSecurityEvent({

[Survived] BlockStatement
services/auditService.ts:43:105
 /**
  * Specifically logs authentication or authorization failures (401/403).
  */
-export const logSecurityFailure = async (req: Request, reason: string, isForbidden: boolean = false) => {
-    const user = req.user;
-    return await logSecurityEvent({
-        userId: user?.id,
-        username: user?.username || 'Guest',
-        action: isForbidden ? AuditAction.FORBIDDEN_ACTION : AuditAction.UNAUTHORIZED_ACCESS,
-        details: {
-            path: req.path,
-            method: req.method,
-            reason: reason,
-            userAgent: req.get('user-agent') || 'Unknown'
-        },
-        ip: req.ip
-    });
-};
+export const logSecurityFailure = async (req: Request, reason: string, isForbidden: boolean = false) => {};
 
 

[Survived] ObjectLiteral
services/auditService.ts:45:35
  */
 export const logSecurityFailure = async (req: Request, reason: string, isForbidden: boolean = false) => {
     const user = req.user;
-    return await logSecurityEvent({
-        userId: user?.id,
-        username: user?.username || 'Guest',
-        action: isForbidden ? AuditAction.FORBIDDEN_ACTION : AuditAction.UNAUTHORIZED_ACCESS,
-        details: {
-            path: req.path,
-            method: req.method,
-            reason: reason,
-            userAgent: req.get('user-agent') || 'Unknown'
-        },
-        ip: req.ip
-    });
+    return await logSecurityEvent({});
 };
 

[Survived] OptionalChaining
services/auditService.ts:46:17
 export const logSecurityFailure = async (req: Request, reason: string, isForbidden: boolean = false) => {
     const user = req.user;
     return await logSecurityEvent({
-        userId: user?.id,
+        userId: user.id,
         username: user?.username || 'Guest',
         action: isForbidden ? AuditAction.FORBIDDEN_ACTION : AuditAction.UNAUTHORIZED_ACCESS,

[Survived] ConditionalExpression
services/auditService.ts:47:19
     const user = req.user;
     return await logSecurityEvent({
         userId: user?.id,
-        username: user?.username || 'Guest',
+        username: false,
         action: isForbidden ? AuditAction.FORBIDDEN_ACTION : AuditAction.UNAUTHORIZED_ACCESS,
         details: {

[Survived] ConditionalExpression
services/auditService.ts:47:19
     const user = req.user;
     return await logSecurityEvent({
         userId: user?.id,
-        username: user?.username || 'Guest',
+        username: true,
         action: isForbidden ? AuditAction.FORBIDDEN_ACTION : AuditAction.UNAUTHORIZED_ACCESS,
         details: {

[Survived] ConditionalExpression
services/auditService.ts:53:24
             path: req.path,
             method: req.method,
             reason: reason,
-            userAgent: req.get('user-agent') || 'Unknown'
+            userAgent: true
         },
         ip: req.ip

[Survived] ConditionalExpression
services/auditService.ts:53:24
             path: req.path,
             method: req.method,
             reason: reason,
-            userAgent: req.get('user-agent') || 'Unknown'
+            userAgent: false
         },
         ip: req.ip
