[Timeout] LogicalOperator
controllers/donationController.ts:6:20
 import supabase from '../config/supabaseClient.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-const webhookUrl = process.env.DISCORD_DONATION_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
+const webhookUrl = process.env.DISCORD_DONATION_WEBHOOK_URL && process.env.DISCORD_WEBHOOK_URL;
 
 // Helper to send Discord Webhook

[Timeout] ConditionalExpression
controllers/donationController.ts:6:20
 import supabase from '../config/supabaseClient.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-const webhookUrl = process.env.DISCORD_DONATION_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
+const webhookUrl = false;
 
 // Helper to send Discord Webhook

[NoCoverage] BlockStatement
controllers/donationController.ts:16:65
     message?: string;
 }
 
-const sendDiscordWebhook = async (donation: WebhookDonation) => {
-    if (!webhookUrl) return;
-    try {
-        const webhookClient = new WebhookClient({ url: webhookUrl });
-        const embed = new EmbedBuilder()
-            .setTitle('🎉 ¡Nueva Donación!')
-            .setColor(0xFFD700)
-            .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)
-            .addFields({ name: 'Mensaje', value: donation.message || '¡Muchas gracias por el apoyo! 🌊' })
-            .setTimestamp()
-            .setFooter({ text: 'CrystalTides SMP' });
-
-        await webhookClient.send({
-            embeds: [embed],
-        });
-    } catch (error) {
-        console.error('Error sending webhook:', error);
-    }
-}
+const sendDiscordWebhook = async (donation: WebhookDonation) => {}
 
 export const testDonation = async (req: Request, res: Response) => {

[NoCoverage] BooleanLiteral
controllers/donationController.ts:17:9
 }
 
 const sendDiscordWebhook = async (donation: WebhookDonation) => {
-    if (!webhookUrl) return;
+    if (webhookUrl) return;
     try {
         const webhookClient = new WebhookClient({ url: webhookUrl });

[NoCoverage] ConditionalExpression
controllers/donationController.ts:17:9
 }
 
 const sendDiscordWebhook = async (donation: WebhookDonation) => {
-    if (!webhookUrl) return;
+    if (true) return;
     try {
         const webhookClient = new WebhookClient({ url: webhookUrl });

[NoCoverage] BlockStatement
controllers/donationController.ts:18:9
 
 const sendDiscordWebhook = async (donation: WebhookDonation) => {
     if (!webhookUrl) return;
-    try {
-        const webhookClient = new WebhookClient({ url: webhookUrl });
-        const embed = new EmbedBuilder()
-            .setTitle('🎉 ¡Nueva Donación!')
-            .setColor(0xFFD700)
-            .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)
-            .addFields({ name: 'Mensaje', value: donation.message || '¡Muchas gracias por el apoyo! 🌊' })
-            .setTimestamp()
-            .setFooter({ text: 'CrystalTides SMP' });
-
-        await webhookClient.send({
-            embeds: [embed],
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error sending webhook:', error);
     }

[NoCoverage] ObjectLiteral
controllers/donationController.ts:19:49
 const sendDiscordWebhook = async (donation: WebhookDonation) => {
     if (!webhookUrl) return;
     try {
-        const webhookClient = new WebhookClient({ url: webhookUrl });
+        const webhookClient = new WebhookClient({});
         const embed = new EmbedBuilder()
             .setTitle('🎉 ¡Nueva Donación!')

[NoCoverage] StringLiteral
controllers/donationController.ts:21:23
     try {
         const webhookClient = new WebhookClient({ url: webhookUrl });
         const embed = new EmbedBuilder()
-            .setTitle('🎉 ¡Nueva Donación!')
+            .setTitle(""
             .setColor(0xFFD700)
             .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)

[NoCoverage] ConditionalExpression
controllers/donationController.ts:23:34
         const embed = new EmbedBuilder()
             .setTitle('🎉 ¡Nueva Donación!')
             .setColor(0xFFD700)
-            .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)
+            .setDescription(`**${false}** ha donado **${donation.amount} ${donation.currency}**!`)
             .addFields({ name: 'Mensaje', value: donation.message || '¡Muchas gracias por el apoyo! 🌊' })
             .setTimestamp()

[NoCoverage] ConditionalExpression
controllers/donationController.ts:23:34
         const embed = new EmbedBuilder()
             .setTitle('🎉 ¡Nueva Donación!')
             .setColor(0xFFD700)
-            .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)
+            .setDescription(`**${true}** ha donado **${donation.amount} ${donation.currency}**!`)
             .addFields({ name: 'Mensaje', value: donation.message || '¡Muchas gracias por el apoyo! 🌊' })
             .setTimestamp()

[NoCoverage] ConditionalExpression
controllers/donationController.ts:24:50
             .setTitle('🎉 ¡Nueva Donación!')
             .setColor(0xFFD700)
             .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)
-            .addFields({ name: 'Mensaje', value: donation.message || '¡Muchas gracias por el apoyo! 🌊' })
+            .addFields({ name: 'Mensaje', value: false})
             .setTimestamp()
             .setFooter({ text: 'CrystalTides SMP' });

[NoCoverage] LogicalOperator
controllers/donationController.ts:24:50
             .setTitle('🎉 ¡Nueva Donación!')
             .setColor(0xFFD700)
             .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)
-            .addFields({ name: 'Mensaje', value: donation.message || '¡Muchas gracias por el apoyo! 🌊' })
+            .addFields({ name: 'Mensaje', value: donation.message && '¡Muchas gracias por el apoyo! 🌊'})
             .setTimestamp()
             .setFooter({ text: 'CrystalTides SMP' });

[NoCoverage] StringLiteral
controllers/donationController.ts:26:32
             .setDescription(`**${donation.from_name || 'Anónimo'}** ha donado **${donation.amount} ${donation.currency}**!`)
             .addFields({ name: 'Mensaje', value: donation.message || '¡Muchas gracias por el apoyo! 🌊' })
             .setTimestamp()
-            .setFooter({ text: 'CrystalTides SMP' });
+            .setFooter({ text: "" });
 
         await webhookClient.send({

[NoCoverage] BlockStatement
controllers/donationController.ts:31:21
         await webhookClient.send({
             embeds: [embed],
         });
-    } catch (error) {
-        console.error('Error sending webhook:', error);
-    }
+    } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/donationController.ts:43:22
         // 1. Insert into Supabase so it shows up on the frontend real-time carousel
         const { data, error } = await supabase
             .from('donations')
-            .insert([{ 
-                message_id: `test_${Date.now()}`,
-                from_name: username || 'Donador de Prueba', 
-                amount: amount || 5.00, 
-                currency: currency || 'USD', 
-                message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 
-                is_public: true,
-                created_at: new Date().toISOString()
-            }])
+            .insert([{}])
             .select()
             .single();

[NoCoverage] LogicalOperator
controllers/donationController.ts:45:28
             .from('donations')
             .insert([{ 
                 message_id: `test_${Date.now()}`,
-                from_name: username || 'Donador de Prueba', 
+                from_name: username && 'Donador de Prueba', 
                 amount: amount || 5.00, 
                 currency: currency || 'USD', 

[NoCoverage] ConditionalExpression
controllers/donationController.ts:45:28
             .from('donations')
             .insert([{ 
                 message_id: `test_${Date.now()}`,
-                from_name: username || 'Donador de Prueba', 
+                from_name: false, 
                 amount: amount || 5.00, 
                 currency: currency || 'USD', 

[NoCoverage] ConditionalExpression
controllers/donationController.ts:46:25
             .insert([{ 
                 message_id: `test_${Date.now()}`,
                 from_name: username || 'Donador de Prueba', 
-                amount: amount || 5.00, 
+                amount: true, 
                 currency: currency || 'USD', 
                 message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 

[NoCoverage] ConditionalExpression
controllers/donationController.ts:46:25
             .insert([{ 
                 message_id: `test_${Date.now()}`,
                 from_name: username || 'Donador de Prueba', 
-                amount: amount || 5.00, 
+                amount: false, 
                 currency: currency || 'USD', 
                 message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 

[NoCoverage] LogicalOperator
controllers/donationController.ts:47:27
                 message_id: `test_${Date.now()}`,
                 from_name: username || 'Donador de Prueba', 
                 amount: amount || 5.00, 
-                currency: currency || 'USD', 
+                currency: currency && 'USD', 
                 message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 
                 is_public: true,

[NoCoverage] ConditionalExpression
controllers/donationController.ts:47:27
                 message_id: `test_${Date.now()}`,
                 from_name: username || 'Donador de Prueba', 
                 amount: amount || 5.00, 
-                currency: currency || 'USD', 
+                currency: false, 
                 message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 
                 is_public: true,

[NoCoverage] ConditionalExpression
controllers/donationController.ts:48:26
                 from_name: username || 'Donador de Prueba', 
                 amount: amount || 5.00, 
                 currency: currency || 'USD', 
-                message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 
+                message: true 
                 is_public: true,
                 created_at: new Date().toISOString()

[NoCoverage] ConditionalExpression
controllers/donationController.ts:48:26
                 from_name: username || 'Donador de Prueba', 
                 amount: amount || 5.00, 
                 currency: currency || 'USD', 
-                message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 
+                message: false 
                 is_public: true,
                 created_at: new Date().toISOString()

[NoCoverage] BooleanLiteral
controllers/donationController.ts:49:28
                 amount: amount || 5.00, 
                 currency: currency || 'USD', 
                 message: message || '¡Esto es una prueba del sistema de donaciones! 🚀', 
-                is_public: true,
+                is_public: false,
                 created_at: new Date().toISOString()
             }])

[NoCoverage] BooleanLiteral
controllers/donationController.ts:65:29
             message: data.message
         });
 
-        res.json({ success: true, message: 'Test donation recorded and alert sent', data });
+        res.json({ success: false, message: 'Test donation recorded and alert sent', data });
     } catch (error) {
         console.error('Error in testDonation:', error);

[NoCoverage] BlockStatement
controllers/donationController.ts:66:21
         });
 
         res.json({ success: true, message: 'Test donation recorded and alert sent', data });
-    } catch (error) {
-        console.error('Error in testDonation:', error);
-        res.status(500).json({ success: false, message: 'Failed to process test donation' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/donationController.ts:68:41
         res.json({ success: true, message: 'Test donation recorded and alert sent', data });
     } catch (error) {
         console.error('Error in testDonation:', error);
-        res.status(500).json({ success: false, message: 'Failed to process test donation' });
+        res.status(500).json({ success: true, message: 'Failed to process test donation' });
     }
 };

[NoCoverage] ConditionalExpression
controllers/donationController.ts:74:22
 
 export const getDonations = async (req: Request, res: Response) => {
     try {
-        const page = Number.parseInt(ensureString(req.query.page), 10) || 1;
+        const page = true;
         const limit = Number.parseInt(ensureString(req.query.limit), 10) || 20;
         const search = ensureString(req.query.search);

[NoCoverage] ConditionalExpression
controllers/donationController.ts:74:22
 
 export const getDonations = async (req: Request, res: Response) => {
     try {
-        const page = Number.parseInt(ensureString(req.query.page), 10) || 1;
+        const page = false;
         const limit = Number.parseInt(ensureString(req.query.limit), 10) || 20;
         const search = ensureString(req.query.search);

[NoCoverage] ConditionalExpression
controllers/donationController.ts:75:23
 export const getDonations = async (req: Request, res: Response) => {
     try {
         const page = Number.parseInt(ensureString(req.query.page), 10) || 1;
-        const limit = Number.parseInt(ensureString(req.query.limit), 10) || 20;
+        const limit = true;
         const search = ensureString(req.query.search);
 

[NoCoverage] ConditionalExpression
controllers/donationController.ts:75:23
 export const getDonations = async (req: Request, res: Response) => {
     try {
         const page = Number.parseInt(ensureString(req.query.page), 10) || 1;
-        const limit = Number.parseInt(ensureString(req.query.limit), 10) || 20;
+        const limit = false;
         const search = ensureString(req.query.search);
 

[NoCoverage] StringLiteral
controllers/donationController.ts:79:19
         const search = ensureString(req.query.search);
 
         let query = supabase
-            .from('donations')
+            .from("")
             .select('*', { count: 'exact' })
             .order('created_at', { ascending: false })

[NoCoverage] ObjectLiteral
controllers/donationController.ts:80:26
 
         let query = supabase
             .from('donations')
-            .select('*', { count: 'exact' })
+            .select('*', {})
             .order('created_at', { ascending: false })
             .range((page - 1) * limit, page * limit - 1);

[NoCoverage] BooleanLiteral
controllers/donationController.ts:81:47
         let query = supabase
             .from('donations')
             .select('*', { count: 'exact' })
-            .order('created_at', { ascending: false })
+            .order('created_at', { ascending: true })
             .range((page - 1) * limit, page * limit - 1);
 

[NoCoverage] StringLiteral
controllers/donationController.ts:81:20
         let query = supabase
             .from('donations')
             .select('*', { count: 'exact' })
-            .order('created_at', { ascending: false })
+            .order("", { ascending: false })
             .range((page - 1) * limit, page * limit - 1);
 

[NoCoverage] ArithmeticOperator
controllers/donationController.ts:82:21
             .from('donations')
             .select('*', { count: 'exact' })
             .order('created_at', { ascending: false })
-            .range((page - 1) * limit, page * limit - 1);
+            .range((page + 1) * limit, page * limit - 1);
 
         if (search) {

[NoCoverage] ArithmeticOperator
controllers/donationController.ts:82:40
             .from('donations')
             .select('*', { count: 'exact' })
             .order('created_at', { ascending: false })
-            .range((page - 1) * limit, page * limit - 1);
+            .range((page - 1) * limit, page / limit - 1);
 
         if (search) {

[NoCoverage] BlockStatement
controllers/donationController.ts:84:21
             .order('created_at', { ascending: false })
             .range((page - 1) * limit, page * limit - 1);
 
-        if (search) {
-            query = query.ilike('from_name', `%${search}%`);
-        }
+        if (search) {}
 
         const { data, error, count } = await query;

[NoCoverage] LogicalOperator
controllers/donationController.ts:94:20
 
         res.json({
             data: data,
-            total: count || 0,
+            total: count && 0,
             page,
             totalPages: count ? Math.ceil(count / limit) : 1

[NoCoverage] ConditionalExpression
controllers/donationController.ts:94:20
 
         res.json({
             data: data,
-            total: count || 0,
+            total: true,
             page,
             totalPages: count ? Math.ceil(count / limit) : 1

[NoCoverage] ArithmeticOperator
controllers/donationController.ts:96:43
             data: data,
             total: count || 0,
             page,
-            totalPages: count ? Math.ceil(count / limit) : 1
+            totalPages: count ? Math.ceil(count * limit) : 1
         });
     } catch (error) {

[NoCoverage] BlockStatement
controllers/donationController.ts:98:21
             page,
             totalPages: count ? Math.ceil(count / limit) : 1
         });
-    } catch (error) {
-        console.error('Error fetching donations:', error);
-        res.status(500).json({ message: 'Error fetching donations' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/donationController.ts:99:23
             totalPages: count ? Math.ceil(count / limit) : 1
         });
     } catch (error) {
-        console.error('Error fetching donations:', error);
+        console.error("", error);
         res.status(500).json({ message: 'Error fetching donations' });
     }

[NoCoverage] StringLiteral
controllers/donationController.ts:100:41
         });
     } catch (error) {
         console.error('Error fetching donations:', error);
-        res.status(500).json({ message: 'Error fetching donations' });
+        res.status(500).json({ message: "" });
     }
 };

[NoCoverage] BlockStatement
controllers/donationController.ts:105:9
 };
 
 export const createDonation = async (req: Request, res: Response) => {
-    try {
-        const { from_name, amount, currency, message, is_public, email } = req.body;
-        
-        const { data, error } = await supabase
-            .from('donations')
-            .insert([{ 
-                from_name, 
-                amount, 
-                currency: currency || 'USD', 
-                message, 
-                is_public: is_public ?? true, 
-                buyer_email: email,
-                created_at: new Date()
-            }])
-            .select()
-            .single();
-
-        if (error) throw error;
-
-        // Optionally trigger webhook for real manual donations too
-        if (data) await sendDiscordWebhook(data);
-
-        res.status(201).json(data);
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error creating donation:', error);
         res.status(500).json({ message: 'Error creating donation' });

[NoCoverage] ConditionalExpression
controllers/donationController.ts:113:27
             .insert([{ 
                 from_name, 
                 amount, 
-                currency: currency || 'USD', 
+                currency: false, 
                 message, 
                 is_public: is_public ?? true, 

[NoCoverage] ConditionalExpression
controllers/donationController.ts:113:27
             .insert([{ 
                 from_name, 
                 amount, 
-                currency: currency || 'USD', 
+                currency: true, 
                 message, 
                 is_public: is_public ?? true, 

[NoCoverage] BooleanLiteral
controllers/donationController.ts:115:41
                 amount, 
                 currency: currency || 'USD', 
                 message, 
-                is_public: is_public ?? true, 
+                is_public: is_public ?? false, 
                 buyer_email: email,
                 created_at: new Date()

[NoCoverage] LogicalOperator
controllers/donationController.ts:115:28
                 amount, 
                 currency: currency || 'USD', 
                 message, 
-                is_public: is_public ?? true, 
+                is_public: is_public && true, 
                 buyer_email: email,
                 created_at: new Date()

[NoCoverage] ConditionalExpression
controllers/donationController.ts:125:13
         if (error) throw error;
 
         // Optionally trigger webhook for real manual donations too
-        if (data) await sendDiscordWebhook(data);
+        if (false) await sendDiscordWebhook(data);
 
         res.status(201).json(data);

[NoCoverage] ConditionalExpression
controllers/donationController.ts:125:13
         if (error) throw error;
 
         // Optionally trigger webhook for real manual donations too
-        if (data) await sendDiscordWebhook(data);
+        if (true) await sendDiscordWebhook(data);
 
         res.status(201).json(data);

[NoCoverage] BlockStatement
controllers/donationController.ts:128:21
         if (data) await sendDiscordWebhook(data);
 
         res.status(201).json(data);
-    } catch (error) {
-        console.error('Error creating donation:', error);
-        res.status(500).json({ message: 'Error creating donation' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/donationController.ts:129:23
 
         res.status(201).json(data);
     } catch (error) {
-        console.error('Error creating donation:', error);
+        console.error("", error);
         res.status(500).json({ message: 'Error creating donation' });
     }

[NoCoverage] ObjectLiteral
controllers/donationController.ts:130:30
         res.status(201).json(data);
     } catch (error) {
         console.error('Error creating donation:', error);
-        res.status(500).json({ message: 'Error creating donation' });
+        res.status(500).json({});
     }
 };

[NoCoverage] BlockStatement
controllers/donationController.ts:134:70
     }
 };
 
-export const updateDonation = async (req: Request, res: Response) => {
-    try {
-        const id = Number.parseInt(ensureString(req.params.id), 10);
-        const { data, error } = await supabase
-            .from('donations')
-            .update(req.body)
-            .eq('id', id)
-            .select()
-            .single();
-
-        if (error) throw error;
-        res.json(data);
-    } catch (error) {
-        console.error('Error updating donation:', error);
-        res.status(500).json({ message: 'Error updating donation' });
-    }
-};
+export const updateDonation = async (req: Request, res: Response) => {};
 
 export const deleteDonation = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/donationController.ts:135:9
 };
 
 export const updateDonation = async (req: Request, res: Response) => {
-    try {
-        const id = Number.parseInt(ensureString(req.params.id), 10);
-        const { data, error } = await supabase
-            .from('donations')
-            .update(req.body)
-            .eq('id', id)
-            .select()
-            .single();
-
-        if (error) throw error;
-        res.json(data);
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error updating donation:', error);
         res.status(500).json({ message: 'Error updating donation' });

[NoCoverage] BlockStatement
controllers/donationController.ts:146:21
 
         if (error) throw error;
         res.json(data);
-    } catch (error) {
-        console.error('Error updating donation:', error);
-        res.status(500).json({ message: 'Error updating donation' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/donationController.ts:152:70
     }
 };
 
-export const deleteDonation = async (req: Request, res: Response) => {
-    try {
-        const id = Number.parseInt(ensureString(req.params.id), 10);
-        const { error } = await supabase
-            .from('donations')
-            .delete()
-            .eq('id', id);
-
-        if (error) throw error;
-        res.json({ success: true });
-    } catch (error) {
-        console.error('Error deleting donation:', error);
-        res.status(500).json({ message: 'Error deleting donation' });
-    }
-};
+export const deleteDonation = async (req: Request, res: Response) => {};
 
 export const getDonationStats = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/donationController.ts:153:9
 };
 
 export const deleteDonation = async (req: Request, res: Response) => {
-    try {
-        const id = Number.parseInt(ensureString(req.params.id), 10);
-        const { error } = await supabase
-            .from('donations')
-            .delete()
-            .eq('id', id);
-
-        if (error) throw error;
-        res.json({ success: true });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error deleting donation:', error);
         res.status(500).json({ message: 'Error deleting donation' });

[NoCoverage] BooleanLiteral
controllers/donationController.ts:161:29
             .eq('id', id);
 
         if (error) throw error;
-        res.json({ success: true });
+        res.json({ success: false });
     } catch (error) {
         console.error('Error deleting donation:', error);

[NoCoverage] ObjectLiteral
controllers/donationController.ts:161:18
             .eq('id', id);
 
         if (error) throw error;
-        res.json({ success: true });
+        res.json({});
     } catch (error) {
         console.error('Error deleting donation:', error);

[NoCoverage] BlockStatement
controllers/donationController.ts:162:21
 
         if (error) throw error;
         res.json({ success: true });
-    } catch (error) {
-        console.error('Error deleting donation:', error);
-        res.status(500).json({ message: 'Error deleting donation' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/donationController.ts:163:23
         if (error) throw error;
         res.json({ success: true });
     } catch (error) {
-        console.error('Error deleting donation:', error);
+        console.error("", error);
         res.status(500).json({ message: 'Error deleting donation' });
     }

[NoCoverage] StringLiteral
controllers/donationController.ts:164:41
         res.json({ success: true });
     } catch (error) {
         console.error('Error deleting donation:', error);
-        res.status(500).json({ message: 'Error deleting donation' });
+        res.status(500).json({ message: "" });
     }
 };

[NoCoverage] LogicalOperator
controllers/donationController.ts:177:60
 
         if (error) throw error;
 
-        const totalAmount = data.reduce((sum, d) => sum + (Number(d.amount) || 0), 0);
+        const totalAmount = data.reduce((sum, d) => sum + (Number(d.amount) && 0), 0);
         
         // Detailed Month Calc

[NoCoverage] ArrowFunction
controllers/donationController.ts:177:41
 
         if (error) throw error;
 
-        const totalAmount = data.reduce((sum, d) => sum + (Number(d.amount) || 0), 0);
+        const totalAmount = data.reduce(() => undefined, 0);
         
         // Detailed Month Calc

[NoCoverage] ArithmeticOperator
controllers/donationController.ts:185:27
         const currentYear = now.getFullYear();
         
         const prevDate = new Date();
-        prevDate.setMonth(now.getMonth() - 1);
+        prevDate.setMonth(now.getMonth() + 1);
         const prevMonthIdx = prevDate.getMonth();
         const prevYear = prevDate.getFullYear();

[NoCoverage] MethodExpression
controllers/donationController.ts:185:9
         const currentYear = now.getFullYear();
         
         const prevDate = new Date();
-        prevDate.setMonth(now.getMonth() - 1);
+        prevDate.setFullYear(now.getMonth() - 1);
         const prevMonthIdx = prevDate.getMonth();
         const prevYear = prevDate.getFullYear();

[NoCoverage] BlockStatement
controllers/donationController.ts:195:27
         // Basic monthly aggregation in JS
         const months: Record<string, number> = {};
         
-        data.forEach(d => {
-            const date = new Date(d.created_at);
-            const amt = Number(d.amount) || 0;
-            
-            // Monthly Agg
-            const key = `${date.toLocaleString('default', { month: 'short' })}`; // e.g. "Dec"
-            months[key] = (months[key] || 0) + amt;
-
-            // Current Month Calc
-            if (date.getMonth() === currentMonthIdx && date.getFullYear() === currentYear) {
-                currentMonthParams += amt;
-            }
-
-            // Prev Month Calc
-            if (date.getMonth() === prevMonthIdx && date.getFullYear() === prevYear) {
-                prevMonthParams += amt;
-            }
-        });
+        data.forEach(d => {});
 
         // Calculate Percent Change

[NoCoverage] LogicalOperator
controllers/donationController.ts:197:25
         
         data.forEach(d => {
             const date = new Date(d.created_at);
-            const amt = Number(d.amount) || 0;
+            const amt = Number(d.amount) && 0;
             
             // Monthly Agg
