[NoCoverage] ConditionalExpression
controllers/donationController.ts:197:25
         
         data.forEach(d => {
             const date = new Date(d.created_at);
-            const amt = Number(d.amount) || 0;
+            const amt = false;
             
             // Monthly Agg

[NoCoverage] StringLiteral
controllers/donationController.ts:200:25
             const amt = Number(d.amount) || 0;
             
             // Monthly Agg
-            const key = `${date.toLocaleString('default', { month: 'short' })}`; // e.g. "Dec"
+            const key = ``; // e.g. "Dec"
             months[key] = (months[key] || 0) + amt;
 

[NoCoverage] StringLiteral
controllers/donationController.ts:200:68
             const amt = Number(d.amount) || 0;
             
             // Monthly Agg
-            const key = `${date.toLocaleString('default', { month: 'short' })}`; // e.g. "Dec"
+            const key = `${date.toLocaleString('default', { month: "" })}`; // e.g. "Dec"
             months[key] = (months[key] || 0) + amt;
 

[NoCoverage] ConditionalExpression
controllers/donationController.ts:201:28
             
             // Monthly Agg
             const key = `${date.toLocaleString('default', { month: 'short' })}`; // e.g. "Dec"
-            months[key] = (months[key] || 0) + amt;
+            months[key] = (false) + amt;
 
             // Current Month Calc

[NoCoverage] LogicalOperator
controllers/donationController.ts:201:28
             
             // Monthly Agg
             const key = `${date.toLocaleString('default', { month: 'short' })}`; // e.g. "Dec"
-            months[key] = (months[key] || 0) + amt;
+            months[key] = (months[key] && 0) + amt;
 
             // Current Month Calc

[NoCoverage] ConditionalExpression
controllers/donationController.ts:204:17
             months[key] = (months[key] || 0) + amt;
 
             // Current Month Calc
-            if (date.getMonth() === currentMonthIdx && date.getFullYear() === currentYear) {
+            if (true) {
                 currentMonthParams += amt;
             }

[NoCoverage] ConditionalExpression
controllers/donationController.ts:204:17
             months[key] = (months[key] || 0) + amt;
 
             // Current Month Calc
-            if (date.getMonth() === currentMonthIdx && date.getFullYear() === currentYear) {
+            if (true && date.getFullYear() === currentYear) {
                 currentMonthParams += amt;
             }

[NoCoverage] AssignmentOperator
controllers/donationController.ts:205:17
 
             // Current Month Calc
             if (date.getMonth() === currentMonthIdx && date.getFullYear() === currentYear) {
-                currentMonthParams += amt;
+                currentMonthParams -= amt;
             }
 

[NoCoverage] ConditionalExpression
controllers/donationController.ts:209:53
             }
 
             // Prev Month Calc
-            if (date.getMonth() === prevMonthIdx && date.getFullYear() === prevYear) {
+            if (date.getMonth() === prevMonthIdx && true) {
                 prevMonthParams += amt;
             }

[NoCoverage] BlockStatement
controllers/donationController.ts:209:86
             }
 
             // Prev Month Calc
-            if (date.getMonth() === prevMonthIdx && date.getFullYear() === prevYear) {
-                prevMonthParams += amt;
-            }
+            if (date.getMonth() === prevMonthIdx && date.getFullYear() === prevYear) {}
         });
 

[NoCoverage] AssignmentOperator
controllers/donationController.ts:210:17
 
             // Prev Month Calc
             if (date.getMonth() === prevMonthIdx && date.getFullYear() === prevYear) {
-                prevMonthParams += amt;
+                prevMonthParams -= amt;
             }
         });

[NoCoverage] ConditionalExpression
controllers/donationController.ts:216:13
 
         // Calculate Percent Change
         let percentChange = 0;
-        if (prevMonthParams === 0) {
+        if (true) {
             percentChange = currentMonthParams > 0 ? 100 : 0;
         } else {

[NoCoverage] BlockStatement
controllers/donationController.ts:216:36
 
         // Calculate Percent Change
         let percentChange = 0;
-        if (prevMonthParams === 0) {
-            percentChange = currentMonthParams > 0 ? 100 : 0;
-        } else {
+        if (prevMonthParams === 0) {} else {
             percentChange = ((currentMonthParams - prevMonthParams) / prevMonthParams) * 100;
         }

[NoCoverage] EqualityOperator
controllers/donationController.ts:217:29
         // Calculate Percent Change
         let percentChange = 0;
         if (prevMonthParams === 0) {
-            percentChange = currentMonthParams > 0 ? 100 : 0;
+            percentChange = currentMonthParams <= 0 ? 100 : 0;
         } else {
             percentChange = ((currentMonthParams - prevMonthParams) / prevMonthParams) * 100;

[NoCoverage] EqualityOperator
controllers/donationController.ts:217:29
         // Calculate Percent Change
         let percentChange = 0;
         if (prevMonthParams === 0) {
-            percentChange = currentMonthParams > 0 ? 100 : 0;
+            percentChange = currentMonthParams >= 0 ? 100 : 0;
         } else {
             percentChange = ((currentMonthParams - prevMonthParams) / prevMonthParams) * 100;

[NoCoverage] BlockStatement
controllers/donationController.ts:218:16
         let percentChange = 0;
         if (prevMonthParams === 0) {
             percentChange = currentMonthParams > 0 ? 100 : 0;
-        } else {
-            percentChange = ((currentMonthParams - prevMonthParams) / prevMonthParams) * 100;
-        }
+        } else {}
 
         const monthlyStats = Object.keys(months).map(month => ({

[NoCoverage] ArithmeticOperator
controllers/donationController.ts:219:31
         if (prevMonthParams === 0) {
             percentChange = currentMonthParams > 0 ? 100 : 0;
         } else {
-            percentChange = ((currentMonthParams - prevMonthParams) / prevMonthParams) * 100;
+            percentChange = ((currentMonthParams + prevMonthParams) / prevMonthParams) * 100;
         }
 

[NoCoverage] ArithmeticOperator
controllers/donationController.ts:219:30
         if (prevMonthParams === 0) {
             percentChange = currentMonthParams > 0 ? 100 : 0;
         } else {
-            percentChange = ((currentMonthParams - prevMonthParams) / prevMonthParams) * 100;
+            percentChange = ((currentMonthParams - prevMonthParams) * prevMonthParams) * 100;
         }
 

[NoCoverage] ArrowFunction
controllers/donationController.ts:222:54
             percentChange = ((currentMonthParams - prevMonthParams) / prevMonthParams) * 100;
         }
 
-        const monthlyStats = Object.keys(months).map(month => ({
-            month,
-            amount: months[month]
-        }));
+        const monthlyStats = Object.keys(months).map(() => undefined);
 
         res.json({

[NoCoverage] ObjectLiteral
controllers/donationController.ts:227:18
             amount: months[month]
         }));
 
-        res.json({
-            totalAmount,
-            currentMonth: currentMonthParams.toFixed(2),
-            percentChange: Math.round(percentChange),
-            count: data.length,
-            monthlyStats
-        });
+        res.json({});
     } catch (error) {
         console.error('Error fetching donation stats:', error);

[NoCoverage] BlockStatement
controllers/donationController.ts:234:21
             count: data.length,
             monthlyStats
         });
-    } catch (error) {
-        console.error('Error fetching donation stats:', error);
-        res.status(500).json({ message: 'Error fetching stats' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
controllers/donationController.ts:236:30
         });
     } catch (error) {
         console.error('Error fetching donation stats:', error);
-        res.status(500).json({ message: 'Error fetching stats' });
+        res.status(500).json({});
     }
 };
