[Timeout] StringLiteral
routes/authRoutes.ts:12:13
 const router = express.Router();
 
 // Public registration route (Rate limited by sensitiveActionLimiter on /api/auth in app.ts)
-router.post('/register', validate(registerSchema), authController.registerUser);
+router.post("", validate(registerSchema), authController.registerUser);
 
 // Protected 2FA routes (require valid Supabase session token)

[Timeout] StringLiteral
routes/authRoutes.ts:18:13
 router.use(authenticateToken);
 
 router.get('/2fa/status', twoFactorController.get2FAStatus);
-router.post('/2fa/setup', sensitiveActionLimiter, twoFactorController.setup2FA);
+router.post("", sensitiveActionLimiter, twoFactorController.setup2FA);
 router.post('/2fa/enable', sensitiveActionLimiter, validate(enable2FASchema), twoFactorController.enable2FA);
 router.post('/2fa/disable', sensitiveActionLimiter, twoFactorController.disable2FA);

[Timeout] StringLiteral
routes/authRoutes.ts:19:13
 
 router.get('/2fa/status', twoFactorController.get2FAStatus);
 router.post('/2fa/setup', sensitiveActionLimiter, twoFactorController.setup2FA);
-router.post('/2fa/enable', sensitiveActionLimiter, validate(enable2FASchema), twoFactorController.enable2FA);
+router.post("", sensitiveActionLimiter, validate(enable2FASchema), twoFactorController.enable2FA);
 router.post('/2fa/disable', sensitiveActionLimiter, twoFactorController.disable2FA);
 router.post('/2fa/verify', sensitiveActionLimiter, validate(verify2FASchema), twoFactorController.verify2FA);

[Timeout] StringLiteral
routes/authRoutes.ts:21:13
 router.post('/2fa/setup', sensitiveActionLimiter, twoFactorController.setup2FA);
 router.post('/2fa/enable', sensitiveActionLimiter, validate(enable2FASchema), twoFactorController.enable2FA);
 router.post('/2fa/disable', sensitiveActionLimiter, twoFactorController.disable2FA);
-router.post('/2fa/verify', sensitiveActionLimiter, validate(verify2FASchema), twoFactorController.verify2FA);
+router.post("", sensitiveActionLimiter, validate(verify2FASchema), twoFactorController.verify2FA);
 
 export default router;
