[Timeout] StringLiteral
routes/settingsRoutes.ts:13:12
 
 // Get settings: uses optional auth to decide if we show full list or public whitelist
 router.get('/', optionalAuthenticateToken, settingsController.getSettings);
-router.get('/:key', optionalAuthenticateToken, settingsController.getSetting);
+router.get("", optionalAuthenticateToken, settingsController.getSetting);
 
 // Protected routes: Update settings require admin privileges
