[NoCoverage] BlockStatement
controllers/eventController.ts:6:68
 import { Request, Response } from 'express';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getAllEvents = async (req: Request, res: Response) => {
-    try {
-        const events = await eventService.getAllEvents();
-        res.json(events);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
-};
+export const getAllEvents = async (req: Request, res: Response) => {};
 
 export const createEvent = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/eventController.ts:7:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getAllEvents = async (req: Request, res: Response) => {
-    try {
-        const events = await eventService.getAllEvents();
-        res.json(events);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });

[NoCoverage] BlockStatement
controllers/eventController.ts:10:21
     try {
         const events = await eventService.getAllEvents();
         res.json(events);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/eventController.ts:16:67
     }
 };
 
-export const createEvent = async (req: Request, res: Response) => {
-    try {
-        console.log("Creating event - Body received:", JSON.stringify(req.body));
-        const event = await eventService.createEvent(req.body);
-        const requestorUsername = req.user?.username || 'Admin';
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'CREATE_EVENT',
-            details: `Created event: ${event.title}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json(event);
-    } catch (error) {
-        console.error("Error creating event:", error);
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
-};
+export const createEvent = async (req: Request, res: Response) => {};
 
 export const updateEvent = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/eventController.ts:17:9
 };
 
 export const createEvent = async (req: Request, res: Response) => {
-    try {
-        console.log("Creating event - Body received:", JSON.stringify(req.body));
-        const event = await eventService.createEvent(req.body);
-        const requestorUsername = req.user?.username || 'Admin';
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'CREATE_EVENT',
-            details: `Created event: ${event.title}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json(event);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error creating event:", error);
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] OptionalChaining
controllers/eventController.ts:20:35
     try {
         console.log("Creating event - Body received:", JSON.stringify(req.body));
         const event = await eventService.createEvent(req.body);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = req.user.username || 'Admin';
 
         logService.createLog({

[NoCoverage] LogicalOperator
controllers/eventController.ts:20:35
     try {
         console.log("Creating event - Body received:", JSON.stringify(req.body));
         const event = await eventService.createEvent(req.body);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = req.user?.username && 'Admin';
 
         logService.createLog({

[NoCoverage] BlockStatement
controllers/eventController.ts:30:21
         }).catch(console.error);
 
         res.json(event);
-    } catch (error) {
-        console.error("Error creating event:", error);
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/eventController.ts:37:67
     }
 };
 
-export const updateEvent = async (req: Request, res: Response) => {
-    try {
-        const event = await eventService.updateEvent(parseInt(ensureString(req.params.id)), req.body);
-        const requestorUsername = req.user?.username || 'Admin';
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'UPDATE_EVENT',
-            details: `Updated event: ${event.title}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json(event);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
-};
+export const updateEvent = async (req: Request, res: Response) => {};
 
 export const deleteEvent = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/eventController.ts:38:9
 };
 
 export const updateEvent = async (req: Request, res: Response) => {
-    try {
-        const event = await eventService.updateEvent(parseInt(ensureString(req.params.id)), req.body);
-        const requestorUsername = req.user?.username || 'Admin';
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'UPDATE_EVENT',
-            details: `Updated event: ${event.title}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json(event);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });

[NoCoverage] ConditionalExpression
controllers/eventController.ts:40:35
 export const updateEvent = async (req: Request, res: Response) => {
     try {
         const event = await eventService.updateEvent(parseInt(ensureString(req.params.id)), req.body);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = true;
 
         logService.createLog({

[NoCoverage] ConditionalExpression
controllers/eventController.ts:40:35
 export const updateEvent = async (req: Request, res: Response) => {
     try {
         const event = await eventService.updateEvent(parseInt(ensureString(req.params.id)), req.body);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = false;
 
         logService.createLog({

[NoCoverage] ObjectLiteral
controllers/eventController.ts:42:30
         const event = await eventService.updateEvent(parseInt(ensureString(req.params.id)), req.body);
         const requestorUsername = req.user?.username || 'Admin';
 
-        logService.createLog({
-            username: requestorUsername,
-            action: 'UPDATE_EVENT',
-            details: `Updated event: ${event.title}`,
-            source: 'web'
-        }).catch(console.error);
+        logService.createLog({}).catch(console.error);
 
         res.json(event);

[NoCoverage] BlockStatement
controllers/eventController.ts:50:21
         }).catch(console.error);
 
         res.json(event);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/eventController.ts:56:67
     }
 };
 
-export const deleteEvent = async (req: Request, res: Response) => {
-    try {
-        const requestorUsername = req.user?.username || 'Admin';
-        await eventService.deleteEvent(parseInt(ensureString(req.params.id)));
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'DELETE_EVENT',
-            details: `Deleted event ID: ${ensureString(req.params.id)}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json({ message: "Evento eliminado" });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
-};
+export const deleteEvent = async (req: Request, res: Response) => {};
 
 export const registerForEvent = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/eventController.ts:57:9
 };
 
 export const deleteEvent = async (req: Request, res: Response) => {
-    try {
-        const requestorUsername = req.user?.username || 'Admin';
-        await eventService.deleteEvent(parseInt(ensureString(req.params.id)));
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'DELETE_EVENT',
-            details: `Deleted event ID: ${ensureString(req.params.id)}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json({ message: "Evento eliminado" });
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });

[NoCoverage] ConditionalExpression
controllers/eventController.ts:58:35
 
 export const deleteEvent = async (req: Request, res: Response) => {
     try {
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = true;
         await eventService.deleteEvent(parseInt(ensureString(req.params.id)));
 

[NoCoverage] ConditionalExpression
controllers/eventController.ts:58:35
 
 export const deleteEvent = async (req: Request, res: Response) => {
     try {
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = false;
         await eventService.deleteEvent(parseInt(ensureString(req.params.id)));
 

[NoCoverage] StringLiteral
controllers/eventController.ts:63:21
 
         logService.createLog({
             username: requestorUsername,
-            action: 'DELETE_EVENT',
+            action: "",
             details: `Deleted event ID: ${ensureString(req.params.id)}`,
             source: 'web'

[NoCoverage] StringLiteral
controllers/eventController.ts:68:29
             source: 'web'
         }).catch(console.error);
 
-        res.json({ message: "Evento eliminado" });
+        res.json({ message: "" });
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/eventController.ts:69:21
         }).catch(console.error);
 
         res.json({ message: "Evento eliminado" });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/eventController.ts:75:72
     }
 };
 
-export const registerForEvent = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        if (!user) return res.status(401).json({ error: "Unauthorized" });
-
-        const registration = await eventService.registerUser(parseInt(ensureString(req.params.id)), user.id);
-
-        logService.createLog({
-            user_id: user.id,
-            username: user.username || 'User', 
-            action: 'EVENT_REGISTER',
-            details: `Registered for event ${ensureString(req.params.id)}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json(registration);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(400).json({ error: message });
-    }
-};
+export const registerForEvent = async (req: Request, res: Response) => {};
 
 export const getUserRegistrations = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/eventController.ts:76:9
 };
 
 export const registerForEvent = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        if (!user) return res.status(401).json({ error: "Unauthorized" });
-
-        const registration = await eventService.registerUser(parseInt(ensureString(req.params.id)), user.id);
-
-        logService.createLog({
-            user_id: user.id,
-            username: user.username || 'User', 
-            action: 'EVENT_REGISTER',
-            details: `Registered for event ${ensureString(req.params.id)}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.json(registration);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(400).json({ error: message });

[NoCoverage] ConditionalExpression
controllers/eventController.ts:78:13
 export const registerForEvent = async (req: Request, res: Response) => {
     try {
         const user = req.user;
-        if (!user) return res.status(401).json({ error: "Unauthorized" });
+        if (true) return res.status(401).json({ error: "Unauthorized" });
 
         const registration = await eventService.registerUser(parseInt(ensureString(req.params.id)), user.id);

[NoCoverage] BooleanLiteral
controllers/eventController.ts:78:13
 export const registerForEvent = async (req: Request, res: Response) => {
     try {
         const user = req.user;
-        if (!user) return res.status(401).json({ error: "Unauthorized" });
+        if (user) return res.status(401).json({ error: "Unauthorized" });
 
         const registration = await eventService.registerUser(parseInt(ensureString(req.params.id)), user.id);

[NoCoverage] ObjectLiteral
controllers/eventController.ts:82:30
 
         const registration = await eventService.registerUser(parseInt(ensureString(req.params.id)), user.id);
 
-        logService.createLog({
-            user_id: user.id,
-            username: user.username || 'User', 
-            action: 'EVENT_REGISTER',
-            details: `Registered for event ${ensureString(req.params.id)}`,
-            source: 'web'
-        }).catch(console.error);
+        logService.createLog({}).catch(console.error);
 
         res.json(registration);

[NoCoverage] ConditionalExpression
controllers/eventController.ts:84:23
 
         logService.createLog({
             user_id: user.id,
-            username: user.username || 'User', 
+            username: true, 
             action: 'EVENT_REGISTER',
             details: `Registered for event ${ensureString(req.params.id)}`,

[NoCoverage] ConditionalExpression
controllers/eventController.ts:84:23
 
         logService.createLog({
             user_id: user.id,
-            username: user.username || 'User', 
+            username: false, 
             action: 'EVENT_REGISTER',
             details: `Registered for event ${ensureString(req.params.id)}`,

[NoCoverage] BlockStatement
controllers/eventController.ts:91:21
         }).catch(console.error);
 
         res.json(registration);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(400).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
controllers/eventController.ts:93:30
         res.json(registration);
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);
-        res.status(400).json({ error: message });
+        res.status(400).json({});
     }
 };

[NoCoverage] BlockStatement
controllers/eventController.ts:97:76
     }
 };
 
-export const getUserRegistrations = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        if (!user) return res.status(401).json({ error: "Unauthorized" });
-
-        const registrationIds = await eventService.getUserRegistrations(user.id);
-        res.json(registrationIds);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
-};
+export const getUserRegistrations = async (req: Request, res: Response) => {};
 
 export const getEventRegistrations = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/eventController.ts:98:9
 };
 
 export const getUserRegistrations = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        if (!user) return res.status(401).json({ error: "Unauthorized" });
-
-        const registrationIds = await eventService.getUserRegistrations(user.id);
-        res.json(registrationIds);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });

[NoCoverage] BlockStatement
controllers/eventController.ts:104:21
 
         const registrationIds = await eventService.getUserRegistrations(user.id);
         res.json(registrationIds);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/eventController.ts:110:77
     }
 };
 
-export const getEventRegistrations = async (req: Request, res: Response) => {
-    try {
-        const registrations = await eventService.getRegistrations(parseInt(ensureString(req.params.id)));
-        res.json(registrations);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
-};
+export const getEventRegistrations = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/eventController.ts:111:9
 };
 
 export const getEventRegistrations = async (req: Request, res: Response) => {
-    try {
-        const registrations = await eventService.getRegistrations(parseInt(ensureString(req.params.id)));
-        res.json(registrations);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });

[NoCoverage] BlockStatement
controllers/eventController.ts:114:21
     try {
         const registrations = await eventService.getRegistrations(parseInt(ensureString(req.params.id)));
         res.json(registrations);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 
