[NoCoverage] BlockStatement
controllers/gachaController.ts:10:9
 import { refundGachaBalance } from '../services/gachaBalanceService.js';
 
 export const roll = async (req: Request, res: Response) => {
-    try {
-        const { userId: bodyUserId, tierId, quantity, testResult, forceDeduction } = req.body;
-        const user = req.user;
-
-        if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
-
-        const userRole = (user.role || '').toLowerCase();
-        const isAdmin = ADMIN_ROLES.includes(userRole);
-
-        const targetUserId = isAdmin && bodyUserId ? bodyUserId : user.id;
-        const finalTestResult = isAdmin ? testResult : undefined;
-        const finalForceDeduction = isAdmin ? forceDeduction : undefined;
-
-        const reward = await gachaService.rollGacha(
-            targetUserId,
-            tierId,
-            quantity || 1,
-            isAdmin,
-            finalTestResult,
-            finalForceDeduction
-        );
-        return sendSuccess(res, reward, 'Gacha roll successful');
-
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         console.error('Gacha Roll Error:', error);
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:14:13
         const { userId: bodyUserId, tierId, quantity, testResult, forceDeduction } = req.body;
         const user = req.user;
 
-        if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
+        if (false) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
 
         const userRole = (user.role || '').toLowerCase();

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:14:13
         const { userId: bodyUserId, tierId, quantity, testResult, forceDeduction } = req.body;
         const user = req.user;
 
-        if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
+        if (true) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
 
         const userRole = (user.role || '').toLowerCase();

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:16:27
 
         if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
 
-        const userRole = (user.role || '').toLowerCase();
+        const userRole = (true).toLowerCase();
         const isAdmin = ADMIN_ROLES.includes(userRole);
 

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:16:27
 
         if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
 
-        const userRole = (user.role || '').toLowerCase();
+        const userRole = (false).toLowerCase();
         const isAdmin = ADMIN_ROLES.includes(userRole);
 

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:19:30
         const userRole = (user.role || '').toLowerCase();
         const isAdmin = ADMIN_ROLES.includes(userRole);
 
-        const targetUserId = isAdmin && bodyUserId ? bodyUserId : user.id;
+        const targetUserId = false ? bodyUserId : user.id;
         const finalTestResult = isAdmin ? testResult : undefined;
         const finalForceDeduction = isAdmin ? forceDeduction : undefined;

[NoCoverage] LogicalOperator
controllers/gachaController.ts:19:30
         const userRole = (user.role || '').toLowerCase();
         const isAdmin = ADMIN_ROLES.includes(userRole);
 
-        const targetUserId = isAdmin && bodyUserId ? bodyUserId : user.id;
+        const targetUserId = isAdmin || bodyUserId ? bodyUserId : user.id;
         const finalTestResult = isAdmin ? testResult : undefined;
         const finalForceDeduction = isAdmin ? forceDeduction : undefined;

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:26:13
         const reward = await gachaService.rollGacha(
             targetUserId,
             tierId,
-            quantity || 1,
+            false,
             isAdmin,
             finalTestResult,

[NoCoverage] LogicalOperator
controllers/gachaController.ts:26:13
         const reward = await gachaService.rollGacha(
             targetUserId,
             tierId,
-            quantity || 1,
+            quantity && 1,
             isAdmin,
             finalTestResult,

[NoCoverage] BlockStatement
controllers/gachaController.ts:33:30
         );
         return sendSuccess(res, reward, 'Gacha roll successful');
 
-    } catch (error: unknown) {
-        console.error('Gacha Roll Error:', error);
-        const message = error instanceof Error ? error.message : String(error);
-        if (message === "ACCOUNT_NOT_LINKED") {
-             return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "NOT_LINKED", 400);
-        }
-        if (message === "INSUFFICIENT_BALANCE") {
-             return sendError(res, "Saldo insuficiente de KilluCoins.", "INSUFFICIENT_BALANCE", 400);
-        }
-        if (message === "TIER_LOCKED") {
-             return sendError(res, "Este tier de gacha no está desbloqueado.", "TIER_LOCKED", 403);
-        }
-        if (message === "INVALID_TIER") {
-             return sendError(res, "Tier de gacha inválido.", "INVALID_TIER", 400);
-        }
-        return sendError(res, message || "Gacha failed", "INTERNAL_ERROR", 500);
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:36:13
     } catch (error: unknown) {
         console.error('Gacha Roll Error:', error);
         const message = error instanceof Error ? error.message : String(error);
-        if (message === "ACCOUNT_NOT_LINKED") {
+        if (true) {
              return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "NOT_LINKED", 400);
         }

[NoCoverage] EqualityOperator
controllers/gachaController.ts:36:13
     } catch (error: unknown) {
         console.error('Gacha Roll Error:', error);
         const message = error instanceof Error ? error.message : String(error);
-        if (message === "ACCOUNT_NOT_LINKED") {
+        if (message !== "ACCOUNT_NOT_LINKED") {
              return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "NOT_LINKED", 400);
         }

[NoCoverage] StringLiteral
controllers/gachaController.ts:37:107
         console.error('Gacha Roll Error:', error);
         const message = error instanceof Error ? error.message : String(error);
         if (message === "ACCOUNT_NOT_LINKED") {
-             return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "NOT_LINKED", 400);
+             return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "", 400);
         }
         if (message === "INSUFFICIENT_BALANCE") {

[NoCoverage] BlockStatement
controllers/gachaController.ts:39:49
         if (message === "ACCOUNT_NOT_LINKED") {
              return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "NOT_LINKED", 400);
         }
-        if (message === "INSUFFICIENT_BALANCE") {
-             return sendError(res, "Saldo insuficiente de KilluCoins.", "INSUFFICIENT_BALANCE", 400);
-        }
+        if (message === "INSUFFICIENT_BALANCE") {}
         if (message === "TIER_LOCKED") {
              return sendError(res, "Este tier de gacha no está desbloqueado.", "TIER_LOCKED", 403);

[NoCoverage] EqualityOperator
controllers/gachaController.ts:39:13
         if (message === "ACCOUNT_NOT_LINKED") {
              return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "NOT_LINKED", 400);
         }
-        if (message === "INSUFFICIENT_BALANCE") {
+        if (message !== "INSUFFICIENT_BALANCE") {
              return sendError(res, "Saldo insuficiente de KilluCoins.", "INSUFFICIENT_BALANCE", 400);
         }

[NoCoverage] StringLiteral
controllers/gachaController.ts:40:73
              return sendError(res, "Debes vincular tu cuenta de Minecraft primero para recibir premios.", "NOT_LINKED", 400);
         }
         if (message === "INSUFFICIENT_BALANCE") {
-             return sendError(res, "Saldo insuficiente de KilluCoins.", "INSUFFICIENT_BALANCE", 400);
+             return sendError(res, "Saldo insuficiente de KilluCoins.", "", 400);
         }
         if (message === "TIER_LOCKED") {

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:42:13
         if (message === "INSUFFICIENT_BALANCE") {
              return sendError(res, "Saldo insuficiente de KilluCoins.", "INSUFFICIENT_BALANCE", 400);
         }
-        if (message === "TIER_LOCKED") {
+        if (true) {
              return sendError(res, "Este tier de gacha no está desbloqueado.", "TIER_LOCKED", 403);
         }

[NoCoverage] BlockStatement
controllers/gachaController.ts:42:40
         if (message === "INSUFFICIENT_BALANCE") {
              return sendError(res, "Saldo insuficiente de KilluCoins.", "INSUFFICIENT_BALANCE", 400);
         }
-        if (message === "TIER_LOCKED") {
-             return sendError(res, "Este tier de gacha no está desbloqueado.", "TIER_LOCKED", 403);
-        }
+        if (message === "TIER_LOCKED") {}
         if (message === "INVALID_TIER") {
              return sendError(res, "Tier de gacha inválido.", "INVALID_TIER", 400);

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:45:13
         if (message === "TIER_LOCKED") {
              return sendError(res, "Este tier de gacha no está desbloqueado.", "TIER_LOCKED", 403);
         }
-        if (message === "INVALID_TIER") {
+        if (false) {
              return sendError(res, "Tier de gacha inválido.", "INVALID_TIER", 400);
         }

[NoCoverage] EqualityOperator
controllers/gachaController.ts:45:13
         if (message === "TIER_LOCKED") {
              return sendError(res, "Este tier de gacha no está desbloqueado.", "TIER_LOCKED", 403);
         }
-        if (message === "INVALID_TIER") {
+        if (message !== "INVALID_TIER") {
              return sendError(res, "Tier de gacha inválido.", "INVALID_TIER", 400);
         }

[NoCoverage] StringLiteral
controllers/gachaController.ts:46:63
              return sendError(res, "Este tier de gacha no está desbloqueado.", "TIER_LOCKED", 403);
         }
         if (message === "INVALID_TIER") {
-             return sendError(res, "Tier de gacha inválido.", "INVALID_TIER", 400);
+             return sendError(res, "Tier de gacha inválido.", "", 400);
         }
         return sendError(res, message || "Gacha failed", "INTERNAL_ERROR", 500);

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:48:31
         if (message === "INVALID_TIER") {
              return sendError(res, "Tier de gacha inválido.", "INVALID_TIER", 400);
         }
-        return sendError(res, message || "Gacha failed", "INTERNAL_ERROR", 500);
+        return sendError(res, false, "INTERNAL_ERROR", 500);
     }
 };

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:48:31
         if (message === "INVALID_TIER") {
              return sendError(res, "Tier de gacha inválido.", "INVALID_TIER", 400);
         }
-        return sendError(res, message || "Gacha failed", "INTERNAL_ERROR", 500);
+        return sendError(res, true, "INTERNAL_ERROR", 500);
     }
 };

[NoCoverage] BlockStatement
controllers/gachaController.ts:52:66
     }
 };
 
-export const getHistory = async (req: Request, res: Response) => {
-    try {
-        const userId = ensureString(req.params.userId);
-
-        const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
-             return sendError(res, "Unauthorized: You can only view your own history", "UNAUTHORIZED", 403);
-        }
-
-        const history = await gachaService.getHistory(userId);
-        return sendSuccess(res, history);
-    } catch (error: unknown) {
-        return sendError(res, error instanceof Error ? error.message : String(error));
-    }
-};
+export const getHistory = async (req: Request, res: Response) => {};
 
 export const getStatus = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/gachaController.ts:53:9
 };
 
 export const getHistory = async (req: Request, res: Response) => {
-    try {
-        const userId = ensureString(req.params.userId);
-
-        const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
-             return sendError(res, "Unauthorized: You can only view your own history", "UNAUTHORIZED", 403);
-        }
-
-        const history = await gachaService.getHistory(userId);
-        return sendSuccess(res, history);
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         return sendError(res, error instanceof Error ? error.message : String(error));
     }

[NoCoverage] OptionalChaining
controllers/gachaController.ts:56:46
     try {
         const userId = ensureString(req.params.userId);
 
-        const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
+        const isAdmin = ADMIN_ROLES.includes(req.user.role || '');
         if (req.user?.id !== userId && !isAdmin) {
              return sendError(res, "Unauthorized: You can only view your own history", "UNAUTHORIZED", 403);

[NoCoverage] LogicalOperator
controllers/gachaController.ts:56:46
     try {
         const userId = ensureString(req.params.userId);
 
-        const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
+        const isAdmin = ADMIN_ROLES.includes(req.user?.role && '');
         if (req.user?.id !== userId && !isAdmin) {
              return sendError(res, "Unauthorized: You can only view your own history", "UNAUTHORIZED", 403);

[NoCoverage] BlockStatement
controllers/gachaController.ts:57:50
         const userId = ensureString(req.params.userId);
 
         const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
-             return sendError(res, "Unauthorized: You can only view your own history", "UNAUTHORIZED", 403);
-        }
+        if (req.user?.id !== userId && !isAdmin) {}
 
         const history = await gachaService.getHistory(userId);

[NoCoverage] BooleanLiteral
controllers/gachaController.ts:57:40
         const userId = ensureString(req.params.userId);
 
         const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
+        if (req.user?.id !== userId && isAdmin) {
              return sendError(res, "Unauthorized: You can only view your own history", "UNAUTHORIZED", 403);
         }

[NoCoverage] StringLiteral
controllers/gachaController.ts:58:88
 
         const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
         if (req.user?.id !== userId && !isAdmin) {
-             return sendError(res, "Unauthorized: You can only view your own history", "UNAUTHORIZED", 403);
+             return sendError(res, "Unauthorized: You can only view your own history", "", 403);
         }
 

[NoCoverage] BlockStatement
controllers/gachaController.ts:63:30
 
         const history = await gachaService.getHistory(userId);
         return sendSuccess(res, history);
-    } catch (error: unknown) {
-        return sendError(res, error instanceof Error ? error.message : String(error));
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] BlockStatement
controllers/gachaController.ts:68:65
     }
 };
 
-export const getStatus = async (req: Request, res: Response) => {
-    try {
-        const userId = ensureString(req.params.userId);
-
-        const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
-            return sendError(res, "Unauthorized", "UNAUTHORIZED", 403);
-        }
-
-        const status = await gachaService.getGachaStatus(userId);
-        return sendSuccess(res, status);
-    } catch (error: unknown) {
-        return sendError(res, error instanceof Error ? error.message : String(error));
-    }
-};
+export const getStatus = async (req: Request, res: Response) => {};
 
 export const getTiers = async (_req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/gachaController.ts:69:9
 };
 
 export const getStatus = async (req: Request, res: Response) => {
-    try {
-        const userId = ensureString(req.params.userId);
-
-        const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
-            return sendError(res, "Unauthorized", "UNAUTHORIZED", 403);
-        }
-
-        const status = await gachaService.getGachaStatus(userId);
-        return sendSuccess(res, status);
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         return sendError(res, error instanceof Error ? error.message : String(error));
     }

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:72:46
     try {
         const userId = ensureString(req.params.userId);
 
-        const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
+        const isAdmin = ADMIN_ROLES.includes(false);
         if (req.user?.id !== userId && !isAdmin) {
             return sendError(res, "Unauthorized", "UNAUTHORIZED", 403);

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:73:13
         const userId = ensureString(req.params.userId);
 
         const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
+        if (false) {
             return sendError(res, "Unauthorized", "UNAUTHORIZED", 403);
         }

[NoCoverage] BlockStatement
controllers/gachaController.ts:73:50
         const userId = ensureString(req.params.userId);
 
         const isAdmin = ADMIN_ROLES.includes(req.user?.role || '');
-        if (req.user?.id !== userId && !isAdmin) {
-            return sendError(res, "Unauthorized", "UNAUTHORIZED", 403);
-        }
+        if (req.user?.id !== userId && !isAdmin) {}
 
         const status = await gachaService.getGachaStatus(userId);

[NoCoverage] BlockStatement
controllers/gachaController.ts:79:30
 
         const status = await gachaService.getGachaStatus(userId);
         return sendSuccess(res, status);
-    } catch (error: unknown) {
-        return sendError(res, error instanceof Error ? error.message : String(error));
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] BlockStatement
controllers/gachaController.ts:84:65
     }
 };
 
-export const getTiers = async (_req: Request, res: Response) => {
-    return sendSuccess(res, GACHA_TIERS);
-};
+export const getTiers = async (_req: Request, res: Response) => {};
 
 export const addFunds = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/gachaController.ts:88:64
     return sendSuccess(res, GACHA_TIERS);
 };
 
-export const addFunds = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
-
-        const { amount } = req.body;
-        const targetUserId = user.id;
-        const addAmount = Number(amount);
-        if (isNaN(addAmount) || addAmount <= 0) {
-            return sendError(res, "Cantidad inválida", "INVALID_AMOUNT", 400);
-        }
-
-        await refundGachaBalance(targetUserId, addAmount);
-
-        const status = await gachaService.getGachaStatus(targetUserId);
-        return sendSuccess(res, status, 'Funds added successfully');
-    } catch (error: unknown) {
-        console.error('Add Funds Error:', error);
-        return sendError(res, error instanceof Error ? error.message : String(error));
-    }
-};
+export const addFunds = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/gachaController.ts:89:9
 };
 
 export const addFunds = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
-
-        const { amount } = req.body;
-        const targetUserId = user.id;
-        const addAmount = Number(amount);
-        if (isNaN(addAmount) || addAmount <= 0) {
-            return sendError(res, "Cantidad inválida", "INVALID_AMOUNT", 400);
-        }
-
-        await refundGachaBalance(targetUserId, addAmount);
-
-        const status = await gachaService.getGachaStatus(targetUserId);
-        return sendSuccess(res, status, 'Funds added successfully');
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         console.error('Add Funds Error:', error);
         return sendError(res, error instanceof Error ? error.message : String(error));

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:91:13
 export const addFunds = async (req: Request, res: Response) => {
     try {
         const user = req.user;
-        if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
+        if (false) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
 
         const { amount } = req.body;

[NoCoverage] BooleanLiteral
controllers/gachaController.ts:91:13
 export const addFunds = async (req: Request, res: Response) => {
     try {
         const user = req.user;
-        if (!user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
+        if (user) return sendError(res, "Unauthorized", "UNAUTHORIZED", 401);
 
         const { amount } = req.body;

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:96:33
         const { amount } = req.body;
         const targetUserId = user.id;
         const addAmount = Number(amount);
-        if (isNaN(addAmount) || addAmount <= 0) {
+        if (isNaN(addAmount) || false) {
             return sendError(res, "Cantidad inválida", "INVALID_AMOUNT", 400);
         }

[NoCoverage] ConditionalExpression
controllers/gachaController.ts:96:13
         const { amount } = req.body;
         const targetUserId = user.id;
         const addAmount = Number(amount);
-        if (isNaN(addAmount) || addAmount <= 0) {
+        if (false) {
             return sendError(res, "Cantidad inválida", "INVALID_AMOUNT", 400);
         }

[NoCoverage] StringLiteral
controllers/gachaController.ts:103:41
         await refundGachaBalance(targetUserId, addAmount);
 
         const status = await gachaService.getGachaStatus(targetUserId);
-        return sendSuccess(res, status, 'Funds added successfully');
+        return sendSuccess(res, status, "");
     } catch (error: unknown) {
         console.error('Add Funds Error:', error);

[NoCoverage] BlockStatement
controllers/gachaController.ts:104:30
 
         const status = await gachaService.getGachaStatus(targetUserId);
         return sendSuccess(res, status, 'Funds added successfully');
-    } catch (error: unknown) {
-        console.error('Add Funds Error:', error);
-        return sendError(res, error instanceof Error ? error.message : String(error));
-    }
+    } catch (error: unknown) {}
 };
 
