[NoCoverage] BlockStatement
controllers/locationController.ts:15:53
     };
 }
 
-const getErrorMessage = (error: unknown): string => {
-    if (error instanceof Error) return error.message;
-    if (error && typeof error === 'object' && 'message' in error) {
-        return String((error as { message: unknown }).message);
-    }
-    return String(error);
-};
+const getErrorMessage = (error: unknown): string => {};
 
 export const getLocations = async (req: Request, res: Response) => {

[NoCoverage] ConditionalExpression
controllers/locationController.ts:16:9
 }
 
 const getErrorMessage = (error: unknown): string => {
-    if (error instanceof Error) return error.message;
+    if (true) return error.message;
     if (error && typeof error === 'object' && 'message' in error) {
         return String((error as { message: unknown }).message);

[NoCoverage] ConditionalExpression
controllers/locationController.ts:16:9
 }
 
 const getErrorMessage = (error: unknown): string => {
-    if (error instanceof Error) return error.message;
+    if (false) return error.message;
     if (error && typeof error === 'object' && 'message' in error) {
         return String((error as { message: unknown }).message);

[NoCoverage] EqualityOperator
controllers/locationController.ts:17:18
 
 const getErrorMessage = (error: unknown): string => {
     if (error instanceof Error) return error.message;
-    if (error && typeof error === 'object' && 'message' in error) {
+    if (error && typeof error !== 'object' && 'message' in error) {
         return String((error as { message: unknown }).message);
     }

[NoCoverage] ConditionalExpression
controllers/locationController.ts:17:18
 
 const getErrorMessage = (error: unknown): string => {
     if (error instanceof Error) return error.message;
-    if (error && typeof error === 'object' && 'message' in error) {
+    if (error && true && 'message' in error) {
         return String((error as { message: unknown }).message);
     }

[NoCoverage] BlockStatement
controllers/locationController.ts:23:68
     return String(error);
 };
 
-export const getLocations = async (req: Request, res: Response) => {
-    try {
-        const locations = await locationService.getAllLocations();
-        return sendSuccess(res, locations);
-    } catch (error) {
-        console.error("Error in getLocations:", error);
-        const message = getErrorMessage(error);
-        if (message.includes('relation "public.world_locations" does not exist')) {
-            return sendSuccess(res, [], 'Locations table not created yet');
-        }
-        return sendError(res, message, 'FETCH_ERROR', 500, error);
-    }
-};
+export const getLocations = async (req: Request, res: Response) => {};
 
 export const createLocation = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/locationController.ts:24:9
 };
 
 export const getLocations = async (req: Request, res: Response) => {
-    try {
-        const locations = await locationService.getAllLocations();
-        return sendSuccess(res, locations);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in getLocations:", error);
         const message = getErrorMessage(error);

[NoCoverage] BlockStatement
controllers/locationController.ts:27:21
     try {
         const locations = await locationService.getAllLocations();
         return sendSuccess(res, locations);
-    } catch (error) {
-        console.error("Error in getLocations:", error);
-        const message = getErrorMessage(error);
-        if (message.includes('relation "public.world_locations" does not exist')) {
-            return sendSuccess(res, [], 'Locations table not created yet');
-        }
-        return sendError(res, message, 'FETCH_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/locationController.ts:28:23
         const locations = await locationService.getAllLocations();
         return sendSuccess(res, locations);
     } catch (error) {
-        console.error("Error in getLocations:", error);
+        console.error("", error);
         const message = getErrorMessage(error);
         if (message.includes('relation "public.world_locations" does not exist')) {

[NoCoverage] BlockStatement
controllers/locationController.ts:30:83
     } catch (error) {
         console.error("Error in getLocations:", error);
         const message = getErrorMessage(error);
-        if (message.includes('relation "public.world_locations" does not exist')) {
-            return sendSuccess(res, [], 'Locations table not created yet');
-        }
+        if (message.includes('relation "public.world_locations" does not exist')) {}
         return sendError(res, message, 'FETCH_ERROR', 500, error);
     }

[NoCoverage] ConditionalExpression
controllers/locationController.ts:30:13
     } catch (error) {
         console.error("Error in getLocations:", error);
         const message = getErrorMessage(error);
-        if (message.includes('relation "public.world_locations" does not exist')) {
+        if (false) {
             return sendSuccess(res, [], 'Locations table not created yet');
         }

[NoCoverage] BooleanLiteral
controllers/locationController.ts:41:13
     try {
         const { title, description, long_description, coords, image_url, is_coming_soon, authors, sort_order } = req.body;
 
-        if (!title || !description || !long_description) {
+        if (title || !description || !long_description) {
             return sendError(res, 'Missing required fields: title, description, long_description', 'MISSING_FIELDS', 400);
         }

[NoCoverage] BooleanLiteral
controllers/locationController.ts:41:23
     try {
         const { title, description, long_description, coords, image_url, is_coming_soon, authors, sort_order } = req.body;
 
-        if (!title || !description || !long_description) {
+        if (!title || description || !long_description) {
             return sendError(res, 'Missing required fields: title, description, long_description', 'MISSING_FIELDS', 400);
         }

[NoCoverage] StringLiteral
controllers/locationController.ts:42:35
         const { title, description, long_description, coords, image_url, is_coming_soon, authors, sort_order } = req.body;
 
         if (!title || !description || !long_description) {
-            return sendError(res, 'Missing required fields: title, description, long_description', 'MISSING_FIELDS', 400);
+            return sendError(res, "", 'MISSING_FIELDS', 400);
         }
 

[NoCoverage] StringLiteral
controllers/locationController.ts:42:100
         const { title, description, long_description, coords, image_url, is_coming_soon, authors, sort_order } = req.body;
 
         if (!title || !description || !long_description) {
-            return sendError(res, 'Missing required fields: title, description, long_description', 'MISSING_FIELDS', 400);
+            return sendError(res, 'Missing required fields: title, description, long_description', "", 400);
         }
 

[NoCoverage] ObjectLiteral
controllers/locationController.ts:45:66
             return sendError(res, 'Missing required fields: title, description, long_description', 'MISSING_FIELDS', 400);
         }
 
-        const newLocation = await locationService.createLocation({
-            title,
-            description,
-            long_description,
-            coords: coords || '???',
-            image_url: image_url || null,
-            is_coming_soon: is_coming_soon || false,
-            authors: authors || [],
-            sort_order: sort_order || 0
-        });
+        const newLocation = await locationService.createLocation({});
 
         // Audit Log

[NoCoverage] ConditionalExpression
controllers/locationController.ts:49:21
             title,
             description,
             long_description,
-            coords: coords || '???',
+            coords: false,
             image_url: image_url || null,
             is_coming_soon: is_coming_soon || false,

[NoCoverage] LogicalOperator
controllers/locationController.ts:49:21
             title,
             description,
             long_description,
-            coords: coords || '???',
+            coords: coords && '???',
             image_url: image_url || null,
             is_coming_soon: is_coming_soon || false,

[NoCoverage] ConditionalExpression
controllers/locationController.ts:50:24
             description,
             long_description,
             coords: coords || '???',
-            image_url: image_url || null,
+            image_url: false,
             is_coming_soon: is_coming_soon || false,
             authors: authors || [],

[NoCoverage] LogicalOperator
controllers/locationController.ts:50:24
             description,
             long_description,
             coords: coords || '???',
-            image_url: image_url || null,
+            image_url: image_url && null,
             is_coming_soon: is_coming_soon || false,
             authors: authors || [],

[NoCoverage] ConditionalExpression
controllers/locationController.ts:51:29
             long_description,
             coords: coords || '???',
             image_url: image_url || null,
-            is_coming_soon: is_coming_soon || false,
+            is_coming_soon: false,
             authors: authors || [],
             sort_order: sort_order || 0

[NoCoverage] BooleanLiteral
controllers/locationController.ts:51:47
             long_description,
             coords: coords || '???',
             image_url: image_url || null,
-            is_coming_soon: is_coming_soon || false,
+            is_coming_soon: is_coming_soon || true,
             authors: authors || [],
             sort_order: sort_order || 0

[NoCoverage] ConditionalExpression
controllers/locationController.ts:52:22
             coords: coords || '???',
             image_url: image_url || null,
             is_coming_soon: is_coming_soon || false,
-            authors: authors || [],
+            authors: true,
             sort_order: sort_order || 0
         });

[NoCoverage] ConditionalExpression
controllers/locationController.ts:52:22
             coords: coords || '???',
             image_url: image_url || null,
             is_coming_soon: is_coming_soon || false,
-            authors: authors || [],
+            authors: false,
             sort_order: sort_order || 0
         });

[NoCoverage] LogicalOperator
controllers/locationController.ts:53:25
             image_url: image_url || null,
             is_coming_soon: is_coming_soon || false,
             authors: authors || [],
-            sort_order: sort_order || 0
+            sort_order: sort_order && 0
         });
 

[NoCoverage] ConditionalExpression
controllers/locationController.ts:53:25
             image_url: image_url || null,
             is_coming_soon: is_coming_soon || false,
             authors: authors || [],
-            sort_order: sort_order || 0
+            sort_order: false
         });
 

[NoCoverage] ConditionalExpression
controllers/locationController.ts:59:22
         // Audit Log
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
-            user_id: editor?.id || undefined,
+            user_id: false,
             username: editor?.username || 'Admin',
             action: 'CREATE_LOCATION',

[NoCoverage] LogicalOperator
controllers/locationController.ts:59:22
         // Audit Log
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
-            user_id: editor?.id || undefined,
+            user_id: editor?.id && undefined,
             username: editor?.username || 'Admin',
             action: 'CREATE_LOCATION',

[NoCoverage] OptionalChaining
controllers/locationController.ts:60:23
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
             user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
+            username: editor.username || 'Admin',
             action: 'CREATE_LOCATION',
             details: `Created location: ${title}`,

[NoCoverage] LogicalOperator
controllers/locationController.ts:60:23
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
             user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
+            username: editor?.username && 'Admin',
             action: 'CREATE_LOCATION',
             details: `Created location: ${title}`,

[NoCoverage] StringLiteral
controllers/locationController.ts:62:22
             user_id: editor?.id || undefined,
             username: editor?.username || 'Admin',
             action: 'CREATE_LOCATION',
-            details: `Created location: ${title}`,
+            details: ``,
             source: 'web'
         }).catch(console.error);

[NoCoverage] StringLiteral
controllers/locationController.ts:63:21
             username: editor?.username || 'Admin',
             action: 'CREATE_LOCATION',
             details: `Created location: ${title}`,
-            source: 'web'
+            source: ""
         }).catch(console.error);
 

[NoCoverage] BlockStatement
controllers/locationController.ts:67:21
         }).catch(console.error);
 
         return sendSuccess(res, newLocation, 'Location created successfully');
-    } catch (error) {
-        console.error("Error in createLocation:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'CREATE_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/locationController.ts:70:40
     } catch (error) {
         console.error("Error in createLocation:", error);
         const message = getErrorMessage(error);
-        return sendError(res, message, 'CREATE_ERROR', 500, error);
+        return sendError(res, message, "", 500, error);
     }
 };

[NoCoverage] BlockStatement
controllers/locationController.ts:74:70
     }
 };
 
-export const updateLocation = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const updates = req.body;
-
-        const updatedLocation = await locationService.updateLocation(parseInt(id), updates);
-
-        // Audit Log
-        const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'UPDATE_LOCATION',
-            details: `Updated location #${id}: ${updatedLocation.title}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, updatedLocation, 'Location updated successfully');
-    } catch (error) {
-        console.error("Error in updateLocation:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'UPDATE_ERROR', 500, error);
-    }
-};
+export const updateLocation = async (req: Request, res: Response) => {};
 
 export const deleteLocation = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/locationController.ts:75:9
 };
 
 export const updateLocation = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const updates = req.body;
-
-        const updatedLocation = await locationService.updateLocation(parseInt(id), updates);
-
-        // Audit Log
-        const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'UPDATE_LOCATION',
-            details: `Updated location #${id}: ${updatedLocation.title}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, updatedLocation, 'Location updated successfully');
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in updateLocation:", error);
         const message = getErrorMessage(error);

[NoCoverage] ObjectLiteral
controllers/locationController.ts:83:30
 
         // Audit Log
         const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'UPDATE_LOCATION',
-            details: `Updated location #${id}: ${updatedLocation.title}`,
-            source: 'web'
-        }).catch(console.error);
+        logService.createLog({}).catch(console.error);
 
         return sendSuccess(res, updatedLocation, 'Location updated successfully');

[NoCoverage] OptionalChaining
controllers/locationController.ts:84:22
         // Audit Log
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
-            user_id: editor?.id || undefined,
+            user_id: editor.id || undefined,
             username: editor?.username || 'Admin',
             action: 'UPDATE_LOCATION',

[NoCoverage] StringLiteral
controllers/locationController.ts:91:50
             source: 'web'
         }).catch(console.error);
 
-        return sendSuccess(res, updatedLocation, 'Location updated successfully');
+        return sendSuccess(res, updatedLocation, "");
     } catch (error) {
         console.error("Error in updateLocation:", error);

[NoCoverage] BlockStatement
controllers/locationController.ts:92:21
         }).catch(console.error);
 
         return sendSuccess(res, updatedLocation, 'Location updated successfully');
-    } catch (error) {
-        console.error("Error in updateLocation:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'UPDATE_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/locationController.ts:99:70
     }
 };
 
-export const deleteLocation = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-
-        await locationService.deleteLocation(parseInt(id));
-
-        // Audit Log
-        const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'DELETE_LOCATION',
-            details: `Deleted location #${id}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, null, 'Location deleted successfully');
-    } catch (error) {
-        console.error("Error in deleteLocation:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'DELETE_ERROR', 500, error);
-    }
-};
+export const deleteLocation = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/locationController.ts:100:9
 };
 
 export const deleteLocation = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-
-        await locationService.deleteLocation(parseInt(id));
-
-        // Audit Log
-        const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'DELETE_LOCATION',
-            details: `Deleted location #${id}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, null, 'Location deleted successfully');
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in deleteLocation:", error);
         const message = getErrorMessage(error);

[NoCoverage] ObjectLiteral
controllers/locationController.ts:107:30
 
         // Audit Log
         const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'DELETE_LOCATION',
-            details: `Deleted location #${id}`,
-            source: 'web'
-        }).catch(console.error);
+        logService.createLog({}).catch(console.error);
 
         return sendSuccess(res, null, 'Location deleted successfully');

[NoCoverage] ConditionalExpression
controllers/locationController.ts:108:22
         // Audit Log
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
-            user_id: editor?.id || undefined,
+            user_id: true,
             username: editor?.username || 'Admin',
             action: 'DELETE_LOCATION',

[NoCoverage] ConditionalExpression
controllers/locationController.ts:109:23
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
             user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
+            username: false,
             action: 'DELETE_LOCATION',
             details: `Deleted location #${id}`,

[NoCoverage] StringLiteral
controllers/locationController.ts:111:22
             user_id: editor?.id || undefined,
             username: editor?.username || 'Admin',
             action: 'DELETE_LOCATION',
-            details: `Deleted location #${id}`,
+            details: ``,
             source: 'web'
         }).catch(console.error);

[NoCoverage] BlockStatement
controllers/locationController.ts:116:21
         }).catch(console.error);
 
         return sendSuccess(res, null, 'Location deleted successfully');
-    } catch (error) {
-        console.error("Error in deleteLocation:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'DELETE_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/locationController.ts:117:23
 
         return sendSuccess(res, null, 'Location deleted successfully');
     } catch (error) {
-        console.error("Error in deleteLocation:", error);
+        console.error("", error);
         const message = getErrorMessage(error);
         return sendError(res, message, 'DELETE_ERROR', 500, error);
