[NoCoverage] BlockStatement
controllers/logController.ts:5:63
 import { Request, Response } from 'express';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getLogs = async (req: Request, res: Response) => {
-    try {
-        const page = ensureString(req.query.page, '1');
-        const limit = ensureString(req.query.limit, '50');
-        const source = ensureString(req.query.source, 'web');
-        const search = ensureString(req.query.search, '');
-        const offset = (parseInt(page) - 1) * parseInt(limit);
-
-        if (source === 'game') {
-            const data = await logService.getGameLogs({ limit: parseInt(limit), offset, search });
-            return res.json(data);
-        }
-    
-        const data = await logService.getLogs({ limit: parseInt(limit), offset, source, search });
-        res.json(data);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        res.status(500).json({ error: message });
-    }
-};
+export const getLogs = async (req: Request, res: Response) => {};
 
 export const createLog = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/logController.ts:6:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getLogs = async (req: Request, res: Response) => {
-    try {
-        const page = ensureString(req.query.page, '1');
-        const limit = ensureString(req.query.limit, '50');
-        const source = ensureString(req.query.source, 'web');
-        const search = ensureString(req.query.search, '');
-        const offset = (parseInt(page) - 1) * parseInt(limit);
-
-        if (source === 'game') {
-            const data = await logService.getGameLogs({ limit: parseInt(limit), offset, search });
-            return res.json(data);
-        }
-    
-        const data = await logService.getLogs({ limit: parseInt(limit), offset, source, search });
-        res.json(data);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         res.status(500).json({ error: message });

[NoCoverage] StringLiteral
controllers/logController.ts:7:51
 
 export const getLogs = async (req: Request, res: Response) => {
     try {
-        const page = ensureString(req.query.page, '1');
+        const page = ensureString(req.query.page, "");
         const limit = ensureString(req.query.limit, '50');
         const source = ensureString(req.query.source, 'web');

[NoCoverage] StringLiteral
controllers/logController.ts:8:53
 export const getLogs = async (req: Request, res: Response) => {
     try {
         const page = ensureString(req.query.page, '1');
-        const limit = ensureString(req.query.limit, '50');
+        const limit = ensureString(req.query.limit, "");
         const source = ensureString(req.query.source, 'web');
         const search = ensureString(req.query.search, '');

[NoCoverage] StringLiteral
controllers/logController.ts:9:55
     try {
         const page = ensureString(req.query.page, '1');
         const limit = ensureString(req.query.limit, '50');
-        const source = ensureString(req.query.source, 'web');
+        const source = ensureString(req.query.source, "");
         const search = ensureString(req.query.search, '');
         const offset = (parseInt(page) - 1) * parseInt(limit);

[NoCoverage] ArithmeticOperator
controllers/logController.ts:11:24
         const limit = ensureString(req.query.limit, '50');
         const source = ensureString(req.query.source, 'web');
         const search = ensureString(req.query.search, '');
-        const offset = (parseInt(page) - 1) * parseInt(limit);
+        const offset = (parseInt(page) - 1) / parseInt(limit);
 
         if (source === 'game') {

[NoCoverage] ArithmeticOperator
controllers/logController.ts:11:25
         const limit = ensureString(req.query.limit, '50');
         const source = ensureString(req.query.source, 'web');
         const search = ensureString(req.query.search, '');
-        const offset = (parseInt(page) - 1) * parseInt(limit);
+        const offset = (parseInt(page) + 1) * parseInt(limit);
 
         if (source === 'game') {

[NoCoverage] BlockStatement
controllers/logController.ts:13:32
         const search = ensureString(req.query.search, '');
         const offset = (parseInt(page) - 1) * parseInt(limit);
 
-        if (source === 'game') {
-            const data = await logService.getGameLogs({ limit: parseInt(limit), offset, search });
-            return res.json(data);
-        }
+        if (source === 'game') {}
     
         const data = await logService.getLogs({ limit: parseInt(limit), offset, source, search });

[NoCoverage] ConditionalExpression
controllers/logController.ts:13:13
         const search = ensureString(req.query.search, '');
         const offset = (parseInt(page) - 1) * parseInt(limit);
 
-        if (source === 'game') {
+        if (false) {
             const data = await logService.getGameLogs({ limit: parseInt(limit), offset, search });
             return res.json(data);

[NoCoverage] BlockStatement
controllers/logController.ts:20:21
     
         const data = await logService.getLogs({ limit: parseInt(limit), offset, source, search });
         res.json(data);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/logController.ts:26:65
     }
 };
 
-export const createLog = async (req: Request, res: Response) => {
-    try {
-        const logData = req.body;
-        const log = await logService.createLog(logData);
-        res.status(201).json(log);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        res.status(500).json({ error: message });
-    }
-};
+export const createLog = async (req: Request, res: Response) => {};
 
 export const reportSecurityAlert = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/logController.ts:27:9
 };
 
 export const createLog = async (req: Request, res: Response) => {
-    try {
-        const logData = req.body;
-        const log = await logService.createLog(logData);
-        res.status(201).json(log);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         res.status(500).json({ error: message });

[NoCoverage] BlockStatement
controllers/logController.ts:31:21
         const logData = req.body;
         const log = await logService.createLog(logData);
         res.status(201).json(log);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/logController.ts:37:75
     }
 };
 
-export const reportSecurityAlert = async (req: Request, res: Response) => {
-    try {
-        const { email, details } = req.body;
-        const ip = req.headers['x-forwarded-for'] || req.socket.remoteAddress;
-
-        // Create a SECURITY log
-        await logService.createLog({
-            username: 'SYSTEM_ALERT',
-            action: 'LOGIN_FAIL',
-            details: `Failed login attempt for: ${email}. IP: ${ip}. ${details || ''}`,
-            source: 'security'
-        });
-
-        // Always return success to not leak info to attacker
-        res.status(200).json({ success: true });
-    } catch (error) {
-        console.error("Security Report Error:", error);
-        res.status(200).json({ success: true }); // Silent fail
-    }
-};
+export const reportSecurityAlert = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/logController.ts:38:9
 };
 
 export const reportSecurityAlert = async (req: Request, res: Response) => {
-    try {
-        const { email, details } = req.body;
-        const ip = req.headers['x-forwarded-for'] || req.socket.remoteAddress;
-
-        // Create a SECURITY log
-        await logService.createLog({
-            username: 'SYSTEM_ALERT',
-            action: 'LOGIN_FAIL',
-            details: `Failed login attempt for: ${email}. IP: ${ip}. ${details || ''}`,
-            source: 'security'
-        });
-
-        // Always return success to not leak info to attacker
-        res.status(200).json({ success: true });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Security Report Error:", error);
         res.status(200).json({ success: true }); // Silent fail

[NoCoverage] LogicalOperator
controllers/logController.ts:40:20
 export const reportSecurityAlert = async (req: Request, res: Response) => {
     try {
         const { email, details } = req.body;
-        const ip = req.headers['x-forwarded-for'] || req.socket.remoteAddress;
+        const ip = req.headers['x-forwarded-for'] && req.socket.remoteAddress;
 
         // Create a SECURITY log

[NoCoverage] ConditionalExpression
controllers/logController.ts:40:20
 export const reportSecurityAlert = async (req: Request, res: Response) => {
     try {
         const { email, details } = req.body;
-        const ip = req.headers['x-forwarded-for'] || req.socket.remoteAddress;
+        const ip = false;
 
         // Create a SECURITY log

[NoCoverage] StringLiteral
controllers/logController.ts:44:23
 
         // Create a SECURITY log
         await logService.createLog({
-            username: 'SYSTEM_ALERT',
+            username: "",
             action: 'LOGIN_FAIL',
             details: `Failed login attempt for: ${email}. IP: ${ip}. ${details || ''}`,

[NoCoverage] LogicalOperator
controllers/logController.ts:46:72
         await logService.createLog({
             username: 'SYSTEM_ALERT',
             action: 'LOGIN_FAIL',
-            details: `Failed login attempt for: ${email}. IP: ${ip}. ${details || ''}`,
+            details: `Failed login attempt for: ${email}. IP: ${ip}. ${details && ''}`,
             source: 'security'
         });

[NoCoverage] ConditionalExpression
controllers/logController.ts:46:72
         await logService.createLog({
             username: 'SYSTEM_ALERT',
             action: 'LOGIN_FAIL',
-            details: `Failed login attempt for: ${email}. IP: ${ip}. ${details || ''}`,
+            details: `Failed login attempt for: ${email}. IP: ${ip}. ${false}`,
             source: 'security'
         });

[NoCoverage] BooleanLiteral
controllers/logController.ts:51:41
         });
 
         // Always return success to not leak info to attacker
-        res.status(200).json({ success: true });
+        res.status(200).json({ success: false });
     } catch (error) {
         console.error("Security Report Error:", error);

[NoCoverage] BlockStatement
controllers/logController.ts:52:21
 
         // Always return success to not leak info to attacker
         res.status(200).json({ success: true });
-    } catch (error) {
-        console.error("Security Report Error:", error);
-        res.status(200).json({ success: true }); // Silent fail
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/logController.ts:54:41
         res.status(200).json({ success: true });
     } catch (error) {
         console.error("Security Report Error:", error);
-        res.status(200).json({ success: true }); // Silent fail
+        res.status(200).json({ success: false }); // Silent fail
     }
 };
