[Timeout] ConditionalExpression
controllers/newsController.ts:10:26
 import { ensureString } from '../utils/typeUtils.js';
 
 // Canal de anuncios de Discord
-const NEWS_WEBHOOK_URL = process.env.DISCORD_NEWS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
+const NEWS_WEBHOOK_URL = true;
 
 interface NewsWebhookProps {

[Timeout] LogicalOperator
controllers/newsController.ts:10:26
 import { ensureString } from '../utils/typeUtils.js';
 
 // Canal de anuncios de Discord
-const NEWS_WEBHOOK_URL = process.env.DISCORD_NEWS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
+const NEWS_WEBHOOK_URL = process.env.DISCORD_NEWS_WEBHOOK_URL && process.env.DISCORD_WEBHOOK_URL;
 
 interface NewsWebhookProps {

[NoCoverage] ConditionalExpression
controllers/newsController.ts:21:9
 }
 
 const sendNewsWebhook = async (news: NewsWebhookProps) => {
-    if (!NEWS_WEBHOOK_URL) {
+    if (false) {
         console.warn('DISCORD_NEWS_WEBHOOK_URL (or fallback) not configured, skipping announcement.');
         return;

[NoCoverage] BlockStatement
controllers/newsController.ts:21:28
 }
 
 const sendNewsWebhook = async (news: NewsWebhookProps) => {
-    if (!NEWS_WEBHOOK_URL) {
-        console.warn('DISCORD_NEWS_WEBHOOK_URL (or fallback) not configured, skipping announcement.');
-        return;
-    }
+    if (!NEWS_WEBHOOK_URL) {}
 
     try {

[NoCoverage] EqualityOperator
controllers/newsController.ts:31:27
         
         // Truncate content for description if too long
         // Max description length is 4096, but we keep it shorter for readability
-        let description = news.content.length > 200 
+        let description = news.content.length <= 200 
             ? news.content.substring(0, 197) + '...' 
             : news.content;

[NoCoverage] ConditionalExpression
controllers/newsController.ts:31:27
         
         // Truncate content for description if too long
         // Max description length is 4096, but we keep it shorter for readability
-        let description = news.content.length > 200 
+        let description = true 
             ? news.content.substring(0, 197) + '...' 
             : news.content;

[NoCoverage] MethodExpression
controllers/newsController.ts:32:15
         // Truncate content for description if too long
         // Max description length is 4096, but we keep it shorter for readability
         let description = news.content.length > 200 
-            ? news.content.substring(0, 197) + '...' 
+            ? news.content + '...' 
             : news.content;
 

[NoCoverage] StringLiteral
controllers/newsController.ts:32:48
         // Truncate content for description if too long
         // Max description length is 4096, but we keep it shorter for readability
         let description = news.content.length > 200 
-            ? news.content.substring(0, 197) + '...' 
+            ? news.content.substring(0, 197) + "" 
             : news.content;
 

[NoCoverage] StringLiteral
controllers/newsController.ts:41:21
 
         const embed = new EmbedBuilder()
             .setTitle(`📢 ${news.title}`)
-            .setURL(`https://crystaltidessmp.net/news/${news.slug}`) 
+            .setURL(``) 
             .setColor(0x00aabb) // Aqua/Cyan color for CrystalTides
             .setDescription(description)

[NoCoverage] BooleanLiteral
controllers/newsController.ts:44:75
             .setURL(`https://crystaltidessmp.net/news/${news.slug}`) 
             .setColor(0x00aabb) // Aqua/Cyan color for CrystalTides
             .setDescription(description)
-            .addFields({ name: 'Categoría', value: news.category, inline: true })
+            .addFields({ name: 'Categoría', value: news.category, inline: false })
             .setTimestamp()
             .setFooter({ text: 'CrystalTides News' });

[NoCoverage] StringLiteral
controllers/newsController.ts:44:32
             .setURL(`https://crystaltidessmp.net/news/${news.slug}`) 
             .setColor(0x00aabb) // Aqua/Cyan color for CrystalTides
             .setDescription(description)
-            .addFields({ name: 'Categoría', value: news.category, inline: true })
+            .addFields({ name: "", value: news.category, inline: true })
             .setTimestamp()
             .setFooter({ text: 'CrystalTides News' });

[NoCoverage] StringLiteral
controllers/newsController.ts:46:32
             .setDescription(description)
             .addFields({ name: 'Categoría', value: news.category, inline: true })
             .setTimestamp()
-            .setFooter({ text: 'CrystalTides News' });
+            .setFooter({ text: "" });
 
         // Ensure image URL is absolute

[NoCoverage] ObjectLiteral
controllers/newsController.ts:46:24
             .setDescription(description)
             .addFields({ name: 'Categoría', value: news.category, inline: true })
             .setTimestamp()
-            .setFooter({ text: 'CrystalTides News' });
+            .setFooter({});
 
         // Ensure image URL is absolute

[NoCoverage] BlockStatement
controllers/newsController.ts:49:25
             .setFooter({ text: 'CrystalTides News' });
 
         // Ensure image URL is absolute
-        if (news.image) {
-            let imageUrl = news.image;
-            if (!imageUrl.startsWith('http')) {
-                // Assuming images are hosted on the main domain
-                imageUrl = `https://crystaltidessmp.net${imageUrl.startsWith('/') ? '' : '/'}${imageUrl}`;
-            }
-            embed.setImage(imageUrl);
-        }
+        if (news.image) {}
 
         await webhookClient.send({

[NoCoverage] ConditionalExpression
controllers/newsController.ts:49:13
             .setFooter({ text: 'CrystalTides News' });
 
         // Ensure image URL is absolute
-        if (news.image) {
+        if (false) {
             let imageUrl = news.image;
             if (!imageUrl.startsWith('http')) {

[NoCoverage] BooleanLiteral
controllers/newsController.ts:51:17
         // Ensure image URL is absolute
         if (news.image) {
             let imageUrl = news.image;
-            if (!imageUrl.startsWith('http')) {
+            if (imageUrl.startsWith('http')) {
                 // Assuming images are hosted on the main domain
                 imageUrl = `https://crystaltidessmp.net${imageUrl.startsWith('/') ? '' : '/'}${imageUrl}`;

[NoCoverage] ConditionalExpression
controllers/newsController.ts:51:17
         // Ensure image URL is absolute
         if (news.image) {
             let imageUrl = news.image;
-            if (!imageUrl.startsWith('http')) {
+            if (true) {
                 // Assuming images are hosted on the main domain
                 imageUrl = `https://crystaltidessmp.net${imageUrl.startsWith('/') ? '' : '/'}${imageUrl}`;

[NoCoverage] MethodExpression
controllers/newsController.ts:53:58
             let imageUrl = news.image;
             if (!imageUrl.startsWith('http')) {
                 // Assuming images are hosted on the main domain
-                imageUrl = `https://crystaltidessmp.net${imageUrl.startsWith('/') ? '' : '/'}${imageUrl}`;
+                imageUrl = `https://crystaltidessmp.net${imageUrl.endsWith('/') ? '' : '/'}${imageUrl}`;
             }
             embed.setImage(imageUrl);

[NoCoverage] StringLiteral
controllers/newsController.ts:53:28
             let imageUrl = news.image;
             if (!imageUrl.startsWith('http')) {
                 // Assuming images are hosted on the main domain
-                imageUrl = `https://crystaltidessmp.net${imageUrl.startsWith('/') ? '' : '/'}${imageUrl}`;
+                imageUrl = ``;
             }
             embed.setImage(imageUrl);

[NoCoverage] ObjectLiteral
controllers/newsController.ts:58:34
             embed.setImage(imageUrl);
         }
 
-        await webhookClient.send({
-            // Content left empty or with a non-ping text if they strictly want it inside embed. 
-            // However, usually users want the ping. Mentions in embeds DO NOT ping.
-            // But the user asked "por favor dentro del embed". 
-            // To ensure functionality (ping) + request (inside embed), we often do both or just content.
-            // Given the strict phrasing "dentro del embed", I will put it there. 
-            // Any "content" ping is removed to follow the "visual" instruction, 
-            // BUT this means it won't trigger a push notification for the role.
-            // I'll add a subtle ping in content just in case, but rely on the embed for the "tag".
-            // actually, let's keep the content clean if requested "inside".
-            content: `Nuevo anuncio publicado!`, 
-            embeds: [embed],
-        });
+        await webhookClient.send({});
     } catch (error) {
         console.error('Error sending news webhook:', error);

[NoCoverage] StringLiteral
controllers/newsController.ts:68:22
             // BUT this means it won't trigger a push notification for the role.
             // I'll add a subtle ping in content just in case, but rely on the embed for the "tag".
             // actually, let's keep the content clean if requested "inside".
-            content: `Nuevo anuncio publicado!`, 
+            content: ``, 
             embeds: [embed],
         });

[NoCoverage] BlockStatement
controllers/newsController.ts:71:21
             content: `Nuevo anuncio publicado!`, 
             embeds: [embed],
         });
-    } catch (error) {
-        console.error('Error sending news webhook:', error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/newsController.ts:77:35
 };
 
 // Helper function for slug generation
-const slugify = (text: string) => {
-    return text
-        .toString()
-        .toLowerCase()
-        .normalize('NFD') // Normalize special chars (e.g. á -> a)
-        .replace(/[\u0300-\u036f]/g, '') // Remove diacritics
-        .replace(/[^a-z0-9\s-]/g, '') // Remove invalid chars
-        .trim()
-        .replace(/\s+/g, '-') // Replace spaces with -
-        .replace(/-+/g, '-'); // Replace multiple - with single -
-};
+const slugify = (text: string) => {};
 
 export const getAllNews = async (req: Request, res: Response) => {

[NoCoverage] MethodExpression
controllers/newsController.ts:78:12
 
 // Helper function for slug generation
 const slugify = (text: string) => {
-    return text
-        .toString()
-        .toLowerCase()
+    return text.toString().toUpperCase()
         .normalize('NFD') // Normalize special chars (e.g. á -> a)
         .replace(/[\u0300-\u036f]/g, '') // Remove diacritics

[NoCoverage] MethodExpression
controllers/newsController.ts:78:12
 
 // Helper function for slug generation
 const slugify = (text: string) => {
-    return text
-        .toString()
-        .toLowerCase()
-        .normalize('NFD') // Normalize special chars (e.g. á -> a)
-        .replace(/[\u0300-\u036f]/g, '') // Remove diacritics
-        .replace(/[^a-z0-9\s-]/g, '') // Remove invalid chars
-        .trim()
+    return text.toString().toLowerCase().normalize('NFD') // Normalize special chars (e.g. á -> a)
+.replace(/[\u0300-\u036f]/g, '') // Remove diacritics
+.replace(/[^a-z0-9\s-]/g, '') // Remove invalid chars
         .replace(/\s+/g, '-') // Replace spaces with -
         .replace(/-+/g, '-'); // Replace multiple - with single -

[NoCoverage] StringLiteral
controllers/newsController.ts:83:35
         .toLowerCase()
         .normalize('NFD') // Normalize special chars (e.g. á -> a)
         .replace(/[\u0300-\u036f]/g, '') // Remove diacritics
-        .replace(/[^a-z0-9\s-]/g, '') // Remove invalid chars
+        .replace(/[^a-z0-9\s-]/g, "Stryker was here!") // Remove invalid chars
         .trim()
         .replace(/\s+/g, '-') // Replace spaces with -

[Killed] BlockStatement
controllers/newsController.ts:90:9
 };
 
 export const getAllNews = async (req: Request, res: Response) => {
-    try {
-        const { data, error } = await supabase
-            .from('news')
-            .select('*, comments(count)')
-            .order('created_at', { ascending: false });
-
-        if (error) throw error;
-
-        // Type the mapped item explicitly to avoid 'any'
-        interface NewsItem {
-            comments?: { count: number }[];
-            [key: string]: unknown;
-        }
-
-        const newsWithCounts = data.map((n: NewsItem) => ({
-            ...n,
-            replies: n.comments && n.comments[0] ? n.comments[0].count : 0,
-            comments: undefined
-        }));
-
-        res.status(200).json(newsWithCounts);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });
killedBy: A05 — Security Misconfiguration Rate limiting should expose rate limit headers on /api routes
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Timeout] StringLiteral
controllers/newsController.ts:92:19
 export const getAllNews = async (req: Request, res: Response) => {
     try {
         const { data, error } = await supabase
-            .from('news')
+            .from("")
             .select('*, comments(count)')
             .order('created_at', { ascending: false });

[Timeout] BooleanLiteral
controllers/newsController.ts:94:47
         const { data, error } = await supabase
             .from('news')
             .select('*, comments(count)')
-            .order('created_at', { ascending: false });
+            .order('created_at', { ascending: true });
 
         if (error) throw error;

[Timeout] ObjectLiteral
controllers/newsController.ts:94:34
         const { data, error } = await supabase
             .from('news')
             .select('*, comments(count)')
-            .order('created_at', { ascending: false });
+            .order('created_at', {});
 
         if (error) throw error;

[Timeout] ArrowFunction
controllers/newsController.ts:104:41
             [key: string]: unknown;
         }
 
-        const newsWithCounts = data.map((n: NewsItem) => ({
-            ...n,
-            replies: n.comments && n.comments[0] ? n.comments[0].count : 0,
-            comments: undefined
-        }));
+        const newsWithCounts = data.map(() => undefined);
 
         res.status(200).json(newsWithCounts);

[NoCoverage] ObjectLiteral
controllers/newsController.ts:104:59
             [key: string]: unknown;
         }
 
-        const newsWithCounts = data.map((n: NewsItem) => ({
-            ...n,
-            replies: n.comments && n.comments[0] ? n.comments[0].count : 0,
-            comments: undefined
-        }));
+        const newsWithCounts = data.map((n: NewsItem) => ({}));
 
         res.status(200).json(newsWithCounts);

[NoCoverage] ConditionalExpression
controllers/newsController.ts:106:22
 
         const newsWithCounts = data.map((n: NewsItem) => ({
             ...n,
-            replies: n.comments && n.comments[0] ? n.comments[0].count : 0,
+            replies: false ? n.comments[0].count : 0,
             comments: undefined
         }));

[NoCoverage] ConditionalExpression
controllers/newsController.ts:106:22
 
         const newsWithCounts = data.map((n: NewsItem) => ({
             ...n,
-            replies: n.comments && n.comments[0] ? n.comments[0].count : 0,
+            replies: true ? n.comments[0].count : 0,
             comments: undefined
         }));

[NoCoverage] BlockStatement
controllers/newsController.ts:111:21
         }));
 
         res.status(200).json(newsWithCounts);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] Regex
controllers/newsController.ts:120:27
 export const getNewsById = async (req: Request, res: Response) => {
     try {
         const id = ensureString(req.params.id);
-        const isNumeric = /^\d+$/.test(id);
+        const isNumeric = /\d+$/.test(id);
 
         let query = supabase.from('news').select('*');

[NoCoverage] Regex
controllers/newsController.ts:120:27
 export const getNewsById = async (req: Request, res: Response) => {
     try {
         const id = ensureString(req.params.id);
-        const isNumeric = /^\d+$/.test(id);
+        const isNumeric = /^\d$/.test(id);
 
         let query = supabase.from('news').select('*');

[NoCoverage] ConditionalExpression
controllers/newsController.ts:124:13
 
         let query = supabase.from('news').select('*');
         
-        if (isNumeric) {
+        if (false) {
             query = query.eq('id', id);
         } else {

[NoCoverage] ConditionalExpression
controllers/newsController.ts:124:13
 
         let query = supabase.from('news').select('*');
         
-        if (isNumeric) {
+        if (true) {
             query = query.eq('id', id);
         } else {

[NoCoverage] BlockStatement
controllers/newsController.ts:126:16
         
         if (isNumeric) {
             query = query.eq('id', id);
-        } else {
-            query = query.eq('slug', id);
-        }
+        } else {}
 
         const { data: newsItem, error: fetchError } = await query.single();

[NoCoverage] StringLiteral
controllers/newsController.ts:127:30
         if (isNumeric) {
             query = query.eq('id', id);
         } else {
-            query = query.eq('slug', id);
+            query = query.eq("", id);
         }
 

[NoCoverage] ConditionalExpression
controllers/newsController.ts:133:13
         const { data: newsItem, error: fetchError } = await query.single();
 
         if (fetchError) throw fetchError;
-        if (!newsItem) return res.status(404).json({ error: "Noticia no encontrada" });
+        if (false) return res.status(404).json({ error: "Noticia no encontrada" });
 
         // 2. Incrementar visitas (si existe la columna views)

[NoCoverage] ConditionalExpression
controllers/newsController.ts:133:13
         const { data: newsItem, error: fetchError } = await query.single();
 
         if (fetchError) throw fetchError;
-        if (!newsItem) return res.status(404).json({ error: "Noticia no encontrada" });
+        if (true) return res.status(404).json({ error: "Noticia no encontrada" });
 
         // 2. Incrementar visitas (si existe la columna views)

[NoCoverage] LogicalOperator
controllers/newsController.ts:136:27
         if (!newsItem) return res.status(404).json({ error: "Noticia no encontrada" });
 
         // 2. Incrementar visitas (si existe la columna views)
-        const newViews = (newsItem.views || 0) + 1;
+        const newViews = (newsItem.views && 0) + 1;
 
         await supabase

[NoCoverage] ConditionalExpression
controllers/newsController.ts:136:27
         if (!newsItem) return res.status(404).json({ error: "Noticia no encontrada" });
 
         // 2. Incrementar visitas (si existe la columna views)
-        const newViews = (newsItem.views || 0) + 1;
+        const newViews = (true) + 1;
 
         await supabase

[NoCoverage] StringLiteral
controllers/newsController.ts:145:19
 
         // Fetch Author Fresh Data (Sync with Forum logic)
         const { data: profile } = await supabase
-            .from('profiles')
+            .from("")
             .select('username, full_name, avatar_url, role, status_message, avatar_preference, community_pref, minecraft_uuid, minecraft_nick, social_discord, social_avatar_url')
             .eq('id', newsItem.author_id)

[NoCoverage] StringLiteral
controllers/newsController.ts:146:21
         // Fetch Author Fresh Data (Sync with Forum logic)
         const { data: profile } = await supabase
             .from('profiles')
-            .select('username, full_name, avatar_url, role, status_message, avatar_preference, community_pref, minecraft_uuid, minecraft_nick, social_discord, social_avatar_url')
+            .select("")
             .eq('id', newsItem.author_id)
             .maybeSingle();

[NoCoverage] StringLiteral
controllers/newsController.ts:147:17
         const { data: profile } = await supabase
             .from('profiles')
             .select('username, full_name, avatar_url, role, status_message, avatar_preference, community_pref, minecraft_uuid, minecraft_nick, social_discord, social_avatar_url')
-            .eq('id', newsItem.author_id)
+            .eq("", newsItem.author_id)
             .maybeSingle();
 

[NoCoverage] BlockStatement
controllers/newsController.ts:152:21
 
         // Retornamos el item con las vistas actualizadas (optimista)
         res.status(200).json({ ...newsItem, views: newViews, author_data_fresh: profile });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/newsController.ts:164:13
         let newsId = id;
 
         // Si el ID no es numérico, asumimos que es un slug y buscamos el ID real
-        if (!/^\d+$/.test(id)) {
+        if (/^\d+$/.test(id)) {
             const { data: news, error: newsError } = await supabase
                 .from('news')

[NoCoverage] ConditionalExpression
controllers/newsController.ts:164:13
         let newsId = id;
 
         // Si el ID no es numérico, asumimos que es un slug y buscamos el ID real
-        if (!/^\d+$/.test(id)) {
+        if (false) {
             const { data: news, error: newsError } = await supabase
                 .from('news')

[NoCoverage] StringLiteral
controllers/newsController.ts:166:23
         // Si el ID no es numérico, asumimos que es un slug y buscamos el ID real
         if (!/^\d+$/.test(id)) {
             const { data: news, error: newsError } = await supabase
-                .from('news')
+                .from("")
                 .select('id')
                 .eq('slug', id)

[NoCoverage] LogicalOperator
controllers/newsController.ts:171:17
                 .eq('slug', id)
                 .single();
             
-            if (newsError || !news) {
+            if (newsError && !news) {
                 return res.status(404).json({ error: "Noticia no encontrada" });
             }

[NoCoverage] ConditionalExpression
controllers/newsController.ts:171:17
                 .eq('slug', id)
                 .single();
             
-            if (newsError || !news) {
+            if (false) {
                 return res.status(404).json({ error: "Noticia no encontrada" });
             }

[NoCoverage] StringLiteral
controllers/newsController.ts:172:54
                 .single();
             
             if (newsError || !news) {
-                return res.status(404).json({ error: "Noticia no encontrada" });
+                return res.status(404).json({ error: "" });
             }
             newsId = news.id;

[NoCoverage] BooleanLiteral
controllers/newsController.ts:181:47
             .from('comments')
             .select('*, profiles!comments_user_id_fkey(*)')
             .eq('news_id', newsId)
-            .order('created_at', { ascending: true });
+            .order('created_at', { ascending: false });
 
         if (error) throw error;

[NoCoverage] ArrowFunction
controllers/newsController.ts:191:62
             [key: string]: unknown;
         }
 
-        const mappedComments = (data as JoinedComment[]).map(c => ({
-             ...c,
-             author_data_fresh: Array.isArray(c.profiles) ? c.profiles[0] : (c.profiles || null),
-             profiles: undefined
-        }));
+        const mappedComments = (data as JoinedComment[]).map(() => undefined);
 
         res.status(200).json(mappedComments);

[NoCoverage] LogicalOperator
controllers/newsController.ts:193:78
 
         const mappedComments = (data as JoinedComment[]).map(c => ({
              ...c,
-             author_data_fresh: Array.isArray(c.profiles) ? c.profiles[0] : (c.profiles || null),
+             author_data_fresh: Array.isArray(c.profiles) ? c.profiles[0] : (c.profiles && null),
              profiles: undefined
         }));

[NoCoverage] ConditionalExpression
controllers/newsController.ts:193:78
 
         const mappedComments = (data as JoinedComment[]).map(c => ({
              ...c,
-             author_data_fresh: Array.isArray(c.profiles) ? c.profiles[0] : (c.profiles || null),
+             author_data_fresh: Array.isArray(c.profiles) ? c.profiles[0] : (true),
              profiles: undefined
         }));

[NoCoverage] BlockStatement
controllers/newsController.ts:198:21
         }));
 
         res.status(200).json(mappedComments);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ConditionalExpression
controllers/newsController.ts:218:13
         let newsId = id;
 
         // Resolver slug a ID si es necesario
-        if (!/^\d+$/.test(id)) {
+        if (false) {
             const { data: news, error: newsError } = await supabase
                 .from('news')

[NoCoverage] BlockStatement
controllers/newsController.ts:218:32
         let newsId = id;
 
         // Resolver slug a ID si es necesario
-        if (!/^\d+$/.test(id)) {
-            const { data: news, error: newsError } = await supabase
-                .from('news')
-                .select('id')
-                .eq('slug', id)
-                .single();
-            
-            if (newsError || !news) {
-                console.error(`Error resolving slug '${id}' to ID:`, newsError);
-                return res.status(404).json({ error: "Noticia no encontrada" });
-            }
-            newsId = news.id;
-        }
+        if (!/^\d+$/.test(id)) {}
 
         // Fetch latest user metadata to get correct avatar and role

[NoCoverage] StringLiteral
controllers/newsController.ts:222:21
             const { data: news, error: newsError } = await supabase
                 .from('news')
                 .select('id')
-                .eq('slug', id)
+                .eq("", id)
                 .single();
             

[NoCoverage] ConditionalExpression
controllers/newsController.ts:225:17
                 .eq('slug', id)
                 .single();
             
-            if (newsError || !news) {
+            if (true) {
                 console.error(`Error resolving slug '${id}' to ID:`, newsError);
                 return res.status(404).json({ error: "Noticia no encontrada" });

[NoCoverage] StringLiteral
controllers/newsController.ts:227:54
             
             if (newsError || !news) {
                 console.error(`Error resolving slug '${id}' to ID:`, newsError);
-                return res.status(404).json({ error: "Noticia no encontrada" });
+                return res.status(404).json({ error: "" });
             }
             newsId = news.id;

[NoCoverage] StringLiteral
controllers/newsController.ts:236:21
         // Ideally this should come from a 'profiles' table join, but for now we query auth/profiles
         const { data: profile } = await supabase
             .from('profiles')
-            .select('username, role, avatar_url')
+            .select("")
             .eq('id', user.id)
             .single();

[NoCoverage] OptionalChaining
controllers/newsController.ts:245:52
         
         // Hybrid Priority Resolution based on User Feedback
         // 1. Username: Profile (UltraXn) > Metadata (Discord Name)
-        const finalUsername = profile?.username || authUser?.user_metadata?.username || user.username;
+        const finalUsername = profile?.username || authUser.user_metadata?.username || user.username;
         
         // 2. Role: Metadata (Source of Truth for Permissions) > Profile

[NoCoverage] OptionalChaining
controllers/newsController.ts:245:52
         
         // Hybrid Priority Resolution based on User Feedback
         // 1. Username: Profile (UltraXn) > Metadata (Discord Name)
-        const finalUsername = profile?.username || authUser?.user_metadata?.username || user.username;
+        const finalUsername = profile?.username || authUser?.user_metadata.username || user.username;
         
         // 2. Role: Metadata (Source of Truth for Permissions) > Profile

[NoCoverage] ConditionalExpression
controllers/newsController.ts:248:27
         const finalUsername = profile?.username || authUser?.user_metadata?.username || user.username;
         
         // 2. Role: Metadata (Source of Truth for Permissions) > Profile
-        const finalRole = authUser?.user_metadata?.role || profile?.role || 'user';
+        const finalRole = false;
         
         // 3. Avatar: Metadata (Social PFP) > Profile (Minecraft Skin)

[NoCoverage] ConditionalExpression
controllers/newsController.ts:248:27
         const finalUsername = profile?.username || authUser?.user_metadata?.username || user.username;
         
         // 2. Role: Metadata (Source of Truth for Permissions) > Profile
-        const finalRole = authUser?.user_metadata?.role || profile?.role || 'user';
+        const finalRole = false || 'user';
         
         // 3. Avatar: Metadata (Social PFP) > Profile (Minecraft Skin)

[NoCoverage] ConditionalExpression
controllers/newsController.ts:251:29
         const finalRole = authUser?.user_metadata?.role || profile?.role || 'user';
         
         // 3. Avatar: Metadata (Social PFP) > Profile (Minecraft Skin)
-        const finalAvatar = authUser?.user_metadata?.avatar_url || profile?.avatar_url || null;
+        const finalAvatar = false;
 
         const { data, error } = await supabase
