[NoCoverage] ConditionalExpression
controllers/newsController.ts:251:29
         const finalRole = authUser?.user_metadata?.role || profile?.role || 'user';
         
         // 3. Avatar: Metadata (Social PFP) > Profile (Minecraft Skin)
-        const finalAvatar = authUser?.user_metadata?.avatar_url || profile?.avatar_url || null;
+        const finalAvatar = false || null;
 
         const { data, error } = await supabase

[NoCoverage] ArrayDeclaration
controllers/newsController.ts:255:21
 
         const { data, error } = await supabase
             .from('comments')
-            .insert([{
-                news_id: newsId,
-                user_id: user.id,
-                user_name: finalUsername,
-                user_avatar: finalAvatar,
-                content,
-                user_role: finalRole
-            }])
+            .insert([])
             .select();
 

[NoCoverage] BlockStatement
controllers/newsController.ts:267:21
 
         if (error) throw error;
         res.status(201).json(data[0]);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
controllers/newsController.ts:269:30
         res.status(201).json(data[0]);
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
+        res.status(500).json({});
     }
 };

[NoCoverage] ConditionalExpression
controllers/newsController.ts:279:13
         const { content } = req.body;
         const user = req.user;
 
-        if (!user) return res.status(401).json({ error: "Usuario no autenticado" });
+        if (true) return res.status(401).json({ error: "Usuario no autenticado" });
 
         // 1. Verify existence and ownership

[NoCoverage] ConditionalExpression
controllers/newsController.ts:279:13
         const { content } = req.body;
         const user = req.user;
 
-        if (!user) return res.status(401).json({ error: "Usuario no autenticado" });
+        if (false) return res.status(401).json({ error: "Usuario no autenticado" });
 
         // 1. Verify existence and ownership

[NoCoverage] BooleanLiteral
controllers/newsController.ts:288:27
             .eq('id', id)
             .single();
 
-        if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
+        if (fetchError || comment) return res.status(404).json({ error: "Comentario no encontrado" });
 
         if (comment.user_id !== user.id) {

[NoCoverage] ConditionalExpression
controllers/newsController.ts:288:13
             .eq('id', id)
             .single();
 
-        if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
+        if (false) return res.status(404).json({ error: "Comentario no encontrado" });
 
         if (comment.user_id !== user.id) {

[NoCoverage] EqualityOperator
controllers/newsController.ts:290:13
 
         if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
 
-        if (comment.user_id !== user.id) {
+        if (comment.user_id === user.id) {
              return res.status(403).json({ error: "No tienes permiso para editar este comentario" });
         }

[NoCoverage] ConditionalExpression
controllers/newsController.ts:290:13
 
         if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
 
-        if (comment.user_id !== user.id) {
+        if (true) {
              return res.status(403).json({ error: "No tienes permiso para editar este comentario" });
         }

[NoCoverage] ObjectLiteral
controllers/newsController.ts:291:42
         if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
 
         if (comment.user_id !== user.id) {
-             return res.status(403).json({ error: "No tienes permiso para editar este comentario" });
+             return res.status(403).json({});
         }
 

[NoCoverage] StringLiteral
controllers/newsController.ts:301:41
             .eq('id', id);
 
         if (error) throw error;
-        res.status(200).json({ message: "Comentario actualizado" });
+        res.status(200).json({ message: "" });
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/newsController.ts:302:21
 
         if (error) throw error;
         res.status(200).json({ message: "Comentario actualizado" });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] OptionalChaining
controllers/newsController.ts:312:107
     try {
         const id = ensureString(req.params.id); // comment id
         const user = req.user;
-        console.log(`[deleteComment] Attempting to delete comment ID: ${id} by User: ${user?.username} (${user?.id})`);
+        console.log(`[deleteComment] Attempting to delete comment ID: ${id} by User: ${user?.username} (${user.id})`);
 
         if (!user) return res.status(401).json({ error: "Usuario no autenticado" });

[NoCoverage] OptionalChaining
controllers/newsController.ts:312:88
     try {
         const id = ensureString(req.params.id); // comment id
         const user = req.user;
-        console.log(`[deleteComment] Attempting to delete comment ID: ${id} by User: ${user?.username} (${user?.id})`);
+        console.log(`[deleteComment] Attempting to delete comment ID: ${id} by User: ${user.username} (${user?.id})`);
 
         if (!user) return res.status(401).json({ error: "Usuario no autenticado" });

[NoCoverage] BooleanLiteral
controllers/newsController.ts:314:13
         const user = req.user;
         console.log(`[deleteComment] Attempting to delete comment ID: ${id} by User: ${user?.username} (${user?.id})`);
 
-        if (!user) return res.status(401).json({ error: "Usuario no autenticado" });
+        if (user) return res.status(401).json({ error: "Usuario no autenticado" });
 
         // 1. Verify existence

[NoCoverage] ConditionalExpression
controllers/newsController.ts:323:13
             .eq('id', id)
             .single();
 
-        if (fetchError) console.error(`[deleteComment] DB Error fetching comment:`, fetchError);
+        if (false) console.error(`[deleteComment] DB Error fetching comment:`, fetchError);
         if (!comment) console.error(`[deleteComment] Comment not found in DB`);
 

[NoCoverage] ConditionalExpression
controllers/newsController.ts:323:13
             .eq('id', id)
             .single();
 
-        if (fetchError) console.error(`[deleteComment] DB Error fetching comment:`, fetchError);
+        if (true) console.error(`[deleteComment] DB Error fetching comment:`, fetchError);
         if (!comment) console.error(`[deleteComment] Comment not found in DB`);
 

[NoCoverage] ConditionalExpression
controllers/newsController.ts:324:13
             .single();
 
         if (fetchError) console.error(`[deleteComment] DB Error fetching comment:`, fetchError);
-        if (!comment) console.error(`[deleteComment] Comment not found in DB`);
+        if (true) console.error(`[deleteComment] Comment not found in DB`);
 
         if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });

[NoCoverage] BooleanLiteral
controllers/newsController.ts:324:13
             .single();
 
         if (fetchError) console.error(`[deleteComment] DB Error fetching comment:`, fetchError);
-        if (!comment) console.error(`[deleteComment] Comment not found in DB`);
+        if (comment) console.error(`[deleteComment] Comment not found in DB`);
 
         if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });

[NoCoverage] ConditionalExpression
controllers/newsController.ts:326:13
         if (fetchError) console.error(`[deleteComment] DB Error fetching comment:`, fetchError);
         if (!comment) console.error(`[deleteComment] Comment not found in DB`);
 
-        if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
+        if (true) return res.status(404).json({ error: "Comentario no encontrado" });
 
         // 2. Check Permissions (Owner OR Admin)

[NoCoverage] MethodExpression
controllers/newsController.ts:329:120
         if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
 
         // 2. Check Permissions (Owner OR Admin)
-        const isStaff = ['admin', 'neroferno', 'killu', 'killuwu', 'developer', 'moderator', 'mod', 'helper'].includes(user.role.toLowerCase());
+        const isStaff = ['admin', 'neroferno', 'killu', 'killuwu', 'developer', 'moderator', 'mod', 'helper'].includes(user.role.toUpperCase());
         
         if (comment.user_id !== user.id && !isStaff) {

[NoCoverage] StringLiteral
controllers/newsController.ts:329:68
         if (fetchError || !comment) return res.status(404).json({ error: "Comentario no encontrado" });
 
         // 2. Check Permissions (Owner OR Admin)
-        const isStaff = ['admin', 'neroferno', 'killu', 'killuwu', 'developer', 'moderator', 'mod', 'helper'].includes(user.role.toLowerCase());
+        const isStaff = ['admin', 'neroferno', 'killu', 'killuwu', "", 'moderator', 'mod', 'helper'].includes(user.role.toLowerCase());
         
         if (comment.user_id !== user.id && !isStaff) {

[NoCoverage] BooleanLiteral
controllers/newsController.ts:331:44
         // 2. Check Permissions (Owner OR Admin)
         const isStaff = ['admin', 'neroferno', 'killu', 'killuwu', 'developer', 'moderator', 'mod', 'helper'].includes(user.role.toLowerCase());
         
-        if (comment.user_id !== user.id && !isStaff) {
+        if (comment.user_id !== user.id && isStaff) {
             return res.status(403).json({ error: "No tienes permiso para eliminar este comentario" });
         }

[NoCoverage] BlockStatement
controllers/newsController.ts:331:54
         // 2. Check Permissions (Owner OR Admin)
         const isStaff = ['admin', 'neroferno', 'killu', 'killuwu', 'developer', 'moderator', 'mod', 'helper'].includes(user.role.toLowerCase());
         
-        if (comment.user_id !== user.id && !isStaff) {
-            return res.status(403).json({ error: "No tienes permiso para eliminar este comentario" });
-        }
+        if (comment.user_id !== user.id && !isStaff) {}
 
         // 3. Delete

[NoCoverage] StringLiteral
controllers/newsController.ts:332:50
         const isStaff = ['admin', 'neroferno', 'killu', 'killuwu', 'developer', 'moderator', 'mod', 'helper'].includes(user.role.toLowerCase());
         
         if (comment.user_id !== user.id && !isStaff) {
-            return res.status(403).json({ error: "No tienes permiso para eliminar este comentario" });
+            return res.status(403).json({ error: "" });
         }
 

[NoCoverage] StringLiteral
controllers/newsController.ts:337:19
 
         // 3. Delete
         const { error } = await supabase
-            .from('comments')
+            .from("")
             .delete()
             .eq('id', id);

[NoCoverage] StringLiteral
controllers/newsController.ts:339:17
         const { error } = await supabase
             .from('comments')
             .delete()
-            .eq('id', id);
+            .eq("", id);
 
         if (error) throw error;

[NoCoverage] StringLiteral
controllers/newsController.ts:342:41
             .eq('id', id);
 
         if (error) throw error;
-        res.status(200).json({ message: "Comentario eliminado" });
+        res.status(200).json({ message: "" });
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/newsController.ts:343:21
 
         if (error) throw error;
         res.status(200).json({ message: "Comentario eliminado" });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] LogicalOperator
controllers/newsController.ts:354:30
         const { title, category, content, image, status, author_id, username, title_en, content_en } = req.body;
 
         // Auto Translation if not provided
-        const finalTitleEn = title_en || await translateText(title, 'en');
+        const finalTitleEn = title_en && (await translateText(title, 'en'));
         const finalContentEn = content_en || await translateText(content, 'en');
         

[NoCoverage] ConditionalExpression
controllers/newsController.ts:354:30
         const { title, category, content, image, status, author_id, username, title_en, content_en } = req.body;
 
         // Auto Translation if not provided
-        const finalTitleEn = title_en || await translateText(title, 'en');
+        const finalTitleEn = false;
         const finalContentEn = content_en || await translateText(content, 'en');
         

[NoCoverage] ConditionalExpression
controllers/newsController.ts:355:32
 
         // Auto Translation if not provided
         const finalTitleEn = title_en || await translateText(title, 'en');
-        const finalContentEn = content_en || await translateText(content, 'en');
+        const finalContentEn = false;
         
         // Generate Slug

[NoCoverage] ConditionalExpression
controllers/newsController.ts:355:32
 
         // Auto Translation if not provided
         const finalTitleEn = title_en || await translateText(title, 'en');
-        const finalContentEn = content_en || await translateText(content, 'en');
+        const finalContentEn = true;
         
         // Generate Slug

[NoCoverage] ObjectLiteral
controllers/newsController.ts:378:30
         if (error) throw error;
 
         // Log action
-        logService.createLog({
-            user_id: author_id,
-            username: username || 'Admin', 
-            action: 'CREATE_NEWS',
-            details: `Created news: ${title}`,
-            source: 'web'
-        }).catch(console.error);
+        logService.createLog({}).catch(console.error);
 
         // Notify Discord

[NoCoverage] LogicalOperator
controllers/newsController.ts:380:23
         // Log action
         logService.createLog({
             user_id: author_id,
-            username: username || 'Admin', 
+            username: username && 'Admin', 
             action: 'CREATE_NEWS',
             details: `Created news: ${title}`,

[NoCoverage] ConditionalExpression
controllers/newsController.ts:380:23
         // Log action
         logService.createLog({
             user_id: author_id,
-            username: username || 'Admin', 
+            username: true, 
             action: 'CREATE_NEWS',
             details: `Created news: ${title}`,

[NoCoverage] StringLiteral
controllers/newsController.ts:383:21
             username: username || 'Admin', 
             action: 'CREATE_NEWS',
             details: `Created news: ${title}`,
-            source: 'web'
+            source: ""
         }).catch(console.error);
 

[NoCoverage] ConditionalExpression
controllers/newsController.ts:387:13
         }).catch(console.error);
 
         // Notify Discord
-        if (status === 'Published') {
+        if (false) {
             sendNewsWebhook({
                 title,

[NoCoverage] ConditionalExpression
controllers/newsController.ts:387:13
         }).catch(console.error);
 
         // Notify Discord
-        if (status === 'Published') {
+        if (true) {
             sendNewsWebhook({
                 title,

[NoCoverage] ConditionalExpression
controllers/newsController.ts:411:13
 
         // If title changed, update slug
         let slug = undefined;
-        if (title) {
+        if (false) {
             slug = slugify(title);
         }

[NoCoverage] ConditionalExpression
controllers/newsController.ts:411:13
 
         // If title changed, update slug
         let slug = undefined;
-        if (title) {
+        if (true) {
             slug = slugify(title);
         }

[NoCoverage] ConditionalExpression
controllers/newsController.ts:427:13
         }
 
         const updates: NewsUpdates = { title, category, content, image, status, title_en, content_en };
-        if (slug) updates.slug = slug;
+        if (false) updates.slug = slug;
 
         const { data, error } = await supabase

[NoCoverage] ConditionalExpression
controllers/newsController.ts:427:13
         }
 
         const updates: NewsUpdates = { title, category, content, image, status, title_en, content_en };
-        if (slug) updates.slug = slug;
+        if (true) updates.slug = slug;
 
         const { data, error } = await supabase

[NoCoverage] ConditionalExpression
controllers/newsController.ts:439:22
 
         // Log action
         logService.createLog({
-            user_id: user_id || null,
+            user_id: true,
             username: username || 'Admin',
             action: 'UPDATE_NEWS',

[NoCoverage] ConditionalExpression
controllers/newsController.ts:439:22
 
         // Log action
         logService.createLog({
-            user_id: user_id || null,
+            user_id: false,
             username: username || 'Admin',
             action: 'UPDATE_NEWS',

[NoCoverage] ConditionalExpression
controllers/newsController.ts:440:23
         // Log action
         logService.createLog({
             user_id: user_id || null,
-            username: username || 'Admin',
+            username: false,
             action: 'UPDATE_NEWS',
             details: `Updated news #${id}: ${title} (${status})`,

[NoCoverage] LogicalOperator
controllers/newsController.ts:440:23
         // Log action
         logService.createLog({
             user_id: user_id || null,
-            username: username || 'Admin',
+            username: username && 'Admin',
             action: 'UPDATE_NEWS',
             details: `Updated news #${id}: ${title} (${status})`,

[NoCoverage] BlockStatement
controllers/newsController.ts:447:21
         }).catch(console.error);
 
         res.status(200).json(data[0]);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/newsController.ts:454:9
 };
 
 export const deleteNews = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const user = req.user;
-
-        if (!user) return res.status(401).json({ error: "Usuario no autenticado" });
-
-        const { error } = await supabase
-            .from('news')
-            .delete()
-            .eq('id', id);
-
-        if (error) throw error;
-
-        // Log action
-        logService.createLog({
-            user_id: user.id,
-            username: user.username || 'Admin',
-            action: 'DELETE_NEWS',
-            details: `Deleted news #${id}`,
-            source: 'web'
-        }).catch(console.error);
-
-        res.status(200).json({ message: 'Noticia eliminada correctamente' });
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });

[NoCoverage] LogicalOperator
controllers/newsController.ts:470:23
         // Log action
         logService.createLog({
             user_id: user.id,
-            username: user.username || 'Admin',
+            username: user.username && 'Admin',
             action: 'DELETE_NEWS',
             details: `Deleted news #${id}`,

[NoCoverage] ConditionalExpression
controllers/newsController.ts:470:23
         // Log action
         logService.createLog({
             user_id: user.id,
-            username: user.username || 'Admin',
+            username: true,
             action: 'DELETE_NEWS',
             details: `Deleted news #${id}`,

[NoCoverage] StringLiteral
controllers/newsController.ts:471:21
         logService.createLog({
             user_id: user.id,
             username: user.username || 'Admin',
-            action: 'DELETE_NEWS',
+            action: "",
             details: `Deleted news #${id}`,
             source: 'web'

[NoCoverage] StringLiteral
controllers/newsController.ts:472:22
             user_id: user.id,
             username: user.username || 'Admin',
             action: 'DELETE_NEWS',
-            details: `Deleted news #${id}`,
+            details: ``,
             source: 'web'
         }).catch(console.error);

[NoCoverage] ObjectLiteral
controllers/newsController.ts:476:30
             source: 'web'
         }).catch(console.error);
 
-        res.status(200).json({ message: 'Noticia eliminada correctamente' });
+        res.status(200).json({});
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/newsController.ts:477:21
         }).catch(console.error);
 
         res.status(200).json({ message: 'Noticia eliminada correctamente' });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error) {}
 };
 
