[NoCoverage] BlockStatement
controllers/playerStatsController.ts:6:70
 import { sendSuccess, sendError } from '../utils/responseHandler.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getPlayerStats = async (req: Request, res: Response) => {
-    try {
-        const username = ensureString(req.params.username);
-        const stats = await playerStatsService.getPlayerStats(username);
-        
-        if (!stats) {
-            return sendError(res, 'Player not found', 'PLAYER_NOT_FOUND', 404);
-        }
-
-        return sendSuccess(res, stats);
-    } catch (error) {
-        console.error("[PlayerStats] Error:", error);
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, "Internal Server Error", "INTERNAL_ERROR", 500, message);
-    }
-};
+export const getPlayerStats = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/playerStatsController.ts:7:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getPlayerStats = async (req: Request, res: Response) => {
-    try {
-        const username = ensureString(req.params.username);
-        const stats = await playerStatsService.getPlayerStats(username);
-        
-        if (!stats) {
-            return sendError(res, 'Player not found', 'PLAYER_NOT_FOUND', 404);
-        }
-
-        return sendSuccess(res, stats);
-    } catch (error) {
+    try {} catch (error) {
         console.error("[PlayerStats] Error:", error);
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] ConditionalExpression
controllers/playerStatsController.ts:11:13
         const username = ensureString(req.params.username);
         const stats = await playerStatsService.getPlayerStats(username);
         
-        if (!stats) {
+        if (true) {
             return sendError(res, 'Player not found', 'PLAYER_NOT_FOUND', 404);
         }

[NoCoverage] BlockStatement
controllers/playerStatsController.ts:16:21
         }
 
         return sendSuccess(res, stats);
-    } catch (error) {
-        console.error("[PlayerStats] Error:", error);
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, "Internal Server Error", "INTERNAL_ERROR", 500, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/playerStatsController.ts:17:23
 
         return sendSuccess(res, stats);
     } catch (error) {
-        console.error("[PlayerStats] Error:", error);
+        console.error("", error);
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, "Internal Server Error", "INTERNAL_ERROR", 500, message);

[NoCoverage] StringLiteral
controllers/playerStatsController.ts:19:56
     } catch (error) {
         console.error("[PlayerStats] Error:", error);
         const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, "Internal Server Error", "INTERNAL_ERROR", 500, message);
+        return sendError(res, "Internal Server Error", "", 500, message);
     }
 };
