[NoCoverage] BlockStatement
controllers/policyController.ts:7:67
 import * as logService from '../services/logService.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getPolicies = async (req: Request, res: Response) => {
-    try {
-        const policies = await policyService.getAllPolicies();
-        sendSuccess(res, policies);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error fetching policies';
-        sendError(res, message, 'FETCH_POLICIES_ERROR', 500, error);
-    }
-};
+export const getPolicies = async (req: Request, res: Response) => {};
 
 export const getPolicy = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/policyController.ts:8:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getPolicies = async (req: Request, res: Response) => {
-    try {
-        const policies = await policyService.getAllPolicies();
-        sendSuccess(res, policies);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : 'Error fetching policies';
         sendError(res, message, 'FETCH_POLICIES_ERROR', 500, error);

[NoCoverage] BlockStatement
controllers/policyController.ts:11:21
     try {
         const policies = await policyService.getAllPolicies();
         sendSuccess(res, policies);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error fetching policies';
-        sendError(res, message, 'FETCH_POLICIES_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/policyController.ts:12:66
         const policies = await policyService.getAllPolicies();
         sendSuccess(res, policies);
     } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error fetching policies';
+        const message = error instanceof Error ? error.message : "";
         sendError(res, message, 'FETCH_POLICIES_ERROR', 500, error);
     }

[NoCoverage] StringLiteral
controllers/policyController.ts:13:33
         sendSuccess(res, policies);
     } catch (error) {
         const message = error instanceof Error ? error.message : 'Error fetching policies';
-        sendError(res, message, 'FETCH_POLICIES_ERROR', 500, error);
+        sendError(res, message, "", 500, error);
     }
 };

[NoCoverage] BlockStatement
controllers/policyController.ts:17:65
     }
 };
 
-export const getPolicy = async (req: Request, res: Response) => {
-    try {
-        const slug = ensureString(req.params.slug);
-        const policy = await policyService.getPolicyBySlug(slug);
-        if (!policy) return sendError(res, 'Policy not found', 'NOT_FOUND', 404);
-        sendSuccess(res, policy);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error fetching policy';
-        sendError(res, message, 'FETCH_POLICY_ERROR', 500, error);
-    }
-};
+export const getPolicy = async (req: Request, res: Response) => {};
 
 export const updatePolicy = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/policyController.ts:18:9
 };
 
 export const getPolicy = async (req: Request, res: Response) => {
-    try {
-        const slug = ensureString(req.params.slug);
-        const policy = await policyService.getPolicyBySlug(slug);
-        if (!policy) return sendError(res, 'Policy not found', 'NOT_FOUND', 404);
-        sendSuccess(res, policy);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : 'Error fetching policy';
         sendError(res, message, 'FETCH_POLICY_ERROR', 500, error);

[NoCoverage] ConditionalExpression
controllers/policyController.ts:21:13
     try {
         const slug = ensureString(req.params.slug);
         const policy = await policyService.getPolicyBySlug(slug);
-        if (!policy) return sendError(res, 'Policy not found', 'NOT_FOUND', 404);
+        if (false) return sendError(res, 'Policy not found', 'NOT_FOUND', 404);
         sendSuccess(res, policy);
     } catch (error) {

[NoCoverage] ConditionalExpression
controllers/policyController.ts:21:13
     try {
         const slug = ensureString(req.params.slug);
         const policy = await policyService.getPolicyBySlug(slug);
-        if (!policy) return sendError(res, 'Policy not found', 'NOT_FOUND', 404);
+        if (true) return sendError(res, 'Policy not found', 'NOT_FOUND', 404);
         sendSuccess(res, policy);
     } catch (error) {

[NoCoverage] BlockStatement
controllers/policyController.ts:23:21
         const policy = await policyService.getPolicyBySlug(slug);
         if (!policy) return sendError(res, 'Policy not found', 'NOT_FOUND', 404);
         sendSuccess(res, policy);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error fetching policy';
-        sendError(res, message, 'FETCH_POLICY_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/policyController.ts:29:68
     }
 };
 
-export const updatePolicy = async (req: Request, res: Response) => {
-    try {
-        const slug = ensureString(req.params.slug);
-        const { title, content, title_en, content_en } = req.body;
-        const user = req.user;
-
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-
-        const userId = user.id;
-
-        const policy = await policyService.updatePolicy(slug, title, content, title_en, content_en, userId);
-        
-        await logService.createLog({ 
-            user_id: userId, 
-            action: 'UPDATE_POLICY', 
-            details: `Updated policy: ${slug} (EN/ES)` 
-        });
-        
-        sendSuccess(res, policy, 'Policy updated successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error updating policy';
-        sendError(res, message, 'UPDATE_POLICY_ERROR', 500, error);
-    }
-};
+export const updatePolicy = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/policyController.ts:30:9
 };
 
 export const updatePolicy = async (req: Request, res: Response) => {
-    try {
-        const slug = ensureString(req.params.slug);
-        const { title, content, title_en, content_en } = req.body;
-        const user = req.user;
-
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-
-        const userId = user.id;
-
-        const policy = await policyService.updatePolicy(slug, title, content, title_en, content_en, userId);
-        
-        await logService.createLog({ 
-            user_id: userId, 
-            action: 'UPDATE_POLICY', 
-            details: `Updated policy: ${slug} (EN/ES)` 
-        });
-        
-        sendSuccess(res, policy, 'Policy updated successfully');
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : 'Error updating policy';
         sendError(res, message, 'UPDATE_POLICY_ERROR', 500, error);

[NoCoverage] ConditionalExpression
controllers/policyController.ts:35:13
         const { title, content, title_en, content_en } = req.body;
         const user = req.user;
 
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
+        if (false) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
 
         const userId = user.id;

[NoCoverage] ConditionalExpression
controllers/policyController.ts:35:13
         const { title, content, title_en, content_en } = req.body;
         const user = req.user;
 
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
+        if (true) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
 
         const userId = user.id;

[NoCoverage] ObjectLiteral
controllers/policyController.ts:41:36
 
         const policy = await policyService.updatePolicy(slug, title, content, title_en, content_en, userId);
         
-        await logService.createLog({ 
-            user_id: userId, 
-            action: 'UPDATE_POLICY', 
-            details: `Updated policy: ${slug} (EN/ES)` 
-        });
+        await logService.createLog({});
         
         sendSuccess(res, policy, 'Policy updated successfully');

[NoCoverage] StringLiteral
controllers/policyController.ts:43:21
         
         await logService.createLog({ 
             user_id: userId, 
-            action: 'UPDATE_POLICY', 
+            action: "", 
             details: `Updated policy: ${slug} (EN/ES)` 
         });

[NoCoverage] BlockStatement
controllers/policyController.ts:48:21
         });
         
         sendSuccess(res, policy, 'Policy updated successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error updating policy';
-        sendError(res, message, 'UPDATE_POLICY_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/policyController.ts:49:66
         
         sendSuccess(res, policy, 'Policy updated successfully');
     } catch (error) {
-        const message = error instanceof Error ? error.message : 'Error updating policy';
+        const message = error instanceof Error ? error.message : "";
         sendError(res, message, 'UPDATE_POLICY_ERROR', 500, error);
     }
