[NoCoverage] BlockStatement
controllers/pollController.ts:6:69
 import { sendSuccess, sendError } from '../utils/responseHandler.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getActivePoll = async (req: Request, res: Response) => {
-    try {
-        const poll = await pollService.getActivePoll();
-        return sendSuccess(res, poll); // Can be null, that's fine
-    } catch (error: unknown) {
-        // Handle "relation does not exist" gracefully as usual
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        if (message.includes('does not exist')) {
-            return sendSuccess(res, null, 'Tables missing, no poll returned');
-        }
-        return sendError(res, message);
-    }
-};
+export const getActivePoll = async (req: Request, res: Response) => {};
 
 export const vote = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/pollController.ts:7:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getActivePoll = async (req: Request, res: Response) => {
-    try {
-        const poll = await pollService.getActivePoll();
-        return sendSuccess(res, poll); // Can be null, that's fine
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         // Handle "relation does not exist" gracefully as usual
         const message = error instanceof Error ? error.message : 'Unknown error';

[NoCoverage] BlockStatement
controllers/pollController.ts:10:30
     try {
         const poll = await pollService.getActivePoll();
         return sendSuccess(res, poll); // Can be null, that's fine
-    } catch (error: unknown) {
-        // Handle "relation does not exist" gracefully as usual
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        if (message.includes('does not exist')) {
-            return sendSuccess(res, null, 'Tables missing, no poll returned');
-        }
-        return sendError(res, message);
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] StringLiteral
controllers/pollController.ts:12:66
         return sendSuccess(res, poll); // Can be null, that's fine
     } catch (error: unknown) {
         // Handle "relation does not exist" gracefully as usual
-        const message = error instanceof Error ? error.message : 'Unknown error';
+        const message = error instanceof Error ? error.message : "";
         if (message.includes('does not exist')) {
             return sendSuccess(res, null, 'Tables missing, no poll returned');

[NoCoverage] BlockStatement
controllers/pollController.ts:13:49
     } catch (error: unknown) {
         // Handle "relation does not exist" gracefully as usual
         const message = error instanceof Error ? error.message : 'Unknown error';
-        if (message.includes('does not exist')) {
-            return sendSuccess(res, null, 'Tables missing, no poll returned');
-        }
+        if (message.includes('does not exist')) {}
         return sendError(res, message);
     }

[NoCoverage] ConditionalExpression
controllers/pollController.ts:13:13
     } catch (error: unknown) {
         // Handle "relation does not exist" gracefully as usual
         const message = error instanceof Error ? error.message : 'Unknown error';
-        if (message.includes('does not exist')) {
+        if (false) {
             return sendSuccess(res, null, 'Tables missing, no poll returned');
         }

[NoCoverage] BlockStatement
controllers/pollController.ts:20:60
     }
 };
 
-export const vote = async (req: Request, res: Response) => {
-    try {
-        const { pollId, optionId } = req.body;
-        const userId = req.user?.id;
-        
-        if (!userId) {
-            return sendError(res, 'User ID not found in token', 'UNAUTHORIZED', 401);
-        }
-
-        const result = await pollService.votePoll(pollId, optionId, userId);
-        return sendSuccess(res, result, 'Vote recorded');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
-};
+export const vote = async (req: Request, res: Response) => {};
 
 export const create = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/pollController.ts:21:9
 };
 
 export const vote = async (req: Request, res: Response) => {
-    try {
-        const { pollId, optionId } = req.body;
-        const userId = req.user?.id;
-        
-        if (!userId) {
-            return sendError(res, 'User ID not found in token', 'UNAUTHORIZED', 401);
-        }
-
-        const result = await pollService.votePoll(pollId, optionId, userId);
-        return sendSuccess(res, result, 'Vote recorded');
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         return sendError(res, message);

[NoCoverage] OptionalChaining
controllers/pollController.ts:23:24
 export const vote = async (req: Request, res: Response) => {
     try {
         const { pollId, optionId } = req.body;
-        const userId = req.user?.id;
+        const userId = req.user.id;
         
         if (!userId) {

[NoCoverage] BlockStatement
controllers/pollController.ts:25:22
         const { pollId, optionId } = req.body;
         const userId = req.user?.id;
         
-        if (!userId) {
-            return sendError(res, 'User ID not found in token', 'UNAUTHORIZED', 401);
-        }
+        if (!userId) {}
 
         const result = await pollService.votePoll(pollId, optionId, userId);

[NoCoverage] BlockStatement
controllers/pollController.ts:31:30
 
         const result = await pollService.votePoll(pollId, optionId, userId);
         return sendSuccess(res, result, 'Vote recorded');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] StringLiteral
controllers/pollController.ts:32:66
         const result = await pollService.votePoll(pollId, optionId, userId);
         return sendSuccess(res, result, 'Vote recorded');
     } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
+        const message = error instanceof Error ? error.message : "";
         return sendError(res, message);
     }

[NoCoverage] BlockStatement
controllers/pollController.ts:37:62
     }
 };
 
-export const create = async (req: Request, res: Response) => {
-    try {
-        const result = await pollService.createPoll(req.body);
-        return sendSuccess(res, result, 'Poll created successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
-};
+export const create = async (req: Request, res: Response) => {};
 
 export const update = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/pollController.ts:38:9
 };
 
 export const create = async (req: Request, res: Response) => {
-    try {
-        const result = await pollService.createPoll(req.body);
-        return sendSuccess(res, result, 'Poll created successfully');
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/pollController.ts:41:30
     try {
         const result = await pollService.createPoll(req.body);
         return sendSuccess(res, result, 'Poll created successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] BlockStatement
controllers/pollController.ts:47:62
     }
 };
 
-export const update = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
-        const result = await pollService.updatePoll(id, req.body);
-        return sendSuccess(res, result, 'Poll updated successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
-};
+export const update = async (req: Request, res: Response) => {};
 
 export const close = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/pollController.ts:48:9
 };
 
 export const update = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
-        const result = await pollService.updatePoll(id, req.body);
-        return sendSuccess(res, result, 'Poll updated successfully');
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         return sendError(res, message);

[NoCoverage] ConditionalExpression
controllers/pollController.ts:50:13
 export const update = async (req: Request, res: Response) => {
     try {
         const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
+        if (true) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
         const result = await pollService.updatePoll(id, req.body);
         return sendSuccess(res, result, 'Poll updated successfully');

[NoCoverage] ConditionalExpression
controllers/pollController.ts:50:13
 export const update = async (req: Request, res: Response) => {
     try {
         const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
+        if (false) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
         const result = await pollService.updatePoll(id, req.body);
         return sendSuccess(res, result, 'Poll updated successfully');

[NoCoverage] BlockStatement
controllers/pollController.ts:53:30
         if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
         const result = await pollService.updatePoll(id, req.body);
         return sendSuccess(res, result, 'Poll updated successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] BlockStatement
controllers/pollController.ts:59:61
     }
 };
 
-export const close = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
-        await pollService.closePoll(id);
-        return sendSuccess(res, null, 'Poll closed successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
-};
+export const close = async (req: Request, res: Response) => {};
 
 export const deletePoll = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/pollController.ts:60:9
 };
 
 export const close = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
-        await pollService.closePoll(id);
-        return sendSuccess(res, null, 'Poll closed successfully');
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/pollController.ts:65:30
         if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
         await pollService.closePoll(id);
         return sendSuccess(res, null, 'Poll closed successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] BlockStatement
controllers/pollController.ts:71:66
     }
 };
 
-export const deletePoll = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
-        await pollService.deletePoll(id);
-        return sendSuccess(res, null, 'Poll deleted successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
-};
+export const deletePoll = async (req: Request, res: Response) => {};
 
 export const getPolls = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/pollController.ts:72:9
 };
 
 export const deletePoll = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(ensureString(req.params.id));
-        if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
-        await pollService.deletePoll(id);
-        return sendSuccess(res, null, 'Poll deleted successfully');
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/pollController.ts:77:30
         if (isNaN(id)) return sendError(res, 'Invalid poll ID', 'INVALID_ID', 400);
         await pollService.deletePoll(id);
         return sendSuccess(res, null, 'Poll deleted successfully');
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] BlockStatement
controllers/pollController.ts:83:64
     }
 };
 
-export const getPolls = async (req: Request, res: Response) => {
-    try {
-        const page = parseInt(ensureString(req.query.page)) || 1;
-        const limit = parseInt(ensureString(req.query.limit)) || 10;
-        if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
-        const result = await pollService.getPolls({ page, limit });
-        return sendSuccess(res, result);
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
-};
+export const getPolls = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/pollController.ts:84:9
 };
 
 export const getPolls = async (req: Request, res: Response) => {
-    try {
-        const page = parseInt(ensureString(req.query.page)) || 1;
-        const limit = parseInt(ensureString(req.query.limit)) || 10;
-        if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
-        const result = await pollService.getPolls({ page, limit });
-        return sendSuccess(res, result);
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         const message = error instanceof Error ? error.message : 'Unknown error';
         return sendError(res, message);

[NoCoverage] ConditionalExpression
controllers/pollController.ts:85:22
 
 export const getPolls = async (req: Request, res: Response) => {
     try {
-        const page = parseInt(ensureString(req.query.page)) || 1;
+        const page = true;
         const limit = parseInt(ensureString(req.query.limit)) || 10;
         if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);

[NoCoverage] ConditionalExpression
controllers/pollController.ts:85:22
 
 export const getPolls = async (req: Request, res: Response) => {
     try {
-        const page = parseInt(ensureString(req.query.page)) || 1;
+        const page = false;
         const limit = parseInt(ensureString(req.query.limit)) || 10;
         if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);

[NoCoverage] ConditionalExpression
controllers/pollController.ts:86:23
 export const getPolls = async (req: Request, res: Response) => {
     try {
         const page = parseInt(ensureString(req.query.page)) || 1;
-        const limit = parseInt(ensureString(req.query.limit)) || 10;
+        const limit = false;
         if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
         const result = await pollService.getPolls({ page, limit });

[NoCoverage] ConditionalExpression
controllers/pollController.ts:86:23
 export const getPolls = async (req: Request, res: Response) => {
     try {
         const page = parseInt(ensureString(req.query.page)) || 1;
-        const limit = parseInt(ensureString(req.query.limit)) || 10;
+        const limit = true;
         if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
         const result = await pollService.getPolls({ page, limit });

[NoCoverage] ConditionalExpression
controllers/pollController.ts:87:13
     try {
         const page = parseInt(ensureString(req.query.page)) || 1;
         const limit = parseInt(ensureString(req.query.limit)) || 10;
-        if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
+        if (false) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
         const result = await pollService.getPolls({ page, limit });
         return sendSuccess(res, result);

[NoCoverage] LogicalOperator
controllers/pollController.ts:87:13
     try {
         const page = parseInt(ensureString(req.query.page)) || 1;
         const limit = parseInt(ensureString(req.query.limit)) || 10;
-        if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
+        if (isNaN(page) && isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
         const result = await pollService.getPolls({ page, limit });
         return sendSuccess(res, result);

[NoCoverage] BlockStatement
controllers/pollController.ts:90:30
         if (isNaN(page) || isNaN(limit)) return sendError(res, 'Invalid pagination values', 'INVALID_PAGINATION', 400);
         const result = await pollService.getPolls({ page, limit });
         return sendSuccess(res, result);
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : 'Unknown error';
-        return sendError(res, message);
-    }
+    } catch (error: unknown) {}
 };
 
