[NoCoverage] BlockStatement
controllers/profileCommentController.ts:6:67
 import { sendSuccess, sendError } from '../utils/responseHandler.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getComments = async (req: Request, res: Response) => {
-    try {
-        const profileId = ensureString(req.params.profileId);
-        const comments = await commentService.getCommentsByProfile(profileId);
-        return sendSuccess(res, comments);
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error fetching comments');
-    }
-};
+export const getComments = async (req: Request, res: Response) => {};
 
 export const postComment = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:7:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getComments = async (req: Request, res: Response) => {
-    try {
-        const profileId = ensureString(req.params.profileId);
-        const comments = await commentService.getCommentsByProfile(profileId);
-        return sendSuccess(res, comments);
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error fetching comments');
     }

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:11:21
         const profileId = ensureString(req.params.profileId);
         const comments = await commentService.getCommentsByProfile(profileId);
         return sendSuccess(res, comments);
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error fetching comments');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:16:67
     }
 };
 
-export const postComment = async (req: Request, res: Response) => {
-    try {
-        const profileId = ensureString(req.params.profileId);
-        const { content } = req.body;
-        const user = req.user;
-
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-        if (!content) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
-
-        const comment = await commentService.createComment(profileId, user.id, content);
-        return sendSuccess(res, comment, 'Comment posted');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error posting comment');
-    }
-};
+export const postComment = async (req: Request, res: Response) => {};
 
 export const removeComment = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:17:9
 };
 
 export const postComment = async (req: Request, res: Response) => {
-    try {
-        const profileId = ensureString(req.params.profileId);
-        const { content } = req.body;
-        const user = req.user;
-
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-        if (!content) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
-
-        const comment = await commentService.createComment(profileId, user.id, content);
-        return sendSuccess(res, comment, 'Comment posted');
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error posting comment');
     }

[NoCoverage] BooleanLiteral
controllers/profileCommentController.ts:22:13
         const { content } = req.body;
         const user = req.user;
 
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
+        if (user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
         if (!content) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
 

[NoCoverage] BooleanLiteral
controllers/profileCommentController.ts:23:13
         const user = req.user;
 
         if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-        if (!content) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
+        if (content) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
 
         const comment = await commentService.createComment(profileId, user.id, content);

[NoCoverage] ConditionalExpression
controllers/profileCommentController.ts:23:13
         const user = req.user;
 
         if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-        if (!content) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
+        if (true) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
 
         const comment = await commentService.createComment(profileId, user.id, content);

[NoCoverage] StringLiteral
controllers/profileCommentController.ts:26:42
         if (!content) return sendError(res, 'Content is required', 'MISSING_FIELDS', 400);
 
         const comment = await commentService.createComment(profileId, user.id, content);
-        return sendSuccess(res, comment, 'Comment posted');
+        return sendSuccess(res, comment, "");
     } catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error posting comment');

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:27:21
 
         const comment = await commentService.createComment(profileId, user.id, content);
         return sendSuccess(res, comment, 'Comment posted');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error posting comment');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:32:69
     }
 };
 
-export const removeComment = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const user = req.user;
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-        
-        await commentService.deleteComment(parseInt(id), { id: user.id, role: user.role });
-        return sendSuccess(res, null, 'Comment deleted');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error deleting comment');
-    }
-};
+export const removeComment = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:33:9
 };
 
 export const removeComment = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const user = req.user;
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
-        
-        await commentService.deleteComment(parseInt(id), { id: user.id, role: user.role });
-        return sendSuccess(res, null, 'Comment deleted');
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error deleting comment');
     }

[NoCoverage] ConditionalExpression
controllers/profileCommentController.ts:36:13
     try {
         const id = ensureString(req.params.id);
         const user = req.user;
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
+        if (false) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
         
         await commentService.deleteComment(parseInt(id), { id: user.id, role: user.role });

[NoCoverage] ConditionalExpression
controllers/profileCommentController.ts:36:13
     try {
         const id = ensureString(req.params.id);
         const user = req.user;
-        if (!user) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
+        if (true) return sendError(res, 'Unauthorized', 'UNAUTHORIZED', 401);
         
         await commentService.deleteComment(parseInt(id), { id: user.id, role: user.role });

[NoCoverage] BlockStatement
controllers/profileCommentController.ts:40:21
         
         await commentService.deleteComment(parseInt(id), { id: user.id, role: user.role });
         return sendSuccess(res, null, 'Comment deleted');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error deleting comment');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/profileCommentController.ts:41:72
         await commentService.deleteComment(parseInt(id), { id: user.id, role: user.role });
         return sendSuccess(res, null, 'Comment deleted');
     } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error deleting comment');
+        return sendError(res, error instanceof Error ? error.message : "");
     }
 };
