[Timeout] StringLiteral
controllers/roadmapController.ts:16:56
 }
 
 const DEFAULT_ROADMAP: RoadmapDayConfig[] = [
-    { day: 1, title: 'Día 1: Bienvenida', reward_type: 'killucoins', reward_value: 25, multiplier: 1 },
+    { day: 1, title: 'Día 1: Bienvenida', reward_type: "", reward_value: 25, multiplier: 1 },
     { day: 2, title: 'Día 2: Primer Paso', reward_type: 'killucoins', reward_value: 50, multiplier: 1 },
     { day: 3, title: 'Día 3: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },

[Timeout] ObjectLiteral
controllers/roadmapController.ts:17:5
 
 const DEFAULT_ROADMAP: RoadmapDayConfig[] = [
     { day: 1, title: 'Día 1: Bienvenida', reward_type: 'killucoins', reward_value: 25, multiplier: 1 },
-    { day: 2, title: 'Día 2: Primer Paso', reward_type: 'killucoins', reward_value: 50, multiplier: 1 },
+    {},
     { day: 3, title: 'Día 3: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },
     { day: 4, title: 'Día 4: Continuidad', reward_type: 'killucoins', reward_value: 100, multiplier: 1 },

[Timeout] StringLiteral
controllers/roadmapController.ts:18:63
 const DEFAULT_ROADMAP: RoadmapDayConfig[] = [
     { day: 1, title: 'Día 1: Bienvenida', reward_type: 'killucoins', reward_value: 25, multiplier: 1 },
     { day: 2, title: 'Día 2: Primer Paso', reward_type: 'killucoins', reward_value: 50, multiplier: 1 },
-    { day: 3, title: 'Día 3: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },
+    { day: 3, title: 'Día 3: Giro Gacha Bronce', reward_type: "", reward_value: 1, multiplier: 1 },
     { day: 4, title: 'Día 4: Continuidad', reward_type: 'killucoins', reward_value: 100, multiplier: 1 },
     { day: 5, title: 'Día 5: En Racha', reward_type: 'killucoins', reward_value: 125, multiplier: 1 },

[Timeout] StringLiteral
controllers/roadmapController.ts:19:22
     { day: 1, title: 'Día 1: Bienvenida', reward_type: 'killucoins', reward_value: 25, multiplier: 1 },
     { day: 2, title: 'Día 2: Primer Paso', reward_type: 'killucoins', reward_value: 50, multiplier: 1 },
     { day: 3, title: 'Día 3: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },
-    { day: 4, title: 'Día 4: Continuidad', reward_type: 'killucoins', reward_value: 100, multiplier: 1 },
+    { day: 4, title: "", reward_type: 'killucoins', reward_value: 100, multiplier: 1 },
     { day: 5, title: 'Día 5: En Racha', reward_type: 'killucoins', reward_value: 125, multiplier: 1 },
     { day: 6, title: 'Día 6: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },

[Timeout] StringLiteral
controllers/roadmapController.ts:22:60
     { day: 4, title: 'Día 4: Continuidad', reward_type: 'killucoins', reward_value: 100, multiplier: 1 },
     { day: 5, title: 'Día 5: En Racha', reward_type: 'killucoins', reward_value: 125, multiplier: 1 },
     { day: 6, title: 'Día 6: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },
-    { day: 7, title: 'Día 7: Botín de Cobre', reward_type: 'killucoins', reward_value: 175, multiplier: 1 },
+    { day: 7, title: 'Día 7: Botín de Cobre', reward_type: "", reward_value: 175, multiplier: 1 },
 
     { day: 8, title: 'Día 8: Impulso x2', reward_type: 'killucoins', reward_value: 200, multiplier: 2 },

[Timeout] StringLiteral
controllers/roadmapController.ts:24:22
     { day: 6, title: 'Día 6: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },
     { day: 7, title: 'Día 7: Botín de Cobre', reward_type: 'killucoins', reward_value: 175, multiplier: 1 },
 
-    { day: 8, title: 'Día 8: Impulso x2', reward_type: 'killucoins', reward_value: 200, multiplier: 2 },
+    { day: 8, title: "", reward_type: 'killucoins', reward_value: 200, multiplier: 2 },
     { day: 9, title: 'Día 9: Carga Doble', reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
     { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },

[Timeout] ObjectLiteral
controllers/roadmapController.ts:24:5
     { day: 6, title: 'Día 6: Giro Gacha Bronce', reward_type: 'gacha_spin', reward_value: 1, multiplier: 1 },
     { day: 7, title: 'Día 7: Botín de Cobre', reward_type: 'killucoins', reward_value: 175, multiplier: 1 },
 
-    { day: 8, title: 'Día 8: Impulso x2', reward_type: 'killucoins', reward_value: 200, multiplier: 2 },
+    {},
     { day: 9, title: 'Día 9: Carga Doble', reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
     { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },

[Timeout] StringLiteral
controllers/roadmapController.ts:25:22
     { day: 7, title: 'Día 7: Botín de Cobre', reward_type: 'killucoins', reward_value: 175, multiplier: 1 },
 
     { day: 8, title: 'Día 8: Impulso x2', reward_type: 'killucoins', reward_value: 200, multiplier: 2 },
-    { day: 9, title: 'Día 9: Carga Doble', reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
+    { day: 9, title: "", reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
     { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 11, title: 'Día 11: Plata Viva', reward_type: 'killucoins', reward_value: 275, multiplier: 2 },

[Timeout] StringLiteral
controllers/roadmapController.ts:25:57
     { day: 7, title: 'Día 7: Botín de Cobre', reward_type: 'killucoins', reward_value: 175, multiplier: 1 },
 
     { day: 8, title: 'Día 8: Impulso x2', reward_type: 'killucoins', reward_value: 200, multiplier: 2 },
-    { day: 9, title: 'Día 9: Carga Doble', reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
+    { day: 9, title: 'Día 9: Carga Doble', reward_type: "", reward_value: 225, multiplier: 2 },
     { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 11, title: 'Día 11: Plata Viva', reward_type: 'killucoins', reward_value: 275, multiplier: 2 },

[Timeout] ObjectLiteral
controllers/roadmapController.ts:26:5
 
     { day: 8, title: 'Día 8: Impulso x2', reward_type: 'killucoins', reward_value: 200, multiplier: 2 },
     { day: 9, title: 'Día 9: Carga Doble', reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
-    { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
+    {},
     { day: 11, title: 'Día 11: Plata Viva', reward_type: 'killucoins', reward_value: 275, multiplier: 2 },
     { day: 12, title: 'Día 12: Constancia', reward_type: 'killucoins', reward_value: 300, multiplier: 2 },

[Timeout] ObjectLiteral
controllers/roadmapController.ts:28:5
     { day: 9, title: 'Día 9: Carga Doble', reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
     { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 11, title: 'Día 11: Plata Viva', reward_type: 'killucoins', reward_value: 275, multiplier: 2 },
-    { day: 12, title: 'Día 12: Constancia', reward_type: 'killucoins', reward_value: 300, multiplier: 2 },
+    {},
     { day: 13, title: 'Día 13: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 14, title: 'Día 14: Botín de Hierro', reward_type: 'killucoins', reward_value: 350, multiplier: 2 },

[Timeout] StringLiteral
controllers/roadmapController.ts:28:58
     { day: 9, title: 'Día 9: Carga Doble', reward_type: 'killucoins', reward_value: 225, multiplier: 2 },
     { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 11, title: 'Día 11: Plata Viva', reward_type: 'killucoins', reward_value: 275, multiplier: 2 },
-    { day: 12, title: 'Día 12: Constancia', reward_type: 'killucoins', reward_value: 300, multiplier: 2 },
+    { day: 12, title: 'Día 12: Constancia', reward_type: "", reward_value: 300, multiplier: 2 },
     { day: 13, title: 'Día 13: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 14, title: 'Día 14: Botín de Hierro', reward_type: 'killucoins', reward_value: 350, multiplier: 2 },

[Timeout] ObjectLiteral
controllers/roadmapController.ts:29:5
     { day: 10, title: 'Día 10: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 11, title: 'Día 11: Plata Viva', reward_type: 'killucoins', reward_value: 275, multiplier: 2 },
     { day: 12, title: 'Día 12: Constancia', reward_type: 'killucoins', reward_value: 300, multiplier: 2 },
-    { day: 13, title: 'Día 13: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
+    {},
     { day: 14, title: 'Día 14: Botín de Hierro', reward_type: 'killucoins', reward_value: 350, multiplier: 2 },
 

[Timeout] ObjectLiteral
controllers/roadmapController.ts:30:5
     { day: 11, title: 'Día 11: Plata Viva', reward_type: 'killucoins', reward_value: 275, multiplier: 2 },
     { day: 12, title: 'Día 12: Constancia', reward_type: 'killucoins', reward_value: 300, multiplier: 2 },
     { day: 13, title: 'Día 13: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
-    { day: 14, title: 'Día 14: Botín de Hierro', reward_type: 'killucoins', reward_value: 350, multiplier: 2 },
+    {},
 
     { day: 15, title: 'Día 15: Super Impulso x5', reward_type: 'killucoins', reward_value: 400, multiplier: 5 },

[Timeout] StringLiteral
controllers/roadmapController.ts:32:64
     { day: 13, title: 'Día 13: Giro Gacha Plata', reward_type: 'gacha_spin', reward_value: 1, multiplier: 2 },
     { day: 14, title: 'Día 14: Botín de Hierro', reward_type: 'killucoins', reward_value: 350, multiplier: 2 },
 
-    { day: 15, title: 'Día 15: Super Impulso x5', reward_type: 'killucoins', reward_value: 400, multiplier: 5 },
+    { day: 15, title: 'Día 15: Super Impulso x5', reward_type: "", reward_value: 400, multiplier: 5 },
     { day: 16, title: 'Día 16: Fuerza Dorada', reward_type: 'killucoins', reward_value: 425, multiplier: 5 },
     { day: 17, title: 'Día 17: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },

[Timeout] StringLiteral
controllers/roadmapController.ts:33:23
     { day: 14, title: 'Día 14: Botín de Hierro', reward_type: 'killucoins', reward_value: 350, multiplier: 2 },
 
     { day: 15, title: 'Día 15: Super Impulso x5', reward_type: 'killucoins', reward_value: 400, multiplier: 5 },
-    { day: 16, title: 'Día 16: Fuerza Dorada', reward_type: 'killucoins', reward_value: 425, multiplier: 5 },
+    { day: 16, title: "", reward_type: 'killucoins', reward_value: 425, multiplier: 5 },
     { day: 17, title: 'Día 17: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
     { day: 18, title: 'Día 18: Fuego Dorado', reward_type: 'killucoins', reward_value: 475, multiplier: 5 },

[Timeout] StringLiteral
controllers/roadmapController.ts:34:23
 
     { day: 15, title: 'Día 15: Super Impulso x5', reward_type: 'killucoins', reward_value: 400, multiplier: 5 },
     { day: 16, title: 'Día 16: Fuerza Dorada', reward_type: 'killucoins', reward_value: 425, multiplier: 5 },
-    { day: 17, title: 'Día 17: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
+    { day: 17, title: "", reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
     { day: 18, title: 'Día 18: Fuego Dorado', reward_type: 'killucoins', reward_value: 475, multiplier: 5 },
     { day: 19, title: 'Día 19: Avance Épico', reward_type: 'killucoins', reward_value: 500, multiplier: 5 },

[Timeout] StringLiteral
controllers/roadmapController.ts:36:60
     { day: 16, title: 'Día 16: Fuerza Dorada', reward_type: 'killucoins', reward_value: 425, multiplier: 5 },
     { day: 17, title: 'Día 17: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
     { day: 18, title: 'Día 18: Fuego Dorado', reward_type: 'killucoins', reward_value: 475, multiplier: 5 },
-    { day: 19, title: 'Día 19: Avance Épico', reward_type: 'killucoins', reward_value: 500, multiplier: 5 },
+    { day: 19, title: 'Día 19: Avance Épico', reward_type: "", reward_value: 500, multiplier: 5 },
     { day: 20, title: 'Día 20: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
     { day: 21, title: 'Día 21: Bloque de Oro', reward_type: 'killucoins', reward_value: 550, multiplier: 5 },

[Timeout] StringLiteral
controllers/roadmapController.ts:36:23
     { day: 16, title: 'Día 16: Fuerza Dorada', reward_type: 'killucoins', reward_value: 425, multiplier: 5 },
     { day: 17, title: 'Día 17: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
     { day: 18, title: 'Día 18: Fuego Dorado', reward_type: 'killucoins', reward_value: 475, multiplier: 5 },
-    { day: 19, title: 'Día 19: Avance Épico', reward_type: 'killucoins', reward_value: 500, multiplier: 5 },
+    { day: 19, title: "", reward_type: 'killucoins', reward_value: 500, multiplier: 5 },
     { day: 20, title: 'Día 20: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
     { day: 21, title: 'Día 21: Bloque de Oro', reward_type: 'killucoins', reward_value: 550, multiplier: 5 },

[Timeout] StringLiteral
controllers/roadmapController.ts:37:62
     { day: 17, title: 'Día 17: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
     { day: 18, title: 'Día 18: Fuego Dorado', reward_type: 'killucoins', reward_value: 475, multiplier: 5 },
     { day: 19, title: 'Día 19: Avance Épico', reward_type: 'killucoins', reward_value: 500, multiplier: 5 },
-    { day: 20, title: 'Día 20: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
+    { day: 20, title: 'Día 20: Giro Gacha Oro', reward_type: "", reward_value: 1, multiplier: 5 },
     { day: 21, title: 'Día 21: Bloque de Oro', reward_type: 'killucoins', reward_value: 550, multiplier: 5 },
 

[Timeout] ObjectLiteral
controllers/roadmapController.ts:38:5
     { day: 18, title: 'Día 18: Fuego Dorado', reward_type: 'killucoins', reward_value: 475, multiplier: 5 },
     { day: 19, title: 'Día 19: Avance Épico', reward_type: 'killucoins', reward_value: 500, multiplier: 5 },
     { day: 20, title: 'Día 20: Giro Gacha Oro', reward_type: 'gacha_spin', reward_value: 1, multiplier: 5 },
-    { day: 21, title: 'Día 21: Bloque de Oro', reward_type: 'killucoins', reward_value: 550, multiplier: 5 },
+    {},
 
     { day: 22, title: 'Día 22: Ultra Multiplicador x10', reward_type: 'killucoins', reward_value: 600, multiplier: 10 },

[Timeout] StringLiteral
controllers/roadmapController.ts:42:23
 
     { day: 22, title: 'Día 22: Ultra Multiplicador x10', reward_type: 'killucoins', reward_value: 600, multiplier: 10 },
     { day: 23, title: 'Día 23: Poder Esmeralda', reward_type: 'killucoins', reward_value: 625, multiplier: 10 },
-    { day: 24, title: 'Día 24: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
+    { day: 24, title: "", reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
     { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },

[Timeout] ObjectLiteral
controllers/roadmapController.ts:43:5
     { day: 22, title: 'Día 22: Ultra Multiplicador x10', reward_type: 'killucoins', reward_value: 600, multiplier: 10 },
     { day: 23, title: 'Día 23: Poder Esmeralda', reward_type: 'killucoins', reward_value: 625, multiplier: 10 },
     { day: 24, title: 'Día 24: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
-    { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
+    {},
     { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },

[Timeout] StringLiteral
controllers/roadmapController.ts:43:68
     { day: 22, title: 'Día 22: Ultra Multiplicador x10', reward_type: 'killucoins', reward_value: 600, multiplier: 10 },
     { day: 23, title: 'Día 23: Poder Esmeralda', reward_type: 'killucoins', reward_value: 625, multiplier: 10 },
     { day: 24, title: 'Día 24: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
-    { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
+    { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: "", reward_value: 675, multiplier: 10 },
     { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },

[Timeout] StringLiteral
controllers/roadmapController.ts:44:56
     { day: 23, title: 'Día 23: Poder Esmeralda', reward_type: 'killucoins', reward_value: 625, multiplier: 10 },
     { day: 24, title: 'Día 24: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
-    { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
+    { day: 26, title: 'Día 26: Maestría', reward_type: "", reward_value: 700, multiplier: 10 },
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: 'killucoins', reward_value: 750, multiplier: 10 },

[Timeout] StringLiteral
controllers/roadmapController.ts:44:23
     { day: 23, title: 'Día 23: Poder Esmeralda', reward_type: 'killucoins', reward_value: 625, multiplier: 10 },
     { day: 24, title: 'Día 24: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
-    { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
+    { day: 26, title: "", reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: 'killucoins', reward_value: 750, multiplier: 10 },

[Timeout] ObjectLiteral
controllers/roadmapController.ts:45:5
     { day: 24, title: 'Día 24: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
     { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
-    { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
+    {},
     { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: 'killucoins', reward_value: 750, multiplier: 10 },
     { day: 29, title: 'Día 29: Estrella del Nether', reward_type: 'gacha_spin', reward_value: 2, multiplier: 10 },

[Timeout] StringLiteral
controllers/roadmapController.ts:46:23
     { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
     { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
-    { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: 'killucoins', reward_value: 750, multiplier: 10 },
+    { day: 28, title: "", reward_type: 'killucoins', reward_value: 750, multiplier: 10 },
     { day: 29, title: 'Día 29: Estrella del Nether', reward_type: 'gacha_spin', reward_value: 2, multiplier: 10 },
     { day: 30, title: 'Día 30: 👑 JACKPOT IRIDIUM X50', reward_type: 'achievement', reward_value: 2500, multiplier: 50, is_jackpot: true }

[Timeout] StringLiteral
controllers/roadmapController.ts:46:64
     { day: 25, title: 'Día 25: Resplandor Esmeralda', reward_type: 'killucoins', reward_value: 675, multiplier: 10 },
     { day: 26, title: 'Día 26: Maestría', reward_type: 'killucoins', reward_value: 700, multiplier: 10 },
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
-    { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: 'killucoins', reward_value: 750, multiplier: 10 },
+    { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: "", reward_value: 750, multiplier: 10 },
     { day: 29, title: 'Día 29: Estrella del Nether', reward_type: 'gacha_spin', reward_value: 2, multiplier: 10 },
     { day: 30, title: 'Día 30: 👑 JACKPOT IRIDIUM X50', reward_type: 'achievement', reward_value: 2500, multiplier: 50, is_jackpot: true }

[Timeout] BooleanLiteral
controllers/roadmapController.ts:48:133
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: 'killucoins', reward_value: 750, multiplier: 10 },
     { day: 29, title: 'Día 29: Estrella del Nether', reward_type: 'gacha_spin', reward_value: 2, multiplier: 10 },
-    { day: 30, title: 'Día 30: 👑 JACKPOT IRIDIUM X50', reward_type: 'achievement', reward_value: 2500, multiplier: 50, is_jackpot: true }
+    { day: 30, title: 'Día 30: 👑 JACKPOT IRIDIUM X50', reward_type: 'achievement', reward_value: 2500, multiplier: 50, is_jackpot: tfalse}
 ];
 

[Timeout] StringLiteral
controllers/roadmapController.ts:48:23
     { day: 27, title: 'Día 27: Giro Gacha Mítico', reward_type: 'gacha_spin', reward_value: 1, multiplier: 10 },
     { day: 28, title: 'Día 28: Bloque Esmeralda', reward_type: 'killucoins', reward_value: 750, multiplier: 10 },
     { day: 29, title: 'Día 29: Estrella del Nether', reward_type: 'gacha_spin', reward_value: 2, multiplier: 10 },
-    { day: 30, title: 'Día 30: 👑 JACKPOT IRIDIUM X50', reward_type: 'achievement', reward_value: 2500, multiplier: 50, is_jackpot: true }
+    { day: 30, title: "" reward_type: 'achievement', reward_value: 2500, multiplier: 50, is_jackpot: true }
 ];
 

[NoCoverage] BlockStatement
controllers/roadmapController.ts:51:73
     { day: 30, title: 'Día 30: 👑 JACKPOT IRIDIUM X50', reward_type: 'achievement', reward_value: 2500, multiplier: 50, is_jackpot: true }
 ];
 
-export const getRoadmapConfig = async (_req: Request, res: Response) => {
-    try {
-        const { data, error } = await supabase
-            .from('monthly_roadmap_config')
-            .select('*')
-            .order('day', { ascending: true });
-
-        if (error || !data || data.length === 0) {
-            return sendSuccess(res, DEFAULT_ROADMAP);
-        }
-
-        return sendSuccess(res, data);
-    } catch (error) {
-        console.error('[Roadmap] Error fetching config:', error);
-        return sendSuccess(res, DEFAULT_ROADMAP);
-    }
-};
+export const getRoadmapConfig = async (_req: Request, res: Response) => {};
 
 export const getUserStreakStatus = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/roadmapController.ts:52:9
 ];
 
 export const getRoadmapConfig = async (_req: Request, res: Response) => {
-    try {
-        const { data, error } = await supabase
-            .from('monthly_roadmap_config')
-            .select('*')
-            .order('day', { ascending: true });
-
-        if (error || !data || data.length === 0) {
-            return sendSuccess(res, DEFAULT_ROADMAP);
-        }
-
-        return sendSuccess(res, data);
-    } catch (error) {
+    try {} catch (error) {
         console.error('[Roadmap] Error fetching config:', error);
         return sendSuccess(res, DEFAULT_ROADMAP);

[NoCoverage] BooleanLiteral
controllers/roadmapController.ts:56:40
         const { data, error } = await supabase
             .from('monthly_roadmap_config')
             .select('*')
-            .order('day', { ascending: true });
+            .order('day', { ascending: false });
 
         if (error || !data || data.length === 0) {

[NoCoverage] StringLiteral
controllers/roadmapController.ts:56:20
         const { data, error } = await supabase
             .from('monthly_roadmap_config')
             .select('*')
-            .order('day', { ascending: true });
+            .order("", { ascending: true });
 
         if (error || !data || data.length === 0) {

[NoCoverage] BlockStatement
controllers/roadmapController.ts:58:50
             .select('*')
             .order('day', { ascending: true });
 
-        if (error || !data || data.length === 0) {
-            return sendSuccess(res, DEFAULT_ROADMAP);
-        }
+        if (error || !data || data.length === 0) {}
 
         return sendSuccess(res, data);

[NoCoverage] EqualityOperator
controllers/roadmapController.ts:58:31
             .select('*')
             .order('day', { ascending: true });
 
-        if (error || !data || data.length === 0) {
+        if (error || !data || data.length !== 0) {
             return sendSuccess(res, DEFAULT_ROADMAP);
         }

[NoCoverage] BlockStatement
controllers/roadmapController.ts:63:21
         }
 
         return sendSuccess(res, data);
-    } catch (error) {
-        console.error('[Roadmap] Error fetching config:', error);
-        return sendSuccess(res, DEFAULT_ROADMAP);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:71:24
 
 export const getUserStreakStatus = async (req: Request, res: Response) => {
     try {
-        const userId = req.user?.id || (req.query.userId as string);
+        const userId = false;
         if (!userId) {
             return sendError(res, 'User ID required', 'UNAUTHORIZED', 401);

[NoCoverage] OptionalChaining
controllers/roadmapController.ts:71:24
 
 export const getUserStreakStatus = async (req: Request, res: Response) => {
     try {
-        const userId = req.user?.id || (req.query.userId as string);
+        const userId = req.user.id || (req.query.userId as string);
         if (!userId) {
             return sendError(res, 'User ID required', 'UNAUTHORIZED', 401);

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:72:13
 export const getUserStreakStatus = async (req: Request, res: Response) => {
     try {
         const userId = req.user?.id || (req.query.userId as string);
-        if (!userId) {
+        if (true) {
             return sendError(res, 'User ID required', 'UNAUTHORIZED', 401);
         }

[NoCoverage] BooleanLiteral
controllers/roadmapController.ts:72:13
 export const getUserStreakStatus = async (req: Request, res: Response) => {
     try {
         const userId = req.user?.id || (req.query.userId as string);
-        if (!userId) {
+        if (userId) {
             return sendError(res, 'User ID required', 'UNAUTHORIZED', 401);
         }

[NoCoverage] StringLiteral
controllers/roadmapController.ts:77:19
         }
 
         const { data: streak } = await supabase
-            .from('user_daily_streaks')
+            .from("")
             .select('*')
             .eq('user_id', userId)

[NoCoverage] OptionalChaining
controllers/roadmapController.ts:82:31
             .eq('user_id', userId)
             .single();
 
-        const currentStreak = streak?.current_streak ?? 0;
+        const currentStreak = streak.current_streak ?? 0;
         const lastClaim = streak?.last_claim_at ? new Date(streak.last_claim_at) : null;
         

[NoCoverage] LogicalOperator
controllers/roadmapController.ts:82:31
             .eq('user_id', userId)
             .single();
 
-        const currentStreak = streak?.current_streak ?? 0;
+        const currentStreak = streak?.current_streak && 0;
         const lastClaim = streak?.last_claim_at ? new Date(streak.last_claim_at) : null;
         

[NoCoverage] OptionalChaining
controllers/roadmapController.ts:83:27
             .single();
 
         const currentStreak = streak?.current_streak ?? 0;
-        const lastClaim = streak?.last_claim_at ? new Date(streak.last_claim_at) : null;
+        const lastClaim = streak.last_claim_at ? new Date(streak.last_claim_at) : null;
         
         let canClaim = true;

[NoCoverage] BooleanLiteral
controllers/roadmapController.ts:85:24
         const currentStreak = streak?.current_streak ?? 0;
         const lastClaim = streak?.last_claim_at ? new Date(streak.last_claim_at) : null;
         
-        let canClaim = true;
+        let canClaim = false;
         if (lastClaim) {
             const hoursSinceLastClaim = (Date.now() - lastClaim.getTime()) / (1000 * 60 * 60);

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:86:13
         const lastClaim = streak?.last_claim_at ? new Date(streak.last_claim_at) : null;
         
         let canClaim = true;
-        if (lastClaim) {
+        if (true) {
             const hoursSinceLastClaim = (Date.now() - lastClaim.getTime()) / (1000 * 60 * 60);
             if (hoursSinceLastClaim < 20) {

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:86:13
         const lastClaim = streak?.last_claim_at ? new Date(streak.last_claim_at) : null;
         
         let canClaim = true;
-        if (lastClaim) {
+        if (false) {
             const hoursSinceLastClaim = (Date.now() - lastClaim.getTime()) / (1000 * 60 * 60);
             if (hoursSinceLastClaim < 20) {
