[NoCoverage] BooleanLiteral
controllers/roadmapController.ts:211:30
         if (currentStreak === 30 || dayConfig.is_jackpot) {
             if (prestigeLevel < MAX_PRESTIGE) {
                 prestigeLevel += 1;
-                prestigeUp = true;
+                prestigeUp = false;
             }
             const ach = PRESTIGE_ACHIEVEMENTS[prestigeLevel] || { id: `prestige_${prestigeLevel}`, title: `Logro: Prestigio Nivel ${prestigeLevel}` };

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:213:25
                 prestigeLevel += 1;
                 prestigeUp = true;
             }
-            const ach = PRESTIGE_ACHIEVEMENTS[prestigeLevel] || { id: `prestige_${prestigeLevel}`, title: `Logro: Prestigio Nivel ${prestigeLevel}` };
+            const ach = false;
             achievementId = ach.id;
             achievementTitle = ach.title;

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:213:25
                 prestigeLevel += 1;
                 prestigeUp = true;
             }
-            const ach = PRESTIGE_ACHIEVEMENTS[prestigeLevel] || { id: `prestige_${prestigeLevel}`, title: `Logro: Prestigio Nivel ${prestigeLevel}` };
+            const ach = true;
             achievementId = ach.id;
             achievementTitle = ach.title;

[NoCoverage] LogicalOperator
controllers/roadmapController.ts:227:32
                 prestige_level: prestigeLevel,
                 streak_shields: streakShields,
                 last_claim_at: new Date().toISOString(),
-                total_claims: (streak?.total_claims ?? 0) + 1
+                total_claims: (streak?.total_claims && 0) + 1
             });
 

[NoCoverage] ArithmeticOperator
controllers/roadmapController.ts:227:31
                 prestige_level: prestigeLevel,
                 streak_shields: streakShields,
                 last_claim_at: new Date().toISOString(),
-                total_claims: (streak?.total_claims ?? 0) + 1
+                total_claims: (streak?.total_claims ?? 0) - 1
             });
 

[NoCoverage] BooleanLiteral
controllers/roadmapController.ts:231:35
             });
 
         // Unlock Logro (Achievement) & Título Equipable en Servidor/Chat
-        let unlockedAchievement = false;
+        let unlockedAchievement = true;
         if (currentStreak === 30 || dayConfig.is_jackpot) {
             const cleanTitleName = achievementTitle.replace('Logro: ', '');

[NoCoverage] EqualityOperator
controllers/roadmapController.ts:232:13
 
         // Unlock Logro (Achievement) & Título Equipable en Servidor/Chat
         let unlockedAchievement = false;
-        if (currentStreak === 30 || dayConfig.is_jackpot) {
+        if (currentStreak !== 30 || dayConfig.is_jackpot) {
             const cleanTitleName = achievementTitle.replace('Logro: ', '');
 

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:232:13
 
         // Unlock Logro (Achievement) & Título Equipable en Servidor/Chat
         let unlockedAchievement = false;
-        if (currentStreak === 30 || dayConfig.is_jackpot) {
+        if (true) {
             const cleanTitleName = achievementTitle.replace('Logro: ', '');
 

[NoCoverage] StringLiteral
controllers/roadmapController.ts:233:61
         // Unlock Logro (Achievement) & Título Equipable en Servidor/Chat
         let unlockedAchievement = false;
         if (currentStreak === 30 || dayConfig.is_jackpot) {
-            const cleanTitleName = achievementTitle.replace('Logro: ', '');
+            const cleanTitleName = achievementTitle.replace("", '');
 
             // 1. Registrar como Logro / Achievement

[NoCoverage] ObjectLiteral
controllers/roadmapController.ts:248:25
             // 2. Desbloquear Título equipable en Minecraft / Chat
             await supabase
                 .from('user_titles')
-                .upsert({
-                    user_id: userId,
-                    title_id: achievementId,
-                    title_name: cleanTitleName,
-                    unlocked_at: new Date().toISOString()
-                });
+                .upsert({});
 
             unlockedAchievement = true;

[NoCoverage] BooleanLiteral
controllers/roadmapController.ts:255:35
                     unlocked_at: new Date().toISOString()
                 });
 
-            unlockedAchievement = true;
+            unlockedAchievement = false;
         }
 

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:261:13
         const newBalance = await gachaBalanceService.getGachaBalance(userId);
 
         let msg = `¡Recompensa del Día ${currentStreak} reclamada!`;
-        if (prestigeUp) {
+        if (false) {
             msg += ` 👑 ¡Avanzaste a ${achievementTitle} (+${prestigeLevel * 15}% KC)!`;
         }

[NoCoverage] BlockStatement
controllers/roadmapController.ts:261:25
         const newBalance = await gachaBalanceService.getGachaBalance(userId);
 
         let msg = `¡Recompensa del Día ${currentStreak} reclamada!`;
-        if (prestigeUp) {
-            msg += ` 👑 ¡Avanzaste a ${achievementTitle} (+${prestigeLevel * 15}% KC)!`;
-        }
+        if (prestigeUp) {}
         if (usedShield) {
             msg += ` 🛡️ (¡Escudo de Racha activado! Tu racha fue salvada, escudos restantes: ${streakShields})`;

[NoCoverage] ArithmeticOperator
controllers/roadmapController.ts:262:62
 
         let msg = `¡Recompensa del Día ${currentStreak} reclamada!`;
         if (prestigeUp) {
-            msg += ` 👑 ¡Avanzaste a ${achievementTitle} (+${prestigeLevel * 15}% KC)!`;
+            msg += ` 👑 ¡Avanzaste a ${achievementTitle} (+${pprestigeLevel / 15% KC)!`;
         }
         if (usedShield) {

[NoCoverage] StringLiteral
controllers/roadmapController.ts:262:20
 
         let msg = `¡Recompensa del Día ${currentStreak} reclamada!`;
         if (prestigeUp) {
-            msg += ` 👑 ¡Avanzaste a ${achievementTitle} (+${prestigeLevel * 15}% KC)!`;
+            msg += ``
         }
         if (usedShield) {

[NoCoverage] BlockStatement
controllers/roadmapController.ts:264:25
         if (prestigeUp) {
             msg += ` 👑 ¡Avanzaste a ${achievementTitle} (+${prestigeLevel * 15}% KC)!`;
         }
-        if (usedShield) {
-            msg += ` 🛡️ (¡Escudo de Racha activado! Tu racha fue salvada, escudos restantes: ${streakShields})`;
-        }
+        if (usedShield) {}
 
         return sendSuccess(res, {

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:264:13
         if (prestigeUp) {
             msg += ` 👑 ¡Avanzaste a ${achievementTitle} (+${prestigeLevel * 15}% KC)!`;
         }
-        if (usedShield) {
+        if (true) {
             msg += ` 🛡️ (¡Escudo de Racha activado! Tu racha fue salvada, escudos restantes: ${streakShields})`;
         }

[NoCoverage] BlockStatement
controllers/roadmapController.ts:280:21
             unlockedAchievement,
             message: msg
         });
-    } catch (error) {
-        console.error('[Roadmap] Error claiming daily reward:', error);
-        return sendError(res, 'Failed to claim daily reward', 'CLAIM_FAILED', 500);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/roadmapController.ts:281:23
             message: msg
         });
     } catch (error) {
-        console.error('[Roadmap] Error claiming daily reward:', error);
+        console.error("", error);
         return sendError(res, 'Failed to claim daily reward', 'CLAIM_FAILED', 500);
     }

[NoCoverage] BlockStatement
controllers/roadmapController.ts:286:80
     }
 };
 
-export const updateRoadmapAdminConfig = async (req: Request, res: Response) => {
-    try {
-        const days = req.body.days as RoadmapDayConfig[];
-        if (!Array.isArray(days)) {
-            return sendError(res, 'Days array required', 'INVALID_BODY', 400);
-        }
-
-        const { error } = await supabase
-            .from('monthly_roadmap_config')
-            .upsert(days);
-
-        if (error) {
-            console.error('[Roadmap Admin] Supabase error:', error);
-        }
-
-        return sendSuccess(res, { message: 'Configuración de Roadmap actualizada correctamente' });
-    } catch (error) {
-        console.error('[Roadmap Admin] Error updating config:', error);
-        return sendError(res, 'Failed to update roadmap config', 'UPDATE_FAILED', 500);
-    }
-};
+export const updateRoadmapAdminConfig = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/roadmapController.ts:287:9
 };
 
 export const updateRoadmapAdminConfig = async (req: Request, res: Response) => {
-    try {
-        const days = req.body.days as RoadmapDayConfig[];
-        if (!Array.isArray(days)) {
-            return sendError(res, 'Days array required', 'INVALID_BODY', 400);
-        }
-
-        const { error } = await supabase
-            .from('monthly_roadmap_config')
-            .upsert(days);
-
-        if (error) {
-            console.error('[Roadmap Admin] Supabase error:', error);
-        }
-
-        return sendSuccess(res, { message: 'Configuración de Roadmap actualizada correctamente' });
-    } catch (error) {
+    try {} catch (error) {
         console.error('[Roadmap Admin] Error updating config:', error);
         return sendError(res, 'Failed to update roadmap config', 'UPDATE_FAILED', 500);

[NoCoverage] BlockStatement
controllers/roadmapController.ts:289:35
 export const updateRoadmapAdminConfig = async (req: Request, res: Response) => {
     try {
         const days = req.body.days as RoadmapDayConfig[];
-        if (!Array.isArray(days)) {
-            return sendError(res, 'Days array required', 'INVALID_BODY', 400);
-        }
+        if (!Array.isArray(days)) {}
 
         const { error } = await supabase

[NoCoverage] ConditionalExpression
controllers/roadmapController.ts:289:13
 export const updateRoadmapAdminConfig = async (req: Request, res: Response) => {
     try {
         const days = req.body.days as RoadmapDayConfig[];
-        if (!Array.isArray(days)) {
+        if (true) {
             return sendError(res, 'Days array required', 'INVALID_BODY', 400);
         }

[NoCoverage] StringLiteral
controllers/roadmapController.ts:290:58
     try {
         const days = req.body.days as RoadmapDayConfig[];
         if (!Array.isArray(days)) {
-            return sendError(res, 'Days array required', 'INVALID_BODY', 400);
+            return sendError(res, 'Days array required', "", 400);
         }
 

[NoCoverage] ObjectLiteral
controllers/roadmapController.ts:301:33
             console.error('[Roadmap Admin] Supabase error:', error);
         }
 
-        return sendSuccess(res, { message: 'Configuración de Roadmap actualizada correctamente' });
+        return sendSuccess(res, {});
     } catch (error) {
         console.error('[Roadmap Admin] Error updating config:', error);

[NoCoverage] BlockStatement
controllers/roadmapController.ts:302:21
         }
 
         return sendSuccess(res, { message: 'Configuración de Roadmap actualizada correctamente' });
-    } catch (error) {
-        console.error('[Roadmap Admin] Error updating config:', error);
-        return sendError(res, 'Failed to update roadmap config', 'UPDATE_FAILED', 500);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/roadmapController.ts:303:23
 
         return sendSuccess(res, { message: 'Configuración de Roadmap actualizada correctamente' });
     } catch (error) {
-        console.error('[Roadmap Admin] Error updating config:', error);
+        console.error("", error);
         return sendError(res, 'Failed to update roadmap config', 'UPDATE_FAILED', 500);
     }
