[NoCoverage] BlockStatement
controllers/ruleController.ts:18:67
 
 const getErrorMessage = (error: unknown): string => {
     if (error instanceof Error) return error.message;
-    if (error && typeof error === 'object' && 'message' in error) {
-        return String((error as { message: unknown }).message);
-    }
+    if (error && typeof error === 'object' && 'message' in error) {}
     return String(error);
 };

[NoCoverage] BlockStatement
controllers/ruleController.ts:24:64
     return String(error);
 };
 
-export const getRules = async (req: Request, res: Response) => {
-    try {
-        const rules = await ruleService.getAllRules();
-        // Agrupar por categorías si el frontend lo prefiere plano o no.
-        // Lo mandamos plano y que el front decida cómo renderizar.
-        return sendSuccess(res, rules);
-    } catch (error) {
-        console.error("Error in getRules:", error);
-        const message = getErrorMessage(error);
-        if (message.includes('relation "public.server_rules" does not exist')) {
-            return sendSuccess(res, [], 'Rules table not created yet');
-        }
-        return sendError(res, message, 'FETCH_ERROR', 500, error);
-    }
-};
+export const getRules = async (req: Request, res: Response) => {};
 
 export const createRule = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/ruleController.ts:25:9
 };
 
 export const getRules = async (req: Request, res: Response) => {
-    try {
-        const rules = await ruleService.getAllRules();
-        // Agrupar por categorías si el frontend lo prefiere plano o no.
-        // Lo mandamos plano y que el front decida cómo renderizar.
-        return sendSuccess(res, rules);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in getRules:", error);
         const message = getErrorMessage(error);

[NoCoverage] BlockStatement
controllers/ruleController.ts:30:21
         // Agrupar por categorías si el frontend lo prefiere plano o no.
         // Lo mandamos plano y que el front decida cómo renderizar.
         return sendSuccess(res, rules);
-    } catch (error) {
-        console.error("Error in getRules:", error);
-        const message = getErrorMessage(error);
-        if (message.includes('relation "public.server_rules" does not exist')) {
-            return sendSuccess(res, [], 'Rules table not created yet');
-        }
-        return sendError(res, message, 'FETCH_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/ruleController.ts:31:23
         // Lo mandamos plano y que el front decida cómo renderizar.
         return sendSuccess(res, rules);
     } catch (error) {
-        console.error("Error in getRules:", error);
+        console.error("", error);
         const message = getErrorMessage(error);
         if (message.includes('relation "public.server_rules" does not exist')) {

[NoCoverage] BlockStatement
controllers/ruleController.ts:33:80
     } catch (error) {
         console.error("Error in getRules:", error);
         const message = getErrorMessage(error);
-        if (message.includes('relation "public.server_rules" does not exist')) {
-            return sendSuccess(res, [], 'Rules table not created yet');
-        }
+        if (message.includes('relation "public.server_rules" does not exist')) {}
         return sendError(res, message, 'FETCH_ERROR', 500, error);
     }

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:33:13
     } catch (error) {
         console.error("Error in getRules:", error);
         const message = getErrorMessage(error);
-        if (message.includes('relation "public.server_rules" does not exist')) {
+        if (true) {
             return sendSuccess(res, [], 'Rules table not created yet');
         }

[NoCoverage] ArrayDeclaration
controllers/ruleController.ts:34:37
         console.error("Error in getRules:", error);
         const message = getErrorMessage(error);
         if (message.includes('relation "public.server_rules" does not exist')) {
-            return sendSuccess(res, [], 'Rules table not created yet');
+            return sendSuccess(res, ["Stryker was here"], 'Rules table not created yet');
         }
         return sendError(res, message, 'FETCH_ERROR', 500, error);

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:44:13
     try {
         const { category, title, content, sort_order, title_en, content_en } = req.body;
 
-        if (!category || !title || !content) {
+        if (true) {
             return sendError(res, 'Missing required fields: category, title, content', 'MISSING_FIELDS', 400);
         }

[NoCoverage] BlockStatement
controllers/ruleController.ts:44:46
     try {
         const { category, title, content, sort_order, title_en, content_en } = req.body;
 
-        if (!category || !title || !content) {
-            return sendError(res, 'Missing required fields: category, title, content', 'MISSING_FIELDS', 400);
-        }
+        if (!category || !title || !content) {}
 
         // Auto translation

[NoCoverage] StringLiteral
controllers/ruleController.ts:45:88
         const { category, title, content, sort_order, title_en, content_en } = req.body;
 
         if (!category || !title || !content) {
-            return sendError(res, 'Missing required fields: category, title, content', 'MISSING_FIELDS', 400);
+            return sendError(res, 'Missing required fields: category, title, content', "", 400);
         }
 

[NoCoverage] BlockStatement
controllers/ruleController.ts:52:13
         let finalTitleEn = title_en;
         let finalContentEn = content_en;
 
-        try {
-            if (!finalTitleEn && title) {
-                finalTitleEn = await translateText(title, 'en');
-            }
-            if (!finalContentEn && content) {
-                finalContentEn = await translateText(content, 'en');
-            }
-        } catch (err) {
+        try {} catch (err) {
             console.error("Auto-translation failed:", err);
             // Fallback to original text or empty if everything fails

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:53:17
         let finalContentEn = content_en;
 
         try {
-            if (!finalTitleEn && title) {
+            if (true) {
                 finalTitleEn = await translateText(title, 'en');
             }

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:53:17
         let finalContentEn = content_en;
 
         try {
-            if (!finalTitleEn && title) {
+            if (false) {
                 finalTitleEn = await translateText(title, 'en');
             }

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:56:17
             if (!finalTitleEn && title) {
                 finalTitleEn = await translateText(title, 'en');
             }
-            if (!finalContentEn && content) {
+            if (false) {
                 finalContentEn = await translateText(content, 'en');
             }

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:56:17
             if (!finalTitleEn && title) {
                 finalTitleEn = await translateText(title, 'en');
             }
-            if (!finalContentEn && content) {
+            if (true) {
                 finalContentEn = await translateText(content, 'en');
             }

[NoCoverage] StringLiteral
controllers/ruleController.ts:57:63
                 finalTitleEn = await translateText(title, 'en');
             }
             if (!finalContentEn && content) {
-                finalContentEn = await translateText(content, 'en');
+                finalContentEn = await translateText(content, "");
             }
         } catch (err) {

[NoCoverage] BlockStatement
controllers/ruleController.ts:59:23
             if (!finalContentEn && content) {
                 finalContentEn = await translateText(content, 'en');
             }
-        } catch (err) {
-            console.error("Auto-translation failed:", err);
-            // Fallback to original text or empty if everything fails
-            finalTitleEn = finalTitleEn || title;
-            finalContentEn = finalContentEn || content;
-        }
+        } catch (err) {}
 
         const newRule = await ruleService.createRule({

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:62:28
         } catch (err) {
             console.error("Auto-translation failed:", err);
             // Fallback to original text or empty if everything fails
-            finalTitleEn = finalTitleEn || title;
+            finalTitleEn = false;
             finalContentEn = finalContentEn || content;
         }

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:62:28
         } catch (err) {
             console.error("Auto-translation failed:", err);
             // Fallback to original text or empty if everything fails
-            finalTitleEn = finalTitleEn || title;
+            finalTitleEn = true;
             finalContentEn = finalContentEn || content;
         }

[NoCoverage] LogicalOperator
controllers/ruleController.ts:63:30
             console.error("Auto-translation failed:", err);
             // Fallback to original text or empty if everything fails
             finalTitleEn = finalTitleEn || title;
-            finalContentEn = finalContentEn || content;
+            finalContentEn = finalContentEn && content;
         }
 

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:63:30
             console.error("Auto-translation failed:", err);
             // Fallback to original text or empty if everything fails
             finalTitleEn = finalTitleEn || title;
-            finalContentEn = finalContentEn || content;
+            finalContentEn = true;
         }
 

[NoCoverage] LogicalOperator
controllers/ruleController.ts:72:25
             title_en: finalTitleEn,
             content,
             content_en: finalContentEn,
-            sort_order: sort_order || 0
+            sort_order: sort_order && 0
         });
 

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:72:25
             title_en: finalTitleEn,
             content,
             content_en: finalContentEn,
-            sort_order: sort_order || 0
+            sort_order: false
         });
 

[NoCoverage] ObjectLiteral
controllers/ruleController.ts:77:30
 
         // Audit Log
         const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'CREATE_RULE',
-            details: `Created rule: ${title} (${category})`,
-            source: 'web'
-        }).catch(console.error);
+        logService.createLog({}).catch(console.error);
 
         return sendSuccess(res, newRule, 'Rule created successfully');

[NoCoverage] StringLiteral
controllers/ruleController.ts:82:21
             username: editor?.username || 'Admin',
             action: 'CREATE_RULE',
             details: `Created rule: ${title} (${category})`,
-            source: 'web'
+            source: ""
         }).catch(console.error);
 

[NoCoverage] BlockStatement
controllers/ruleController.ts:86:21
         }).catch(console.error);
 
         return sendSuccess(res, newRule, 'Rule created successfully');
-    } catch (error) {
-        console.error("Error in createRule:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'CREATE_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/ruleController.ts:94:9
 };
 
 export const updateRule = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const updates = req.body;
-
-        const updatedRule = await ruleService.updateRule(Number.parseInt(id, 10), {
-            category: updates.category,
-            title: updates.title,
-            title_en: updates.title_en,
-            content: updates.content,
-            content_en: updates.content_en,
-            sort_order: updates.sort_order
-        });
-
-        // Audit Log
-        const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'UPDATE_RULE',
-            details: `Updated rule #${id}: ${updatedRule.title}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, updatedRule, 'Rule updated successfully');
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in updateRule:", error);
         const message = getErrorMessage(error);

[NoCoverage] ConditionalExpression
controllers/ruleController.ts:111:23
         const editor = (req as AuthenticatedRequest).user;
         logService.createLog({
             user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
+            username: true,
             action: 'UPDATE_RULE',
             details: `Updated rule #${id}: ${updatedRule.title}`,

[NoCoverage] StringLiteral
controllers/ruleController.ts:112:21
         logService.createLog({
             user_id: editor?.id || undefined,
             username: editor?.username || 'Admin',
-            action: 'UPDATE_RULE',
+            action: "",
             details: `Updated rule #${id}: ${updatedRule.title}`,
             source: 'web'

[NoCoverage] BlockStatement
controllers/ruleController.ts:118:21
         }).catch(console.error);
 
         return sendSuccess(res, updatedRule, 'Rule updated successfully');
-    } catch (error) {
-        console.error("Error in updateRule:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'UPDATE_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/ruleController.ts:125:66
     }
 };
 
-export const deleteRule = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-
-        await ruleService.deleteRule(Number.parseInt(id, 10));
-
-        // Audit Log
-        const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'DELETE_RULE',
-            details: `Deleted rule #${id}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, null, 'Rule deleted successfully');
-    } catch (error) {
-        console.error("Error in deleteRule:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'DELETE_ERROR', 500, error);
-    }
-};
+export const deleteRule = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/ruleController.ts:126:9
 };
 
 export const deleteRule = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-
-        await ruleService.deleteRule(Number.parseInt(id, 10));
-
-        // Audit Log
-        const editor = (req as AuthenticatedRequest).user;
-        logService.createLog({
-            user_id: editor?.id || undefined,
-            username: editor?.username || 'Admin',
-            action: 'DELETE_RULE',
-            details: `Deleted rule #${id}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, null, 'Rule deleted successfully');
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in deleteRule:", error);
         const message = getErrorMessage(error);

[NoCoverage] BlockStatement
controllers/ruleController.ts:142:21
         }).catch(console.error);
 
         return sendSuccess(res, null, 'Rule deleted successfully');
-    } catch (error) {
-        console.error("Error in deleteRule:", error);
-        const message = getErrorMessage(error);
-        return sendError(res, message, 'DELETE_ERROR', 500, error);
-    }
+    } catch (error) {}
 };
 
