[Timeout] StringLiteral
controllers/settingsController.ts:11:5
 const PUBLIC_SETTINGS_WHITELIST = new Set([
     'maintenance_mode',
     'theme',
-    'hero_banners',
+    "",
     'hero_slides',
     'staff_cards',

[Timeout] StringLiteral
controllers/settingsController.ts:12:5
     'maintenance_mode',
     'theme',
     'hero_banners',
-    'hero_slides',
+    "",
     'staff_cards',
     'broadcasts',

[Timeout] StringLiteral
controllers/settingsController.ts:14:5
     'hero_banners',
     'hero_slides',
     'staff_cards',
-    'broadcasts',
+    "",
     'server_rules',
     'donors_list',

[Timeout] StringLiteral
controllers/settingsController.ts:15:5
     'hero_slides',
     'staff_cards',
     'broadcasts',
-    'server_rules',
+    "",
     'donors_list',
     'last_donors',

[Timeout] StringLiteral
controllers/settingsController.ts:16:5
     'staff_cards',
     'broadcasts',
     'server_rules',
-    'donors_list',
+    "",
     'last_donors',
     'medal_definitions',

[NoCoverage] BlockStatement
controllers/settingsController.ts:22:73
     'achievement_definitions'
 ]);
 
-const translateStaffCards = async (value: unknown): Promise<unknown> => {
-    try {
-        const cards = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(cards)) return value;
-        const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
-            ...card,
-            role_en: card.role ? await translateText(card.role, 'en').catch(() => card.role_en) : card.role_en,
-            description_en: card.description ? await translateText(card.description, 'en').catch(() => card.description_en) : card.description_en
-        })));
-        return JSON.stringify(translatedCards);
-    } catch (err) {
-        console.error("Error translating staff cards:", err);
-        return value;
-    }
-};
+const translateStaffCards = async (value: unknown): Promise<unknown> => {};
 
 const translateDonorsList = (value: unknown): unknown => {

[NoCoverage] BlockStatement
controllers/settingsController.ts:23:9
 ]);
 
 const translateStaffCards = async (value: unknown): Promise<unknown> => {
-    try {
-        const cards = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(cards)) return value;
-        const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
-            ...card,
-            role_en: card.role ? await translateText(card.role, 'en').catch(() => card.role_en) : card.role_en,
-            description_en: card.description ? await translateText(card.description, 'en').catch(() => card.description_en) : card.description_en
-        })));
-        return JSON.stringify(translatedCards);
-    } catch (err) {
+    try {} catch (err) {
         console.error("Error translating staff cards:", err);
         return value;

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:24:23
 
 const translateStaffCards = async (value: unknown): Promise<unknown> => {
     try {
-        const cards = typeof value === 'string' ? JSON.parse(value) : value;
+        const cards = true ? JSON.parse(value) : value;
         if (!Array.isArray(cards)) return value;
         const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:24:23
 
 const translateStaffCards = async (value: unknown): Promise<unknown> => {
     try {
-        const cards = typeof value === 'string' ? JSON.parse(value) : value;
+        const cards = false ? JSON.parse(value) : value;
         if (!Array.isArray(cards)) return value;
         const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:25:13
 const translateStaffCards = async (value: unknown): Promise<unknown> => {
     try {
         const cards = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(cards)) return value;
+        if (false) return value;
         const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
             ...card,

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:25:13
 const translateStaffCards = async (value: unknown): Promise<unknown> => {
     try {
         const cards = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(cards)) return value;
+        if (true) return value;
         const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
             ...card,

[NoCoverage] ArrowFunction
controllers/settingsController.ts:26:61
     try {
         const cards = typeof value === 'string' ? JSON.parse(value) : value;
         if (!Array.isArray(cards)) return value;
-        const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
-            ...card,
-            role_en: card.role ? await translateText(card.role, 'en').catch(() => card.role_en) : card.role_en,
-            description_en: card.description ? await translateText(card.description, 'en').catch(() => card.description_en) : card.description_en
-        })));
+        const translatedCards = await Promise.all(cards.map(() => undefined));
         return JSON.stringify(translatedCards);
     } catch (err) {

[NoCoverage] ObjectLiteral
controllers/settingsController.ts:26:162
     try {
         const cards = typeof value === 'string' ? JSON.parse(value) : value;
         if (!Array.isArray(cards)) return value;
-        const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
-            ...card,
-            role_en: card.role ? await translateText(card.role, 'en').catch(() => card.role_en) : card.role_en,
-            description_en: card.description ? await translateText(card.description, 'en').catch(() => card.description_en) : card.description_en
-        })));
+        const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({})));
         return JSON.stringify(translatedCards);
     } catch (err) {

[NoCoverage] ArrowFunction
controllers/settingsController.ts:28:77
         if (!Array.isArray(cards)) return value;
         const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
             ...card,
-            role_en: card.role ? await translateText(card.role, 'en').catch(() => card.role_en) : card.role_en,
+            role_en: card.role ? await translateText(card.role, 'en').catch(() => undefined) : card.role_en,
             description_en: card.description ? await translateText(card.description, 'en').catch(() => card.description_en) : card.description_en
         })));

[NoCoverage] ArrowFunction
controllers/settingsController.ts:29:98
         const translatedCards = await Promise.all(cards.map(async (card: { role?: string, role_en?: string, description?: string, description_en?: string }) => ({
             ...card,
             role_en: card.role ? await translateText(card.role, 'en').catch(() => card.role_en) : card.role_en,
-            description_en: card.description ? await translateText(card.description, 'en').catch(() => card.description_en) : card.description_en
+            description_en: card.description ? await translateText(card.description, 'en').catch(() => undefined) : card.description_en
         })));
         return JSON.stringify(translatedCards);

[NoCoverage] BlockStatement
controllers/settingsController.ts:32:19
             description_en: card.description ? await translateText(card.description, 'en').catch(() => card.description_en) : card.description_en
         })));
         return JSON.stringify(translatedCards);
-    } catch (err) {
-        console.error("Error translating staff cards:", err);
-        return value;
-    }
+    } catch (err) {}
 };
 

[NoCoverage] StringLiteral
controllers/settingsController.ts:33:23
         })));
         return JSON.stringify(translatedCards);
     } catch (err) {
-        console.error("Error translating staff cards:", err);
+        console.error("", err);
         return value;
     }

[NoCoverage] BlockStatement
controllers/settingsController.ts:38:58
     }
 };
 
-const translateDonorsList = (value: unknown): unknown => {
-    try {
-        const donors = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(donors)) return value;
-        const translatedDonors = donors.map((donor: { description?: string, description_en?: string }) => ({
-            ...donor,
-            description_en: donor.description_en
-        }));
-        return JSON.stringify(translatedDonors);
-    } catch (err) {
-        console.error("Error translating donors list:", err);
-        return value;
-    }
-};
+const translateDonorsList = (value: unknown): unknown => {};
 
 // Obtener todas las configuraciones

[NoCoverage] BlockStatement
controllers/settingsController.ts:39:9
 };
 
 const translateDonorsList = (value: unknown): unknown => {
-    try {
-        const donors = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(donors)) return value;
-        const translatedDonors = donors.map((donor: { description?: string, description_en?: string }) => ({
-            ...donor,
-            description_en: donor.description_en
-        }));
-        return JSON.stringify(translatedDonors);
-    } catch (err) {
+    try {} catch (err) {
         console.error("Error translating donors list:", err);
         return value;

[NoCoverage] EqualityOperator
controllers/settingsController.ts:40:24
 
 const translateDonorsList = (value: unknown): unknown => {
     try {
-        const donors = typeof value === 'string' ? JSON.parse(value) : value;
+        const donors = typeof value !== 'string' ? JSON.parse(value) : value;
         if (!Array.isArray(donors)) return value;
         const translatedDonors = donors.map((donor: { description?: string, description_en?: string }) => ({

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:40:24
 
 const translateDonorsList = (value: unknown): unknown => {
     try {
-        const donors = typeof value === 'string' ? JSON.parse(value) : value;
+        const donors = false ? JSON.parse(value) : value;
         if (!Array.isArray(donors)) return value;
         const translatedDonors = donors.map((donor: { description?: string, description_en?: string }) => ({

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:41:13
 const translateDonorsList = (value: unknown): unknown => {
     try {
         const donors = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(donors)) return value;
+        if (false) return value;
         const translatedDonors = donors.map((donor: { description?: string, description_en?: string }) => ({
             ...donor,

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:41:13
 const translateDonorsList = (value: unknown): unknown => {
     try {
         const donors = typeof value === 'string' ? JSON.parse(value) : value;
-        if (!Array.isArray(donors)) return value;
+        if (true) return value;
         const translatedDonors = donors.map((donor: { description?: string, description_en?: string }) => ({
             ...donor,

[NoCoverage] ArrowFunction
controllers/settingsController.ts:42:45
     try {
         const donors = typeof value === 'string' ? JSON.parse(value) : value;
         if (!Array.isArray(donors)) return value;
-        const translatedDonors = donors.map((donor: { description?: string, description_en?: string }) => ({
-            ...donor,
-            description_en: donor.description_en
-        }));
+        const translatedDonors = donors.map(() => undefined);
         return JSON.stringify(translatedDonors);
     } catch (err) {

[NoCoverage] BlockStatement
controllers/settingsController.ts:47:19
             description_en: donor.description_en
         }));
         return JSON.stringify(translatedDonors);
-    } catch (err) {
-        console.error("Error translating donors list:", err);
-        return value;
-    }
+    } catch (err) {}
 };
 

[NoCoverage] StringLiteral
controllers/settingsController.ts:57:19
 export const getSettings = async (req: Request, res: Response) => {
     try {
         const { data, error } = await supabase
-            .from('site_settings')
+            .from("")
             .select('*');
 

[NoCoverage] BlockStatement
controllers/settingsController.ts:60:20
             .from('site_settings')
             .select('*');
 
-        if (error) {
-            // Manejar caso de tabla no existente (PostgREST error code: PGRST116 or similar)
-            if (error.code === 'PGRST116' || error.message.includes('not found')) {
-                console.warn("[Settings] 'site_settings' table not found in Supabase.");
-                return res.json({});
-            }
-            throw error;
-        }
+        if (error) {}
 
         const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);

[NoCoverage] LogicalOperator
controllers/settingsController.ts:62:17
 
         if (error) {
             // Manejar caso de tabla no existente (PostgREST error code: PGRST116 or similar)
-            if (error.code === 'PGRST116' || error.message.includes('not found')) {
+            if (error.code === 'PGRST116' && error.message.includes('not found')) {
                 console.warn("[Settings] 'site_settings' table not found in Supabase.");
                 return res.json({});

[NoCoverage] BlockStatement
controllers/settingsController.ts:62:83
 
         if (error) {
             // Manejar caso de tabla no existente (PostgREST error code: PGRST116 or similar)
-            if (error.code === 'PGRST116' || error.message.includes('not found')) {
-                console.warn("[Settings] 'site_settings' table not found in Supabase.");
-                return res.json({});
-            }
+            if (error.code === 'PGRST116' || error.message.includes('not found')) {}
             throw error;
         }

[NoCoverage] StringLiteral
controllers/settingsController.ts:63:30
         if (error) {
             // Manejar caso de tabla no existente (PostgREST error code: PGRST116 or similar)
             if (error.code === 'PGRST116' || error.message.includes('not found')) {
-                console.warn("[Settings] 'site_settings' table not found in Supabase.");
+                console.warn("");
                 return res.json({});
             }

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:69:25
             throw error;
         }
 
-        const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
+        const isAdmin = false;
 
         // Convertir array a objeto y filtrar si no es admin

[NoCoverage] LogicalOperator
controllers/settingsController.ts:69:25
             throw error;
         }
 
-        const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
+        const isAdmin = req.user || ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
 
         // Convertir array a objeto y filtrar si no es admin

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:73:13
 
         // Convertir array a objeto y filtrar si no es admin
         const settings: Record<string, unknown> = {};
-        if (data) {
+        if (true) {
             data.forEach((item: { key: string, value: unknown }) => {
                 if (isAdmin || PUBLIC_SETTINGS_WHITELIST.has(item.key)) {

[NoCoverage] BlockStatement
controllers/settingsController.ts:73:19
 
         // Convertir array a objeto y filtrar si no es admin
         const settings: Record<string, unknown> = {};
-        if (data) {
-            data.forEach((item: { key: string, value: unknown }) => {
-                if (isAdmin || PUBLIC_SETTINGS_WHITELIST.has(item.key)) {
-                    settings[item.key] = item.value;
-                }
-            });
-        }
+        if (data) {}
 
         res.json(settings);

[NoCoverage] BlockStatement
controllers/settingsController.ts:74:69
         // Convertir array a objeto y filtrar si no es admin
         const settings: Record<string, unknown> = {};
         if (data) {
-            data.forEach((item: { key: string, value: unknown }) => {
-                if (isAdmin || PUBLIC_SETTINGS_WHITELIST.has(item.key)) {
-                    settings[item.key] = item.value;
-                }
-            });
+            data.forEach((item: { key: string, value: unknown }) => {});
         }
 

[NoCoverage] BlockStatement
controllers/settingsController.ts:75:73
         const settings: Record<string, unknown> = {};
         if (data) {
             data.forEach((item: { key: string, value: unknown }) => {
-                if (isAdmin || PUBLIC_SETTINGS_WHITELIST.has(item.key)) {
-                    settings[item.key] = item.value;
-                }
+                if (isAdmin || PUBLIC_SETTINGS_WHITELIST.has(item.key)) {}
             });
         }

[NoCoverage] LogicalOperator
controllers/settingsController.ts:75:21
         const settings: Record<string, unknown> = {};
         if (data) {
             data.forEach((item: { key: string, value: unknown }) => {
-                if (isAdmin || PUBLIC_SETTINGS_WHITELIST.has(item.key)) {
+                if (isAdmin && PUBLIC_SETTINGS_WHITELIST.has(item.key)) {
                     settings[item.key] = item.value;
                 }

[NoCoverage] BlockStatement
controllers/settingsController.ts:82:30
         }
 
         res.json(settings);
-    } catch (error: unknown) {
-        console.error("[Settings Controller CRITICAL 500]:", error);
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ 
-            error: "Internal Server Error loading settings",
-            details: message,
-            timestamp: new Date().toISOString()
-        });
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] StringLiteral
controllers/settingsController.ts:83:23
 
         res.json(settings);
     } catch (error: unknown) {
-        console.error("[Settings Controller CRITICAL 500]:", error);
+        console.error("", error);
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ 

[NoCoverage] ObjectLiteral
controllers/settingsController.ts:85:30
     } catch (error: unknown) {
         console.error("[Settings Controller CRITICAL 500]:", error);
         const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ 
-            error: "Internal Server Error loading settings",
-            details: message,
-            timestamp: new Date().toISOString()
-        });
+        res.status(500).json({});
     }
 };

[NoCoverage] BlockStatement
controllers/settingsController.ts:94:66
 };
 
 // Obtener una configuración específica
-export const getSetting = async (req: Request, res: Response) => {
-    try {
-        const key = ensureString(req.params.key);
-        const { data, error } = await supabase
-            .from('site_settings')
-            .select('*')
-            .eq('key', key)
-            .maybeSingle();
-
-        if (error) throw error;
-
-        const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
-
-        if (!data) return res.json(null);
-
-        if (!isAdmin && !PUBLIC_SETTINGS_WHITELIST.has(key)) {
-            return res.status(403).json({ error: 'Access denied' });
-        }
-
-        res.json(data);
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
-};
+export const getSetting = async (req: Request, res: Response) => {};
 
 // Actualizar una configuración

[NoCoverage] BlockStatement
controllers/settingsController.ts:95:9
 
 // Obtener una configuración específica
 export const getSetting = async (req: Request, res: Response) => {
-    try {
-        const key = ensureString(req.params.key);
-        const { data, error } = await supabase
-            .from('site_settings')
-            .select('*')
-            .eq('key', key)
-            .maybeSingle();
-
-        if (error) throw error;
-
-        const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
-
-        if (!data) return res.json(null);
-
-        if (!isAdmin && !PUBLIC_SETTINGS_WHITELIST.has(key)) {
-            return res.status(403).json({ error: 'Access denied' });
-        }
-
-        res.json(data);
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         const message = error instanceof Error ? error.message : String(error);
         res.status(500).json({ error: message });

[NoCoverage] StringLiteral
controllers/settingsController.ts:99:21
         const key = ensureString(req.params.key);
         const { data, error } = await supabase
             .from('site_settings')
-            .select('*')
+            .select("")
             .eq('key', key)
             .maybeSingle();

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:105:25
 
         if (error) throw error;
 
-        const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
+        const isAdmin = true;
 
         if (!data) return res.json(null);

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:107:13
 
         const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
 
-        if (!data) return res.json(null);
+        if (false) return res.json(null);
 
         if (!isAdmin && !PUBLIC_SETTINGS_WHITELIST.has(key)) {

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:107:13
 
         const isAdmin = req.user && ['admin', 'neroferno', 'killu', 'killuwu', 'developer'].includes(req.user.role);
 
-        if (!data) return res.json(null);
+        if (true) return res.json(null);
 
         if (!isAdmin && !PUBLIC_SETTINGS_WHITELIST.has(key)) {

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:109:13
 
         if (!data) return res.json(null);
 
-        if (!isAdmin && !PUBLIC_SETTINGS_WHITELIST.has(key)) {
+        if (false) {
             return res.status(403).json({ error: 'Access denied' });
         }

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:109:13
 
         if (!data) return res.json(null);
 
-        if (!isAdmin && !PUBLIC_SETTINGS_WHITELIST.has(key)) {
+        if (true) {
             return res.status(403).json({ error: 'Access denied' });
         }

[NoCoverage] StringLiteral
controllers/settingsController.ts:110:50
         if (!data) return res.json(null);
 
         if (!isAdmin && !PUBLIC_SETTINGS_WHITELIST.has(key)) {
-            return res.status(403).json({ error: 'Access denied' });
+            return res.status(403).json({ error: "" });
         }
 

[NoCoverage] BlockStatement
controllers/settingsController.ts:114:30
         }
 
         res.json(data);
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] BlockStatement
controllers/settingsController.ts:128:36
 
         let finalValue = value;
 
-        if (key === 'staff_cards') {
-            finalValue = await translateStaffCards(value);
-        } else if (key === 'donors_list') {
+        if (key === 'staff_cards') {} else if (key === 'donors_list') {
             finalValue = translateDonorsList(value);
         }

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:128:13
 
         let finalValue = value;
 
-        if (key === 'staff_cards') {
+        if (true) {
             finalValue = await translateStaffCards(value);
         } else if (key === 'donors_list') {

[NoCoverage] EqualityOperator
controllers/settingsController.ts:130:20
 
         if (key === 'staff_cards') {
             finalValue = await translateStaffCards(value);
-        } else if (key === 'donors_list') {
+        } else if (key !== 'donors_list') {
             finalValue = translateDonorsList(value);
         }

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:130:20
 
         if (key === 'staff_cards') {
             finalValue = await translateStaffCards(value);
-        } else if (key === 'donors_list') {
+        } else if (false) {
             finalValue = translateDonorsList(value);
         }

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:140:29
                 key,
                 value: finalValue, 
                 updated_at: new Date(),
-                updated_by: userId || null 
+                updated_by: true 
             })
             .select();

[NoCoverage] LogicalOperator
controllers/settingsController.ts:140:29
                 key,
                 value: finalValue, 
                 updated_at: new Date(),
-                updated_by: userId || null 
+                updated_by: userId && null 
             })
             .select();

[NoCoverage] ObjectLiteral
controllers/settingsController.ts:147:36
         if (error) throw error;
 
         // Log de auditoría
-        await logService.createLog({
-            user_id: userId || null,
-            username: username || 'Admin',
-            action: 'UPDATE_SETTING',
-            details: `Changed config '${key}' to '${value}'`,
-            source: 'web'
-        });
+        await logService.createLog({});
 
         res.json(data ? data[0] : null);

[NoCoverage] LogicalOperator
controllers/settingsController.ts:148:22
 
         // Log de auditoría
         await logService.createLog({
-            user_id: userId || null,
+            user_id: userId && null,
             username: username || 'Admin',
             action: 'UPDATE_SETTING',

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:148:22
 
         // Log de auditoría
         await logService.createLog({
-            user_id: userId || null,
+            user_id: true,
             username: username || 'Admin',
             action: 'UPDATE_SETTING',

[NoCoverage] ConditionalExpression
controllers/settingsController.ts:149:23
         // Log de auditoría
         await logService.createLog({
             user_id: userId || null,
-            username: username || 'Admin',
+            username: true,
             action: 'UPDATE_SETTING',
             details: `Changed config '${key}' to '${value}'`,

[NoCoverage] LogicalOperator
controllers/settingsController.ts:149:23
         // Log de auditoría
         await logService.createLog({
             user_id: userId || null,
-            username: username || 'Admin',
+            username: username && 'Admin',
             action: 'UPDATE_SETTING',
             details: `Changed config '${key}' to '${value}'`,

[NoCoverage] StringLiteral
controllers/settingsController.ts:151:22
             user_id: userId || null,
             username: username || 'Admin',
             action: 'UPDATE_SETTING',
-            details: `Changed config '${key}' to '${value}'`,
+            details: ``,
             source: 'web'
         });

[NoCoverage] BlockStatement
controllers/settingsController.ts:156:30
         });
 
         res.json(data ? data[0] : null);
-    } catch (error: unknown) {
-        const message = error instanceof Error ? error.message : String(error);
-        res.status(500).json({ error: message });
-    }
+    } catch (error: unknown) {}
 };
 
