[NoCoverage] BlockStatement
controllers/suggestionController.ts:7:9
 import { sendError } from '../utils/responseHandler.js';
 
 export const createSuggestion = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        const { type, message } = req.body;
-        const suggestionData = {
-            type,
-            message,
-            nickname: user?.username || 'Anónimo',
-            user_id: user?.id || undefined
-        };
-
-        const result = await suggestionService.createSuggestion(suggestionData);
-
-        if ('error' in result && result.error) {
-            res.status(400).json({
-                error: result.message,
-                isValid: false,
-                engine: result.engine
-            });
-            return;
-        }
-
-        res.status(201).json(result);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] LogicalOperator
controllers/suggestionController.ts:13:23
         const suggestionData = {
             type,
             message,
-            nickname: user?.username || 'Anónimo',
+            nickname: user?.username && 'Anónimo',
             user_id: user?.id || undefined
         };

[NoCoverage] OptionalChaining
controllers/suggestionController.ts:13:23
         const suggestionData = {
             type,
             message,
-            nickname: user?.username || 'Anónimo',
+            nickname: user.username || 'Anónimo',
             user_id: user?.id || undefined
         };

[NoCoverage] OptionalChaining
controllers/suggestionController.ts:14:22
             type,
             message,
             nickname: user?.username || 'Anónimo',
-            user_id: user?.id || undefined
+            user_id: user.id || undefined
         };
 

[NoCoverage] LogicalOperator
controllers/suggestionController.ts:14:22
             type,
             message,
             nickname: user?.username || 'Anónimo',
-            user_id: user?.id || undefined
+            user_id: user?.id && undefined
         };
 

[NoCoverage] ConditionalExpression
controllers/suggestionController.ts:19:13
 
         const result = await suggestionService.createSuggestion(suggestionData);
 
-        if ('error' in result && result.error) {
+        if (true) {
             res.status(400).json({
                 error: result.message,

[NoCoverage] BlockStatement
controllers/suggestionController.ts:19:48
 
         const result = await suggestionService.createSuggestion(suggestionData);
 
-        if ('error' in result && result.error) {
-            res.status(400).json({
-                error: result.message,
-                isValid: false,
-                engine: result.engine
-            });
-            return;
-        }
+        if ('error' in result && result.error) {}
 
         res.status(201).json(result);

[NoCoverage] BooleanLiteral
controllers/suggestionController.ts:22:26
         if ('error' in result && result.error) {
             res.status(400).json({
                 error: result.message,
-                isValid: false,
+                isValid: true,
                 engine: result.engine
             });

[NoCoverage] BlockStatement
controllers/suggestionController.ts:35:70
     }
 };
 
-export const getSuggestions = async (req: Request, res: Response) => {
-    try {
-        const data = await suggestionService.getSuggestions();
-        res.json(data);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const getSuggestions = async (req: Request, res: Response) => {};
 
 export const deleteSuggestion = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/suggestionController.ts:36:9
 };
 
 export const getSuggestions = async (req: Request, res: Response) => {
-    try {
-        const data = await suggestionService.getSuggestions();
-        res.json(data);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/suggestionController.ts:45:72
     }
 };
 
-export const deleteSuggestion = async (req: Request, res: Response) => {
-    try {
-        await suggestionService.deleteSuggestion(Number.parseInt(ensureString(req.params.id), 10));
-        res.json({ success: true });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const deleteSuggestion = async (req: Request, res: Response) => {};
 
 export const updateStatus = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/suggestionController.ts:46:9
 };
 
 export const deleteSuggestion = async (req: Request, res: Response) => {
-    try {
-        await suggestionService.deleteSuggestion(Number.parseInt(ensureString(req.params.id), 10));
-        res.json({ success: true });
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BooleanLiteral
controllers/suggestionController.ts:48:29
 export const deleteSuggestion = async (req: Request, res: Response) => {
     try {
         await suggestionService.deleteSuggestion(Number.parseInt(ensureString(req.params.id), 10));
-        res.json({ success: true });
+        res.json({ success: false });
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] ObjectLiteral
controllers/suggestionController.ts:48:18
 export const deleteSuggestion = async (req: Request, res: Response) => {
     try {
         await suggestionService.deleteSuggestion(Number.parseInt(ensureString(req.params.id), 10));
-        res.json({ success: true });
+        res.json({});
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/suggestionController.ts:49:21
     try {
         await suggestionService.deleteSuggestion(Number.parseInt(ensureString(req.params.id), 10));
         res.json({ success: true });
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/suggestionController.ts:55:68
     }
 };
 
-export const updateStatus = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const { status } = req.body;
-
-        if (!['pending', 'approved', 'rejected', 'implemented'].includes(status)) {
-            res.status(400).json({ error: 'Invalid status' });
-            return;
-        }
-
-        const result = await suggestionService.updateStatus(Number.parseInt(id, 10), status);
-        res.json(result);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const updateStatus = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/suggestionController.ts:56:9
 };
 
 export const updateStatus = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const { status } = req.body;
-
-        if (!['pending', 'approved', 'rejected', 'implemented'].includes(status)) {
-            res.status(400).json({ error: 'Invalid status' });
-            return;
-        }
-
-        const result = await suggestionService.updateStatus(Number.parseInt(id, 10), status);
-        res.json(result);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] ConditionalExpression
controllers/suggestionController.ts:60:13
         const id = ensureString(req.params.id);
         const { status } = req.body;
 
-        if (!['pending', 'approved', 'rejected', 'implemented'].includes(status)) {
+        if (true) {
             res.status(400).json({ error: 'Invalid status' });
             return;

[NoCoverage] BooleanLiteral
controllers/suggestionController.ts:60:13
         const id = ensureString(req.params.id);
         const { status } = req.body;
 
-        if (!['pending', 'approved', 'rejected', 'implemented'].includes(status)) {
+        if (['pending', 'approved', 'rejected', 'implemented'].includes(status)) {
             res.status(400).json({ error: 'Invalid status' });
             return;

[NoCoverage] StringLiteral
controllers/suggestionController.ts:61:43
         const { status } = req.body;
 
         if (!['pending', 'approved', 'rejected', 'implemented'].includes(status)) {
-            res.status(400).json({ error: 'Invalid status' });
+            res.status(400).json({ error: "" });
             return;
         }

[NoCoverage] ObjectLiteral
controllers/suggestionController.ts:61:34
         const { status } = req.body;
 
         if (!['pending', 'approved', 'rejected', 'implemented'].includes(status)) {
-            res.status(400).json({ error: 'Invalid status' });
+            res.status(400).json({});
             return;
         }

[NoCoverage] BlockStatement
controllers/suggestionController.ts:67:21
 
         const result = await suggestionService.updateStatus(Number.parseInt(id, 10), status);
         res.json(result);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 
