[NoCoverage] BlockStatement
controllers/ticketController.ts:19:42
     };
 }
 
-const getLogUsername = (req: Request) => {
-    const user = (req as AuthenticatedRequest).user;
-    return user?.username || user?.email || 'Unknown';
-};
+const getLogUsername = (req: Request) => {};
 
 // Admin: Get all tickets

[NoCoverage] LogicalOperator
controllers/ticketController.ts:21:12
 
 const getLogUsername = (req: Request) => {
     const user = (req as AuthenticatedRequest).user;
-    return user?.username || user?.email || 'Unknown';
+    return user?.username && user?.email || 'Unknown';
 };
 

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:21:12
 
 const getLogUsername = (req: Request) => {
     const user = (req as AuthenticatedRequest).user;
-    return user?.username || user?.email || 'Unknown';
+    return false;
 };
 

[NoCoverage] BlockStatement
controllers/ticketController.ts:25:69
 };
 
 // Admin: Get all tickets
-export const getAllTickets = async (req: Request, res: Response) => {
-    try {
-        const tickets = await ticketService.getAllTickets();
-        return sendSuccess(res, tickets);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const getAllTickets = async (req: Request, res: Response) => {};
 
 // User: Create ticket

[NoCoverage] BlockStatement
controllers/ticketController.ts:26:9
 
 // Admin: Get all tickets
 export const getAllTickets = async (req: Request, res: Response) => {
-    try {
-        const tickets = await ticketService.getAllTickets();
-        return sendSuccess(res, tickets);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/ticketController.ts:29:21
     try {
         const tickets = await ticketService.getAllTickets();
         return sendSuccess(res, tickets);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/ticketController.ts:36:68
 };
 
 // User: Create ticket
-export const createTicket = async (req: Request, res: Response) => {
-    try {
-        const { subject, description, priority } = req.body;
-        const user = (req as AuthenticatedRequest).user!;
-
-        if (!subject) {
-            return sendError(res, 'Missing subject', 'MISSING_FIELD', 400);
-        }
-
-        const ticket = await ticketService.createTicket(user.id, { subject, description, priority });
-        
-        // Log
-        logService.createLog({
-            username: getLogUsername(req),
-            action: 'CREATE_TICKET',
-            details: `Ticket #${ticket.id}: ${subject}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, ticket, 'Ticket created successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const createTicket = async (req: Request, res: Response) => {};
 
 // Admin/User: Update Status

[NoCoverage] BlockStatement
controllers/ticketController.ts:37:9
 
 // User: Create ticket
 export const createTicket = async (req: Request, res: Response) => {
-    try {
-        const { subject, description, priority } = req.body;
-        const user = (req as AuthenticatedRequest).user!;
-
-        if (!subject) {
-            return sendError(res, 'Missing subject', 'MISSING_FIELD', 400);
-        }
-
-        const ticket = await ticketService.createTicket(user.id, { subject, description, priority });
-        
-        // Log
-        logService.createLog({
-            username: getLogUsername(req),
-            action: 'CREATE_TICKET',
-            details: `Ticket #${ticket.id}: ${subject}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, ticket, 'Ticket created successfully');
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/ticketController.ts:41:23
         const { subject, description, priority } = req.body;
         const user = (req as AuthenticatedRequest).user!;
 
-        if (!subject) {
-            return sendError(res, 'Missing subject', 'MISSING_FIELD', 400);
-        }
+        if (!subject) {}
 
         const ticket = await ticketService.createTicket(user.id, { subject, description, priority });

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:41:13
         const { subject, description, priority } = req.body;
         const user = (req as AuthenticatedRequest).user!;
 
-        if (!subject) {
+        if (false) {
             return sendError(res, 'Missing subject', 'MISSING_FIELD', 400);
         }

[NoCoverage] ObjectLiteral
controllers/ticketController.ts:48:30
         const ticket = await ticketService.createTicket(user.id, { subject, description, priority });
         
         // Log
-        logService.createLog({
-            username: getLogUsername(req),
-            action: 'CREATE_TICKET',
-            details: `Ticket #${ticket.id}: ${subject}`,
-            source: 'web'
-        }).catch(console.error);
+        logService.createLog({}).catch(console.error);
 
         return sendSuccess(res, ticket, 'Ticket created successfully');

[NoCoverage] BlockStatement
controllers/ticketController.ts:56:21
         }).catch(console.error);
 
         return sendSuccess(res, ticket, 'Ticket created successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/ticketController.ts:72:13
 
         // 1. Fetch ticket to check ownership
         const ticketInfo = await ticketService.getTicketById(ticketId);
-        if (!ticketInfo) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
+        if (ticketInfo) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Permission check: Owner can close, Staff can do anything

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:72:13
 
         // 1. Fetch ticket to check ownership
         const ticketInfo = await ticketService.getTicketById(ticketId);
-        if (!ticketInfo) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
+        if (false) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Permission check: Owner can close, Staff can do anything

[NoCoverage] EqualityOperator
controllers/ticketController.ts:75:25
         if (!ticketInfo) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Permission check: Owner can close, Staff can do anything
-        const isOwner = ticketInfo.user_id === user.id;
+        const isOwner = ticketInfo.user_id !== user.id;
         const isStaff = STAFF_ROLES.includes(user.role);
 

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:75:25
         if (!ticketInfo) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Permission check: Owner can close, Staff can do anything
-        const isOwner = ticketInfo.user_id === user.id;
+        const isOwner = true;
         const isStaff = STAFF_ROLES.includes(user.role);
 

[NoCoverage] BooleanLiteral
controllers/ticketController.ts:78:13
         const isOwner = ticketInfo.user_id === user.id;
         const isStaff = STAFF_ROLES.includes(user.role);
 
-        if (!isOwner && !isStaff) {
+        if (isOwner && !isStaff) {
             return res.status(403).json({ error: 'You do not have permission to update this ticket' });
         }

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:78:13
         const isOwner = ticketInfo.user_id === user.id;
         const isStaff = STAFF_ROLES.includes(user.role);
 
-        if (!isOwner && !isStaff) {
+        if (false) {
             return res.status(403).json({ error: 'You do not have permission to update this ticket' });
         }

[NoCoverage] ObjectLiteral
controllers/ticketController.ts:79:41
         const isStaff = STAFF_ROLES.includes(user.role);
 
         if (!isOwner && !isStaff) {
-            return res.status(403).json({ error: 'You do not have permission to update this ticket' });
+            return res.status(403).json({});
         }
 

[NoCoverage] StringLiteral
controllers/ticketController.ts:89:22
         logService.createLog({
             username: username,
             action: 'UPDATE_STATUS',
-            details: `Ticket #${id} status changed to ${status}`,
+            details: ``,
             source: 'web'
         }).catch(console.error);

[NoCoverage] BlockStatement
controllers/ticketController.ts:94:21
         }).catch(console.error);
 
         return sendSuccess(res, ticket, 'Ticket status updated');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/ticketController.ts:101:64
 };
 
 // Get Stats
-export const getStats = async (req: Request, res: Response) => {
-    try {
-        const stats = await ticketService.getTicketStats();
-        return sendSuccess(res, stats);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const getStats = async (req: Request, res: Response) => {};
 
 // Get Messages

[NoCoverage] BlockStatement
controllers/ticketController.ts:102:9
 
 // Get Stats
 export const getStats = async (req: Request, res: Response) => {
-    try {
-        const stats = await ticketService.getTicketStats();
-        return sendSuccess(res, stats);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/ticketController.ts:105:21
     try {
         const stats = await ticketService.getTicketStats();
         return sendSuccess(res, stats);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/ticketController.ts:112:67
 };
 
 // Get Messages
-export const getMessages = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const ticketId = parseInt(id);
-        const user = (req as AuthenticatedRequest).user!;
-
-        // 1. Fetch ticket to check ownership
-        const ticket = await ticketService.getTicketById(ticketId);
-        if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
-
-        // 2. Check Permissions: User must own the ticket OR be staff
-        const isOwner = ticket.user_id === user.id;
-        const hasStaffRole = STAFF_ROLES.includes(user.role);
-
-        if (!isOwner && !hasStaffRole) {
-            return res.status(403).json({ error: 'You do not have permission to view this ticket' });
-        }
-
-        const messages = await ticketService.getTicketMessages(ticketId);
-        return sendSuccess(res, messages);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const getMessages = async (req: Request, res: Response) => {};
 
 // Add Message

[NoCoverage] BlockStatement
controllers/ticketController.ts:113:9
 
 // Get Messages
 export const getMessages = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const ticketId = parseInt(id);
-        const user = (req as AuthenticatedRequest).user!;
-
-        // 1. Fetch ticket to check ownership
-        const ticket = await ticketService.getTicketById(ticketId);
-        if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
-
-        // 2. Check Permissions: User must own the ticket OR be staff
-        const isOwner = ticket.user_id === user.id;
-        const hasStaffRole = STAFF_ROLES.includes(user.role);
-
-        if (!isOwner && !hasStaffRole) {
-            return res.status(403).json({ error: 'You do not have permission to view this ticket' });
-        }
-
-        const messages = await ticketService.getTicketMessages(ticketId);
-        return sendSuccess(res, messages);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:120:13
 
         // 1. Fetch ticket to check ownership
         const ticket = await ticketService.getTicketById(ticketId);
-        if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
+        if (false) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Check Permissions: User must own the ticket OR be staff

[NoCoverage] BooleanLiteral
controllers/ticketController.ts:120:13
 
         // 1. Fetch ticket to check ownership
         const ticket = await ticketService.getTicketById(ticketId);
-        if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
+        if (ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Check Permissions: User must own the ticket OR be staff

[NoCoverage] EqualityOperator
controllers/ticketController.ts:123:25
         if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Check Permissions: User must own the ticket OR be staff
-        const isOwner = ticket.user_id === user.id;
+        const isOwner = ticket.user_id !== user.id;
         const hasStaffRole = STAFF_ROLES.includes(user.role);
 

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:123:25
         if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Check Permissions: User must own the ticket OR be staff
-        const isOwner = ticket.user_id === user.id;
+        const isOwner = false;
         const hasStaffRole = STAFF_ROLES.includes(user.role);
 

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:126:13
         const isOwner = ticket.user_id === user.id;
         const hasStaffRole = STAFF_ROLES.includes(user.role);
 
-        if (!isOwner && !hasStaffRole) {
+        if (true) {
             return res.status(403).json({ error: 'You do not have permission to view this ticket' });
         }

[NoCoverage] LogicalOperator
controllers/ticketController.ts:126:13
         const isOwner = ticket.user_id === user.id;
         const hasStaffRole = STAFF_ROLES.includes(user.role);
 
-        if (!isOwner && !hasStaffRole) {
+        if (!isOwner || !hasStaffRole) {
             return res.status(403).json({ error: 'You do not have permission to view this ticket' });
         }

[NoCoverage] BlockStatement
controllers/ticketController.ts:132:21
 
         const messages = await ticketService.getTicketMessages(ticketId);
         return sendSuccess(res, messages);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/ticketController.ts:140:9
 
 // Add Message
 export const addMessage = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const { message } = req.body; // Remove user_id and is_staff from body for security
-        const ticketId = parseInt(id);
-        const user = (req as AuthenticatedRequest).user!;
-
-        if (!message) return sendError(res, "Message is required", 'MISSING_FIELD', 400);
-
-        // 1. Fetch ticket to check ownership
-        const ticket = await ticketService.getTicketById(ticketId);
-        if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
-
-        // 2. Permission check: Only owner or staff can reply
-        const isOwner = ticket.user_id === user.id;
-        const isStaff = STAFF_ROLES.includes(user.role);
-
-        if (!isOwner && !isStaff) {
-            return res.status(403).json({ error: 'You do not have permission to post messages in this ticket' });
-        }
-
-        // 3. Post with server-verified IDs
-        const newMessage = await ticketService.addTicketMessage(ticketId, user.id, message, isStaff);
-        return sendSuccess(res, newMessage, 'Message added');
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BooleanLiteral
controllers/ticketController.ts:146:13
         const ticketId = parseInt(id);
         const user = (req as AuthenticatedRequest).user!;
 
-        if (!message) return sendError(res, "Message is required", 'MISSING_FIELD', 400);
+        if (message) return sendError(res, "Message is required", 'MISSING_FIELD', 400);
 
         // 1. Fetch ticket to check ownership

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:146:13
         const ticketId = parseInt(id);
         const user = (req as AuthenticatedRequest).user!;
 
-        if (!message) return sendError(res, "Message is required", 'MISSING_FIELD', 400);
+        if (false) return sendError(res, "Message is required", 'MISSING_FIELD', 400);
 
         // 1. Fetch ticket to check ownership

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:150:13
 
         // 1. Fetch ticket to check ownership
         const ticket = await ticketService.getTicketById(ticketId);
-        if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
+        if (true) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Permission check: Only owner or staff can reply

[NoCoverage] EqualityOperator
controllers/ticketController.ts:153:25
         if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Permission check: Only owner or staff can reply
-        const isOwner = ticket.user_id === user.id;
+        const isOwner = ticket.user_id !== user.id;
         const isStaff = STAFF_ROLES.includes(user.role);
 

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:153:25
         if (!ticket) return sendError(res, 'Ticket not found', 'NOT_FOUND', 404);
 
         // 2. Permission check: Only owner or staff can reply
-        const isOwner = ticket.user_id === user.id;
+        const isOwner = false;
         const isStaff = STAFF_ROLES.includes(user.role);
 

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:156:13
         const isOwner = ticket.user_id === user.id;
         const isStaff = STAFF_ROLES.includes(user.role);
 
-        if (!isOwner && !isStaff) {
+        if (true) {
             return res.status(403).json({ error: 'You do not have permission to post messages in this ticket' });
         }

[NoCoverage] BooleanLiteral
controllers/ticketController.ts:156:25
         const isOwner = ticket.user_id === user.id;
         const isStaff = STAFF_ROLES.includes(user.role);
 
-        if (!isOwner && !isStaff) {
+        if (!isOwner && isStaff) {
             return res.status(403).json({ error: 'You do not have permission to post messages in this ticket' });
         }

[NoCoverage] StringLiteral
controllers/ticketController.ts:157:50
         const isStaff = STAFF_ROLES.includes(user.role);
 
         if (!isOwner && !isStaff) {
-            return res.status(403).json({ error: 'You do not have permission to post messages in this ticket' });
+            return res.status(403).json({ error: "" });
         }
 

[NoCoverage] StringLiteral
controllers/ticketController.ts:162:45
 
         // 3. Post with server-verified IDs
         const newMessage = await ticketService.addTicketMessage(ticketId, user.id, message, isStaff);
-        return sendSuccess(res, newMessage, 'Message added');
+        return sendSuccess(res, newMessage, "");
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/ticketController.ts:163:21
         // 3. Post with server-verified IDs
         const newMessage = await ticketService.addTicketMessage(ticketId, user.id, message, isStaff);
         return sendSuccess(res, newMessage, 'Message added');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/ticketController.ts:172:13
 export const banUser = async (req: Request, res: Response) => {
     try {
         const { username, reason } = req.body;
-        if (!username) return sendError(res, 'Username required', 'MISSING_FIELD', 400);
+        if (username) return sendError(res, 'Username required', 'MISSING_FIELD', 400);
 
         // Sanitize reason: strip anything that could act as a command separator or

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:172:13
 export const banUser = async (req: Request, res: Response) => {
     try {
         const { username, reason } = req.body;
-        if (!username) return sendError(res, 'Username required', 'MISSING_FIELD', 400);
+        if (false) return sendError(res, 'Username required', 'MISSING_FIELD', 400);
 
         // Sanitize reason: strip anything that could act as a command separator or

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:177:40
         // Sanitize reason: strip anything that could act as a command separator or
         // control char in the Minecraft console (; & | ` \ and CRLF). Prevents
         // command chaining via the ban reason (e.g. "x;op attacker").
-        const sanitizedReason = String(reason || 'Banned via Web Panel')
+        const sanitizedReason = String(false)
             // eslint-disable-next-line no-control-regex -- intentionally stripping control chars
             .replace(/[;&|`\\\r\n\x00-\x1F]/g, '')

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:177:40
         // Sanitize reason: strip anything that could act as a command separator or
         // control char in the Minecraft console (; & | ` \ and CRLF). Prevents
         // command chaining via the ban reason (e.g. "x;op attacker").
-        const sanitizedReason = String(reason || 'Banned via Web Panel')
+        const sanitizedReason = String(true)
             // eslint-disable-next-line no-control-regex -- intentionally stripping control chars
             .replace(/[;&|`\\\r\n\x00-\x1F]/g, '')

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:184:13
 
         // Validate the username again to ensure it conforms to Minecraft username pattern
         const usernameRegex = /^[A-Za-z0-9_]{3,16}$/;
-        if (!usernameRegex.test(username)) {
+        if (true) {
             return sendError(res, 'Invalid Minecraft username', 'INVALID_FIELD', 400);
         }

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:184:13
 
         // Validate the username again to ensure it conforms to Minecraft username pattern
         const usernameRegex = /^[A-Za-z0-9_]{3,16}$/;
-        if (!usernameRegex.test(username)) {
+        if (false) {
             return sendError(res, 'Invalid Minecraft username', 'INVALID_FIELD', 400);
         }

[NoCoverage] BlockStatement
controllers/ticketController.ts:191:29
         const cmd = `ban ${username} ${sanitizedReason}`;
         const result = await commandService.queueCommand(cmd);
 
-        if (result.success) {
-            logService.createLog({
-                username: getLogUsername(req),
-                action: 'BAN_USER',
-                details: `Banned user ${username}. Reason: ${sanitizedReason}`,
-                source: 'web'
-            }).catch(console.error);
-
-            return sendSuccess(res, { command: cmd }, `User ${username} banned successfully`);
-        } else {
+        if (result.success) {} else {
             return sendError(res, result.error || 'Bridge Error', 'BRIDGE_FAILED');
         }

[NoCoverage] ObjectLiteral
controllers/ticketController.ts:192:34
         const result = await commandService.queueCommand(cmd);
 
         if (result.success) {
-            logService.createLog({
-                username: getLogUsername(req),
-                action: 'BAN_USER',
-                details: `Banned user ${username}. Reason: ${sanitizedReason}`,
-                source: 'web'
-            }).catch(console.error);
+            logService.createLog({}).catch(console.error);
 
             return sendSuccess(res, { command: cmd }, `User ${username} banned successfully`);

[NoCoverage] StringLiteral
controllers/ticketController.ts:194:25
         if (result.success) {
             logService.createLog({
                 username: getLogUsername(req),
-                action: 'BAN_USER',
+                action: "",
                 details: `Banned user ${username}. Reason: ${sanitizedReason}`,
                 source: 'web'

[NoCoverage] StringLiteral
controllers/ticketController.ts:195:26
             logService.createLog({
                 username: getLogUsername(req),
                 action: 'BAN_USER',
-                details: `Banned user ${username}. Reason: ${sanitizedReason}`,
+                details: ``,
                 source: 'web'
             }).catch(console.error);

[NoCoverage] StringLiteral
controllers/ticketController.ts:199:55
                 source: 'web'
             }).catch(console.error);
 
-            return sendSuccess(res, { command: cmd }, `User ${username} banned successfully`);
+            return sendSuccess(res, { command: cmd }, ``);
         } else {
             return sendError(res, result.error || 'Bridge Error', 'BRIDGE_FAILED');

[NoCoverage] ObjectLiteral
controllers/ticketController.ts:199:37
                 source: 'web'
             }).catch(console.error);
 
-            return sendSuccess(res, { command: cmd }, `User ${username} banned successfully`);
+            return sendSuccess(res, {}, `User ${username} banned successfully`);
         } else {
             return sendError(res, result.error || 'Bridge Error', 'BRIDGE_FAILED');

[NoCoverage] BlockStatement
controllers/ticketController.ts:200:16
             }).catch(console.error);
 
             return sendSuccess(res, { command: cmd }, `User ${username} banned successfully`);
-        } else {
-            return sendError(res, result.error || 'Bridge Error', 'BRIDGE_FAILED');
-        }
+        } else {}
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:201:35
 
             return sendSuccess(res, { command: cmd }, `User ${username} banned successfully`);
         } else {
-            return sendError(res, result.error || 'Bridge Error', 'BRIDGE_FAILED');
+            return sendError(res, true, 'BRIDGE_FAILED');
         }
     } catch (error) {

[NoCoverage] ConditionalExpression
controllers/ticketController.ts:201:35
 
             return sendSuccess(res, { command: cmd }, `User ${username} banned successfully`);
         } else {
-            return sendError(res, result.error || 'Bridge Error', 'BRIDGE_FAILED');
+            return sendError(res, false, 'BRIDGE_FAILED');
         }
     } catch (error) {

[NoCoverage] BlockStatement
controllers/ticketController.ts:203:21
         } else {
             return sendError(res, result.error || 'Bridge Error', 'BRIDGE_FAILED');
         }
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/ticketController.ts:209:68
     }
 };
 
-export const deleteTicket = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        await ticketService.deleteTicket(parseInt(id));
-
-        logService.createLog({
-            username: getLogUsername(req),
-            action: 'DELETE_TICKET',
-            details: `Deleted ticket #${id}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, null, "Ticket deleted successfully");
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const deleteTicket = async (req: Request, res: Response) => {};
 
