[NoCoverage] BlockStatement
controllers/ticketController.ts:210:9
 };
 
 export const deleteTicket = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        await ticketService.deleteTicket(parseInt(id));
-
-        logService.createLog({
-            username: getLogUsername(req),
-            action: 'DELETE_TICKET',
-            details: `Deleted ticket #${id}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, null, "Ticket deleted successfully");
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] StringLiteral
controllers/ticketController.ts:216:21
 
         logService.createLog({
             username: getLogUsername(req),
-            action: 'DELETE_TICKET',
+            action: "",
             details: `Deleted ticket #${id}`,
             source: 'web'

[NoCoverage] BlockStatement
controllers/ticketController.ts:222:21
         }).catch(console.error);
 
         return sendSuccess(res, null, "Ticket deleted successfully");
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 
