[NoCoverage] BlockStatement
controllers/userController.ts:12:67
 import supabase from '../config/supabaseClient.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getAllUsers = async (req: Request, res: Response) => {
-    try {
-        const search = ensureString(req.query.search);
-        const users = await userService.getAllUsers(search);
-        return sendSuccess(res, users, 'Users listed successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const getAllUsers = async (req: Request, res: Response) => {};
 
 export const updateUserRole = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/userController.ts:13:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getAllUsers = async (req: Request, res: Response) => {
-    try {
-        const search = ensureString(req.query.search);
-        const users = await userService.getAllUsers(search);
-        return sendSuccess(res, users, 'Users listed successfully');
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/userController.ts:17:21
         const search = ensureString(req.query.search);
         const users = await userService.getAllUsers(search);
         return sendSuccess(res, users, 'Users listed successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ConditionalExpression
controllers/userController.ts:28:13
         const id = ensureString(req.params.id);
         const { role } = req.body;
         
-        if (!role) return sendError(res, 'Role is required', 'MISSING_FIELD', 400);
+        if (true) return sendError(res, 'Role is required', 'MISSING_FIELD', 400);
 
         // Security: Role Hierarchy Check

[NoCoverage] ConditionalExpression
controllers/userController.ts:28:13
         const id = ensureString(req.params.id);
         const { role } = req.body;
         
-        if (!role) return sendError(res, 'Role is required', 'MISSING_FIELD', 400);
+        if (false) return sendError(res, 'Role is required', 'MISSING_FIELD', 400);
 
         // Security: Role Hierarchy Check

[NoCoverage] OptionalChaining
controllers/userController.ts:32:31
 
         // Security: Role Hierarchy Check
         // 1. Check if requester has authority
-        const requestorRole = (req as Request & { user?: { role: string } }).user?.role;
+        const requestorRole = (req as Request & {
+  user?: {
+    role: string;
+  };
+}).user.role;
         const requestorPriority = getRolePriority(requestorRole);
         const newRolePriority = getRolePriority(role);

[NoCoverage] ConditionalExpression
controllers/userController.ts:36:13
         const requestorPriority = getRolePriority(requestorRole);
         const newRolePriority = getRolePriority(role);
 
-        if (newRolePriority > requestorPriority) {
+        if (true) {
             return sendError(res, 'No tienes permiso para asignar un rango superior al tuyo', 'FORBIDDEN', 403);
         }

[NoCoverage] ConditionalExpression
controllers/userController.ts:36:13
         const requestorPriority = getRolePriority(requestorRole);
         const newRolePriority = getRolePriority(role);
 
-        if (newRolePriority > requestorPriority) {
+        if (false) {
             return sendError(res, 'No tienes permiso para asignar un rango superior al tuyo', 'FORBIDDEN', 403);
         }

[NoCoverage] ConditionalExpression
controllers/userController.ts:44:13
         // We need to fetch the target user currently to check their role
         const { data: { user: targetUser }, error: fetchError } = await supabase.auth.admin.getUserById(id);
         
-        if (fetchError || !targetUser) {
+        if (true) {
              return sendError(res, 'Usuario objetivo no encontrado', 'NOT_FOUND', 404);
         }

[NoCoverage] LogicalOperator
controllers/userController.ts:44:13
         // We need to fetch the target user currently to check their role
         const { data: { user: targetUser }, error: fetchError } = await supabase.auth.admin.getUserById(id);
         
-        if (fetchError || !targetUser) {
+        if (fetchError && !targetUser) {
              return sendError(res, 'Usuario objetivo no encontrado', 'NOT_FOUND', 404);
         }

[NoCoverage] StringLiteral
controllers/userController.ts:45:36
         const { data: { user: targetUser }, error: fetchError } = await supabase.auth.admin.getUserById(id);
         
         if (fetchError || !targetUser) {
-             return sendError(res, 'Usuario objetivo no encontrado', 'NOT_FOUND', 404);
+             return sendError(res, "", 'NOT_FOUND', 404);
         }
 

[NoCoverage] OptionalChaining
controllers/userController.ts:48:48
              return sendError(res, 'Usuario objetivo no encontrado', 'NOT_FOUND', 404);
         }
 
-        const targetPriority = getRolePriority(targetUser.user_metadata?.role);
+        const targetPriority = getRolePriority(targetUser.user_metadata.role);
 
         // Allow SuperAdmins (100) to edit anyone (even other 100s, usually acceptable, or block equals? 

[NoCoverage] ConditionalExpression
controllers/userController.ts:54:52
         // User request: "Staff no puedan cambiarse a un rango superior". 
         // We block if target >= requestor AND requestor < 100.
         // This allows 'killuwu' (100) to edit 'neroferno' (100), but blocks 'developer' (90) from editing 'developer' (90).
-        if (targetPriority >= requestorPriority && requestorPriority < 100) {
+        if (targetPriority >= requestorPriority && true) {
             return sendError(res, 'No puedes modificar a un usuario con igual o mayor autoridad', 'FORBIDDEN', 403);
         }

[NoCoverage] ConditionalExpression
controllers/userController.ts:54:13
         // User request: "Staff no puedan cambiarse a un rango superior". 
         // We block if target >= requestor AND requestor < 100.
         // This allows 'killuwu' (100) to edit 'neroferno' (100), but blocks 'developer' (90) from editing 'developer' (90).
-        if (targetPriority >= requestorPriority && requestorPriority < 100) {
+        if (true) {
             return sendError(res, 'No puedes modificar a un usuario con igual o mayor autoridad', 'FORBIDDEN', 403);
         }

[NoCoverage] OptionalChaining
controllers/userController.ts:59:35
         }
 
         const updatedUser = await userService.updateUserRole(id, role);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = req.user.username || 'Admin';
 
         logService.createLog({

[NoCoverage] LogicalOperator
controllers/userController.ts:59:35
         }
 
         const updatedUser = await userService.updateUserRole(id, role);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = req.user?.username && 'Admin';
 
         logService.createLog({

[NoCoverage] StringLiteral
controllers/userController.ts:63:21
 
         logService.createLog({
             username: requestorUsername,
-            action: 'UPDATE_ROLE',
+            action: "",
             details: `Updated user ${id} role to ${role}`,
             source: 'web'

[NoCoverage] BlockStatement
controllers/userController.ts:69:21
         }).catch(console.error);
 
         return sendSuccess(res, updatedUser, 'User role updated');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/userController.ts:75:74
     }
 };
 
-export const updateUserMetadata = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const { metadata } = req.body;
-        
-        if (!metadata) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
-
-        const updatedUser = await userService.updateUserMetadata(id, metadata);
-        const requestorUsername = req.user?.username || 'Admin';
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'UPDATE_METADATA',
-            details: `Updated user ${id} metadata: ${JSON.stringify(metadata)}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, updatedUser, 'User metadata updated');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const updateUserMetadata = async (req: Request, res: Response) => {};
 
 export const getPublicProfile = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/userController.ts:76:9
 };
 
 export const updateUserMetadata = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const { metadata } = req.body;
-        
-        if (!metadata) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
-
-        const updatedUser = await userService.updateUserMetadata(id, metadata);
-        const requestorUsername = req.user?.username || 'Admin';
-
-        logService.createLog({
-            username: requestorUsername,
-            action: 'UPDATE_METADATA',
-            details: `Updated user ${id} metadata: ${JSON.stringify(metadata)}`,
-            source: 'web'
-        }).catch(console.error);
-
-        return sendSuccess(res, updatedUser, 'User metadata updated');
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] ConditionalExpression
controllers/userController.ts:80:13
         const id = ensureString(req.params.id);
         const { metadata } = req.body;
         
-        if (!metadata) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
+        if (false) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
 
         const updatedUser = await userService.updateUserMetadata(id, metadata);

[NoCoverage] BooleanLiteral
controllers/userController.ts:80:13
         const id = ensureString(req.params.id);
         const { metadata } = req.body;
         
-        if (!metadata) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
+        if (metadata) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
 
         const updatedUser = await userService.updateUserMetadata(id, metadata);

[NoCoverage] ConditionalExpression
controllers/userController.ts:83:35
         if (!metadata) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
 
         const updatedUser = await userService.updateUserMetadata(id, metadata);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = true;
 
         logService.createLog({

[NoCoverage] ConditionalExpression
controllers/userController.ts:83:35
         if (!metadata) return sendError(res, 'Metadata object is required', 'MISSING_FIELD', 400);
 
         const updatedUser = await userService.updateUserMetadata(id, metadata);
-        const requestorUsername = req.user?.username || 'Admin';
+        const requestorUsername = false;
 
         logService.createLog({

[NoCoverage] StringLiteral
controllers/userController.ts:89:21
             username: requestorUsername,
             action: 'UPDATE_METADATA',
             details: `Updated user ${id} metadata: ${JSON.stringify(metadata)}`,
-            source: 'web'
+            source: ""
         }).catch(console.error);
 

[NoCoverage] StringLiteral
controllers/userController.ts:92:46
             source: 'web'
         }).catch(console.error);
 
-        return sendSuccess(res, updatedUser, 'User metadata updated');
+        return sendSuccess(res, updatedUser, "");
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/userController.ts:93:21
         }).catch(console.error);
 
         return sendSuccess(res, updatedUser, 'User metadata updated');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/userController.ts:99:72
     }
 };
 
-export const getPublicProfile = async (req: Request, res: Response) => {
-    try {
-        const username = ensureString(req.params.username);
-        const profile = await userService.getPublicProfile(username);
-        if (!profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
-        return sendSuccess(res, profile);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const getPublicProfile = async (req: Request, res: Response) => {};
 
 /**

[NoCoverage] BlockStatement
controllers/userController.ts:100:9
 };
 
 export const getPublicProfile = async (req: Request, res: Response) => {
-    try {
-        const username = ensureString(req.params.username);
-        const profile = await userService.getPublicProfile(username);
-        if (!profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
-        return sendSuccess(res, profile);
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] ConditionalExpression
controllers/userController.ts:103:13
     try {
         const username = ensureString(req.params.username);
         const profile = await userService.getPublicProfile(username);
-        if (!profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
+        if (false) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
         return sendSuccess(res, profile);
     } catch (error) {

[NoCoverage] ConditionalExpression
controllers/userController.ts:103:13
     try {
         const username = ensureString(req.params.username);
         const profile = await userService.getPublicProfile(username);
-        if (!profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
+        if (true) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
         return sendSuccess(res, profile);
     } catch (error) {

[NoCoverage] BlockStatement
controllers/userController.ts:105:21
         const profile = await userService.getPublicProfile(username);
         if (!profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
         return sendSuccess(res, profile);
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[Killed] ConditionalExpression
controllers/userController.ts:120:13
         const username = ensureString(req.params.username);
         const profile = await userService.getPublicProfile(username);
 
-        if (!profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
+        if (false) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
 
         // SECURITY: wallet balance is private. Only expose it to the profile
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Killed] BooleanLiteral
controllers/userController.ts:120:13
         const username = ensureString(req.params.username);
         const profile = await userService.getPublicProfile(username);
 
-        if (!profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
+        if (profile) return sendError(res, 'User not found', 'USER_NOT_FOUND', 404);
 
         // SECURITY: wallet balance is private. Only expose it to the profile
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[NoCoverage] MethodExpression
controllers/userController.ts:124:31
 
         // SECURITY: wallet balance is private. Only expose it to the profile
         // owner or staff roles. Everyone else gets the public shape only.
-        const requesterRole = (req.user?.role || '').toLowerCase();
+        const requesterRole = (req.user?.role || '').toUpperCase();
         const isOwner = req.user?.id === profile.id;
         const isStaff = STAFF_ROLES.includes(requesterRole);

[NoCoverage] LogicalOperator
controllers/userController.ts:124:32
 
         // SECURITY: wallet balance is private. Only expose it to the profile
         // owner or staff roles. Everyone else gets the public shape only.
-        const requesterRole = (req.user?.role || '').toLowerCase();
+        const requesterRole = (req.user?.role && '').toLowerCase();
         const isOwner = req.user?.id === profile.id;
         const isStaff = STAFF_ROLES.includes(requesterRole);

[NoCoverage] ConditionalExpression
controllers/userController.ts:125:25
         // SECURITY: wallet balance is private. Only expose it to the profile
         // owner or staff roles. Everyone else gets the public shape only.
         const requesterRole = (req.user?.role || '').toLowerCase();
-        const isOwner = req.user?.id === profile.id;
+        const isOwner = true;
         const isStaff = STAFF_ROLES.includes(requesterRole);
         const canSeeWallet = isOwner || isStaff;

[NoCoverage] EqualityOperator
controllers/userController.ts:125:25
         // SECURITY: wallet balance is private. Only expose it to the profile
         // owner or staff roles. Everyone else gets the public shape only.
         const requesterRole = (req.user?.role || '').toLowerCase();
-        const isOwner = req.user?.id === profile.id;
+        const isOwner = req.user?.id !== profile.id;
         const isStaff = STAFF_ROLES.includes(requesterRole);
         const canSeeWallet = isOwner || isStaff;

[NoCoverage] ConditionalExpression
controllers/userController.ts:127:30
         const requesterRole = (req.user?.role || '').toLowerCase();
         const isOwner = req.user?.id === profile.id;
         const isStaff = STAFF_ROLES.includes(requesterRole);
-        const canSeeWallet = isOwner || isStaff;
+        const canSeeWallet = true;
 
         // Parallel Fetching of related data

[NoCoverage] ConditionalExpression
controllers/userController.ts:127:30
         const requesterRole = (req.user?.role || '').toLowerCase();
         const isOwner = req.user?.id === profile.id;
         const isStaff = STAFF_ROLES.includes(requesterRole);
-        const canSeeWallet = isOwner || isStaff;
+        const canSeeWallet = false;
 
         // Parallel Fetching of related data

[NoCoverage] ConditionalExpression
controllers/userController.ts:135:13
             profile.username ? playerStatsService.getPlayerStats(profile.username) : null,
 
             // Wallet (Coins) - only fetched when the requester is allowed to see it
-            canSeeWallet && profile.minecraft_uuid ? playerStatsService.getMoney(profile.minecraft_uuid) : null,
+            false ? playerStatsService.getMoney(profile.minecraft_uuid) : null,
 
             // Forum Activity - uses Web User ID

[NoCoverage] ConditionalExpression
controllers/userController.ts:135:13
             profile.username ? playerStatsService.getPlayerStats(profile.username) : null,
 
             // Wallet (Coins) - only fetched when the requester is allowed to see it
-            canSeeWallet && profile.minecraft_uuid ? playerStatsService.getMoney(profile.minecraft_uuid) : null,
+            true ? playerStatsService.getMoney(profile.minecraft_uuid) : null,
 
             // Forum Activity - uses Web User ID

[NoCoverage] ObjectLiteral
controllers/userController.ts:141:33
             forumService.getUserThreads(profile.id)
         ]);
 
-        return sendSuccess(res, {
-            ...profile,
-            game_stats: stats,
-            ...(canSeeWallet ? { wallet: { coins: wallet } } : {}),
-            forum: {
-                threads: threads.slice(0, 5), // Limit to top 5
-                total_threads: threads.length
-            }
-        });
+        return sendSuccess(res, {});
 
     } catch (error) {

[NoCoverage] ObjectLiteral
controllers/userController.ts:144:32
         return sendSuccess(res, {
             ...profile,
             game_stats: stats,
-            ...(canSeeWallet ? { wallet: { coins: wallet } } : {}),
+            ...(canSeeWallet ? {} : {}),
             forum: {
                 threads: threads.slice(0, 5), // Limit to top 5

[NoCoverage] MethodExpression
controllers/userController.ts:146:26
             game_stats: stats,
             ...(canSeeWallet ? { wallet: { coins: wallet } } : {}),
             forum: {
-                threads: threads.slice(0, 5), // Limit to top 5
+                threads: threads, // Limit to top 5
                 total_threads: threads.length
             }

[NoCoverage] BlockStatement
controllers/userController.ts:151:21
             }
         });
 
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 export const getStaffUsers = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/userController.ts:156:69
         return sendError(res, message);
     }
 };
-export const getStaffUsers = async (req: Request, res: Response) => {
-    try {
-        const staff = await userService.getStaffUsers();
-        return sendSuccess(res, staff, 'Staff users fetched successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const getStaffUsers = async (req: Request, res: Response) => {};
 
 export const giveKarma = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/userController.ts:157:9
     }
 };
 export const getStaffUsers = async (req: Request, res: Response) => {
-    try {
-        const staff = await userService.getStaffUsers();
-        return sendSuccess(res, staff, 'Staff users fetched successfully');
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] StringLiteral
controllers/userController.ts:159:40
 export const getStaffUsers = async (req: Request, res: Response) => {
     try {
         const staff = await userService.getStaffUsers();
-        return sendSuccess(res, staff, 'Staff users fetched successfully');
+        return sendSuccess(res, staff, "");
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/userController.ts:160:21
     try {
         const staff = await userService.getStaffUsers();
         return sendSuccess(res, staff, 'Staff users fetched successfully');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/userController.ts:166:65
     }
 };
 
-export const giveKarma = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const voterId = (req as Request & { user: { id: string } }).user.id; // From authenticateToken middleware
-
-        if (id === voterId) {
-            return sendError(res, 'No puedes darte karma a ti mismo', 'SELF_VOTE', 400);
-        }
-
-        const newReputation = await userService.giveKarma(id, voterId);
-        return sendSuccess(res, { newReputation }, 'Karma dado exitosamente');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
-};
+export const giveKarma = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/userController.ts:167:9
 };
 
 export const giveKarma = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const voterId = (req as Request & { user: { id: string } }).user.id; // From authenticateToken middleware
-
-        if (id === voterId) {
-            return sendError(res, 'No puedes darte karma a ti mismo', 'SELF_VOTE', 400);
-        }
-
-        const newReputation = await userService.giveKarma(id, voterId);
-        return sendSuccess(res, { newReputation }, 'Karma dado exitosamente');
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         return sendError(res, message);

[NoCoverage] BlockStatement
controllers/userController.ts:171:29
         const id = ensureString(req.params.id);
         const voterId = (req as Request & { user: { id: string } }).user.id; // From authenticateToken middleware
 
-        if (id === voterId) {
-            return sendError(res, 'No puedes darte karma a ti mismo', 'SELF_VOTE', 400);
-        }
+        if (id === voterId) {}
 
         const newReputation = await userService.giveKarma(id, voterId);

[NoCoverage] EqualityOperator
controllers/userController.ts:171:13
         const id = ensureString(req.params.id);
         const voterId = (req as Request & { user: { id: string } }).user.id; // From authenticateToken middleware
 
-        if (id === voterId) {
+        if (id !== voterId) {
             return sendError(res, 'No puedes darte karma a ti mismo', 'SELF_VOTE', 400);
         }

[NoCoverage] StringLiteral
controllers/userController.ts:172:71
         const voterId = (req as Request & { user: { id: string } }).user.id; // From authenticateToken middleware
 
         if (id === voterId) {
-            return sendError(res, 'No puedes darte karma a ti mismo', 'SELF_VOTE', 400);
+            return sendError(res, 'No puedes darte karma a ti mismo', "", 400);
         }
 

[NoCoverage] StringLiteral
controllers/userController.ts:176:52
         }
 
         const newReputation = await userService.giveKarma(id, voterId);
-        return sendSuccess(res, { newReputation }, 'Karma dado exitosamente');
+        return sendSuccess(res, { newReputation }, "");
     } catch (error) {
         const message = error instanceof Error ? error.message : String(error);

[NoCoverage] BlockStatement
controllers/userController.ts:177:21
 
         const newReputation = await userService.giveKarma(id, voterId);
         return sendSuccess(res, { newReputation }, 'Karma dado exitosamente');
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        return sendError(res, message);
-    }
+    } catch (error) {}
 };
 
