[NoCoverage] BlockStatement
controllers/wikiController.ts:6:67
 import { sendSuccess, sendError } from '../utils/responseHandler.js';
 import { ensureString } from '../utils/typeUtils.js';
 
-export const getArticles = async (req: Request, res: Response) => {
-    try {
-        const category = ensureString(req.query.category);
-        const articles = await wikiService.getAllArticles(category);
-        return sendSuccess(res, articles);
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error fetching wiki articles');
-    }
-};
+export const getArticles = async (req: Request, res: Response) => {};
 
 export const getArticle = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/wikiController.ts:7:9
 import { ensureString } from '../utils/typeUtils.js';
 
 export const getArticles = async (req: Request, res: Response) => {
-    try {
-        const category = ensureString(req.query.category);
-        const articles = await wikiService.getAllArticles(category);
-        return sendSuccess(res, articles);
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error fetching wiki articles');
     }

[NoCoverage] BlockStatement
controllers/wikiController.ts:11:21
         const category = ensureString(req.query.category);
         const articles = await wikiService.getAllArticles(category);
         return sendSuccess(res, articles);
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error fetching wiki articles');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
controllers/wikiController.ts:12:72
         const articles = await wikiService.getAllArticles(category);
         return sendSuccess(res, articles);
     } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error fetching wiki articles');
+        return sendError(res, error instanceof Error ? error.message : "");
     }
 };

[NoCoverage] BlockStatement
controllers/wikiController.ts:16:66
     }
 };
 
-export const getArticle = async (req: Request, res: Response) => {
-    try {
-        const slug = ensureString(req.params.slug);
-        const article = await wikiService.getArticleBySlug(slug);
-        if (!article) return sendError(res, 'Article not found', 'NOT_FOUND', 404);
-        return sendSuccess(res, article);
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error fetching wiki article');
-    }
-};
+export const getArticle = async (req: Request, res: Response) => {};
 
 export const createWikiArticle = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/wikiController.ts:17:9
 };
 
 export const getArticle = async (req: Request, res: Response) => {
-    try {
-        const slug = ensureString(req.params.slug);
-        const article = await wikiService.getArticleBySlug(slug);
-        if (!article) return sendError(res, 'Article not found', 'NOT_FOUND', 404);
-        return sendSuccess(res, article);
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error fetching wiki article');
     }

[NoCoverage] ConditionalExpression
controllers/wikiController.ts:20:13
     try {
         const slug = ensureString(req.params.slug);
         const article = await wikiService.getArticleBySlug(slug);
-        if (!article) return sendError(res, 'Article not found', 'NOT_FOUND', 404);
+        if (false) return sendError(res, 'Article not found', 'NOT_FOUND', 404);
         return sendSuccess(res, article);
     } catch (error) {

[NoCoverage] BooleanLiteral
controllers/wikiController.ts:20:13
     try {
         const slug = ensureString(req.params.slug);
         const article = await wikiService.getArticleBySlug(slug);
-        if (!article) return sendError(res, 'Article not found', 'NOT_FOUND', 404);
+        if (article) return sendError(res, 'Article not found', 'NOT_FOUND', 404);
         return sendSuccess(res, article);
     } catch (error) {

[NoCoverage] BlockStatement
controllers/wikiController.ts:22:21
         const article = await wikiService.getArticleBySlug(slug);
         if (!article) return sendError(res, 'Article not found', 'NOT_FOUND', 404);
         return sendSuccess(res, article);
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error fetching wiki article');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/wikiController.ts:27:73
     }
 };
 
-export const createWikiArticle = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        const articleData = { ...req.body, author_id: user?.id };
-        const article = await wikiService.createArticle(articleData);
-        return sendSuccess(res, article, 'Article created');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error creating wiki article');
-    }
-};
+export const createWikiArticle = async (req: Request, res: Response) => {};
 
 export const updateWikiArticle = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/wikiController.ts:28:9
 };
 
 export const createWikiArticle = async (req: Request, res: Response) => {
-    try {
-        const user = req.user;
-        const articleData = { ...req.body, author_id: user?.id };
-        const article = await wikiService.createArticle(articleData);
-        return sendSuccess(res, article, 'Article created');
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error creating wiki article');
     }

[NoCoverage] OptionalChaining
controllers/wikiController.ts:30:55
 export const createWikiArticle = async (req: Request, res: Response) => {
     try {
         const user = req.user;
-        const articleData = { ...req.body, author_id: user?.id };
+        const articleData = { ...req.body, author_id: user.id };
         const article = await wikiService.createArticle(articleData);
         return sendSuccess(res, article, 'Article created');

[NoCoverage] BlockStatement
controllers/wikiController.ts:33:21
         const articleData = { ...req.body, author_id: user?.id };
         const article = await wikiService.createArticle(articleData);
         return sendSuccess(res, article, 'Article created');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error creating wiki article');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/wikiController.ts:38:73
     }
 };
 
-export const updateWikiArticle = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const article = await wikiService.updateArticle(parseInt(id), req.body);
-        return sendSuccess(res, article, 'Article updated');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error updating wiki article');
-    }
-};
+export const updateWikiArticle = async (req: Request, res: Response) => {};
 
 export const deleteWikiArticle = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
controllers/wikiController.ts:39:9
 };
 
 export const updateWikiArticle = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        const article = await wikiService.updateArticle(parseInt(id), req.body);
-        return sendSuccess(res, article, 'Article updated');
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error updating wiki article');
     }

[NoCoverage] BlockStatement
controllers/wikiController.ts:43:21
         const id = ensureString(req.params.id);
         const article = await wikiService.updateArticle(parseInt(id), req.body);
         return sendSuccess(res, article, 'Article updated');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error updating wiki article');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
controllers/wikiController.ts:48:73
     }
 };
 
-export const deleteWikiArticle = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        await wikiService.deleteArticle(parseInt(id));
-        return sendSuccess(res, null, 'Article deleted');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error deleting wiki article');
-    }
-};
+export const deleteWikiArticle = async (req: Request, res: Response) => {};
 

[NoCoverage] BlockStatement
controllers/wikiController.ts:49:9
 };
 
 export const deleteWikiArticle = async (req: Request, res: Response) => {
-    try {
-        const id = ensureString(req.params.id);
-        await wikiService.deleteArticle(parseInt(id));
-        return sendSuccess(res, null, 'Article deleted');
-    } catch (error) {
+    try {} catch (error) {
         return sendError(res, error instanceof Error ? error.message : 'Error deleting wiki article');
     }

[NoCoverage] BlockStatement
controllers/wikiController.ts:53:21
         const id = ensureString(req.params.id);
         await wikiService.deleteArticle(parseInt(id));
         return sendSuccess(res, null, 'Article deleted');
-    } catch (error) {
-        return sendError(res, error instanceof Error ? error.message : 'Error deleting wiki article');
-    }
+    } catch (error) {}
 };
 
