[Survived] ConditionalExpression
middleware/honeypotMiddleware.ts:32:16
     res: Response,
     customDelayMs?: number
 ): Promise<void> => {
-    const ip = req.ip || req.socket.remoteAddress || 'Unknown IP';
+    const ip = false;
     const userAgent = req.headers['user-agent'] || 'Unknown User-Agent';
     const path = req.originalUrl || req.url;

[Survived] ConditionalExpression
middleware/honeypotMiddleware.ts:32:16
     res: Response,
     customDelayMs?: number
 ): Promise<void> => {
-    const ip = req.ip || req.socket.remoteAddress || 'Unknown IP';
+    const ip = false || 'Unknown IP';
     const userAgent = req.headers['user-agent'] || 'Unknown User-Agent';
     const path = req.originalUrl || req.url;

[Survived] ConditionalExpression
middleware/honeypotMiddleware.ts:33:23
     customDelayMs?: number
 ): Promise<void> => {
     const ip = req.ip || req.socket.remoteAddress || 'Unknown IP';
-    const userAgent = req.headers['user-agent'] || 'Unknown User-Agent';
+    const userAgent = true;
     const path = req.originalUrl || req.url;
     const method = req.method;

[Survived] LogicalOperator
middleware/honeypotMiddleware.ts:33:23
     customDelayMs?: number
 ): Promise<void> => {
     const ip = req.ip || req.socket.remoteAddress || 'Unknown IP';
-    const userAgent = req.headers['user-agent'] || 'Unknown User-Agent';
+    const userAgent = req.headers['user-agent'] && 'Unknown User-Agent';
     const path = req.originalUrl || req.url;
     const method = req.method;

[Survived] ConditionalExpression
middleware/honeypotMiddleware.ts:34:18
 ): Promise<void> => {
     const ip = req.ip || req.socket.remoteAddress || 'Unknown IP';
     const userAgent = req.headers['user-agent'] || 'Unknown User-Agent';
-    const path = req.originalUrl || req.url;
+    const path = true;
     const method = req.method;
 

[Survived] ConditionalExpression
middleware/honeypotMiddleware.ts:34:18
 ): Promise<void> => {
     const ip = req.ip || req.socket.remoteAddress || 'Unknown IP';
     const userAgent = req.headers['user-agent'] || 'Unknown User-Agent';
-    const path = req.originalUrl || req.url;
+    const path = false;
     const method = req.method;
 

[Killed] LogicalOperator
middleware/honeypotMiddleware.ts:38:21
     const method = req.method;
 
     // Cryptographically secure jittered tarpitting delay between 1500ms and 4000ms
-    const delayMs = customDelayMs ?? crypto.randomInt(1500, 4000);
+    const delayMs = customDelayMs && crypto.randomInt(1500, 4000);
 
     const details: HoneypotLogDetails = {
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch WP scanner decoy probe GET /wp-login.php and trigger honeypot
statusReason: expected 60 to be greater than or equal to 1400

[Killed] LogicalOperator
middleware/honeypotMiddleware.ts:47:18
         path,
         method,
         delayMs,
-        payload: req.body && Object.keys(req.body).length > 0 ? req.body : undefined
+        payload: req.body || Object.keys(req.body).length > 0 ? req.body : undefined
     };
 
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch WP scanner decoy probe GET /wp-login.php and trigger honeypot
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ConditionalExpression
middleware/honeypotMiddleware.ts:47:18
         path,
         method,
         delayMs,
-        payload: req.body && Object.keys(req.body).length > 0 ? req.body : undefined
+        payload: true ? req.body : undefined
     };
 

[Survived] StringLiteral
middleware/honeypotMiddleware.ts:50:18
         payload: req.body && Object.keys(req.body).length > 0 ? req.body : undefined
     };
 
-    console.warn(`[HONEYPOT_TRIGGERED] ${reason} | IP: ${ip} | Path: ${method} ${path} | Agent: ${userAgent}`);
+    console.warn(``);
 
     // Asynchronously notify Discord Security Webhook (Non-blocking)

[Survived] LogicalOperator
middleware/honeypotMiddleware.ts:53:9
     console.warn(`[HONEYPOT_TRIGGERED] ${reason} | IP: ${ip} | Path: ${method} ${path} | Agent: ${userAgent}`);
 
     // Asynchronously notify Discord Security Webhook (Non-blocking)
-    if (DISCORD_SECURITY_WEBHOOK_URL && process.env.NODE_ENV !== 'test') {
+    if (DISCORD_SECURITY_WEBHOOK_URL || process.env.NODE_ENV !== 'test') {
         sendDiscordSecurityAlert(details).catch((err) => {
             console.error(`[HONEYPOT_DISCORD_ERROR] Failed to send webhook alert: ${err.message}`);

[Survived] ConditionalExpression
middleware/honeypotMiddleware.ts:53:9
     console.warn(`[HONEYPOT_TRIGGERED] ${reason} | IP: ${ip} | Path: ${method} ${path} | Agent: ${userAgent}`);
 
     // Asynchronously notify Discord Security Webhook (Non-blocking)
-    if (DISCORD_SECURITY_WEBHOOK_URL && process.env.NODE_ENV !== 'test') {
+    if (true) {
         sendDiscordSecurityAlert(details).catch((err) => {
             console.error(`[HONEYPOT_DISCORD_ERROR] Failed to send webhook alert: ${err.message}`);

[NoCoverage] BlockStatement
middleware/honeypotMiddleware.ts:54:58
 
     // Asynchronously notify Discord Security Webhook (Non-blocking)
     if (DISCORD_SECURITY_WEBHOOK_URL && process.env.NODE_ENV !== 'test') {
-        sendDiscordSecurityAlert(details).catch((err) => {
-            console.error(`[HONEYPOT_DISCORD_ERROR] Failed to send webhook alert: ${err.message}`);
-        });
+        sendDiscordSecurityAlert(details).catch((err) => {});
     }
 

[Killed] ArrowFunction
middleware/honeypotMiddleware.ts:60:23
     }
 
     // Apply Tarpitting Delay before responding
-    await new Promise((resolve) => setTimeout(resolve, delayMs));
+    await new Promise(() => undefined);
 
     if (!res.headersSent) {
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch WP scanner decoy probe GET /wp-login.php and trigger honeypot
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
middleware/honeypotMiddleware.ts:62:27
     // Apply Tarpitting Delay before responding
     await new Promise((resolve) => setTimeout(resolve, delayMs));
 
-    if (!res.headersSent) {
-        // Return standard 400 or 404 response matching normal API style
-        if (method === 'GET') {
-            res.status(404).json({ error: 'Not Found', message: 'The requested resource does not exist' });
-        } else {
-            res.status(400).json({ error: 'Bad Request', message: 'Invalid request parameters' });
-        }
-    }
+    if (!res.headersSent) {}
 };
 
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch WP scanner decoy probe GET /wp-login.php and trigger honeypot
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
middleware/honeypotMiddleware.ts:62:9
     // Apply Tarpitting Delay before responding
     await new Promise((resolve) => setTimeout(resolve, delayMs));
 
-    if (!res.headersSent) {
+    if (false) {
         // Return standard 400 or 404 response matching normal API style
         if (method === 'GET') {
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch WP scanner decoy probe GET /wp-login.php and trigger honeypot
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
middleware/honeypotMiddleware.ts:64:13
 
     if (!res.headersSent) {
         // Return standard 400 or 404 response matching normal API style
-        if (method === 'GET') {
+        if (false) {
             res.status(404).json({ error: 'Not Found', message: 'The requested resource does not exist' });
         } else {
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch WP scanner decoy probe GET /wp-login.php and trigger honeypot
statusReason: expected 400 to be 404 // Object.is equality

[Killed] EqualityOperator
middleware/honeypotMiddleware.ts:64:13
 
     if (!res.headersSent) {
         // Return standard 400 or 404 response matching normal API style
-        if (method === 'GET') {
+        if (method !== 'GET') {
             res.status(404).json({ error: 'Not Found', message: 'The requested resource does not exist' });
         } else {
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch WP scanner decoy probe GET /wp-login.php and trigger honeypot
statusReason: expected 400 to be 404 // Object.is equality

[Killed] BlockStatement
middleware/honeypotMiddleware.ts:66:16
         // Return standard 400 or 404 response matching normal API style
         if (method === 'GET') {
             res.status(404).json({ error: 'Not Found', message: 'The requested resource does not exist' });
-        } else {
-            res.status(400).json({ error: 'Bad Request', message: 'Invalid request parameters' });
-        }
+        } else {}
     }
 };
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch form honeypot when confirm_email is populated on POST /api/auth/register
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
middleware/honeypotMiddleware.ts:67:67
         if (method === 'GET') {
             res.status(404).json({ error: 'Not Found', message: 'The requested resource does not exist' });
         } else {
-            res.status(400).json({ error: 'Bad Request', message: 'Invalid request parameters' });
+            res.status(400).json({ error: 'Bad Request', message: "" });
         }
     }

[NoCoverage] BlockStatement
middleware/honeypotMiddleware.ts:75:88
 /**
  * Sends formatted alert to Discord #security-alerts channel via Webhook
  */
-const sendDiscordSecurityAlert = async (details: HoneypotLogDetails): Promise<void> => {
-    const embed = {
-        title: '🚨 ¡BOT CAÍDO EN TRAMPA DE SEGURIDAD (HONEYPOT)!',
-        color: 0xef4444, // Red
-        fields: [
-            { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
-            { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
-            { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
-            { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
-            { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }
-        ],
-        footer: { text: 'CrystalTides SMP Security Engine • Zero False Positives' },
-        timestamp: new Date().toISOString()
-    };
-
-    try {
-        await fetch(DISCORD_SECURITY_WEBHOOK_URL!, {
-            method: 'POST',
-            headers: { 'Content-Type': 'application/json' },
-            body: JSON.stringify({ embeds: [embed] })
-        });
-    } catch (err) {
-        console.error('[HONEYPOT_DISCORD_FETCH_FAILED]', err);
-    }
-};
+const sendDiscordSecurityAlert = async (details: HoneypotLogDetails): Promise<void> => {};
 
 /**

[NoCoverage] ObjectLiteral
middleware/honeypotMiddleware.ts:76:19
  * Sends formatted alert to Discord #security-alerts channel via Webhook
  */
 const sendDiscordSecurityAlert = async (details: HoneypotLogDetails): Promise<void> => {
-    const embed = {
-        title: '🚨 ¡BOT CAÍDO EN TRAMPA DE SEGURIDAD (HONEYPOT)!',
-        color: 0xef4444, // Red
-        fields: [
-            { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
-            { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
-            { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
-            { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
-            { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }
-        ],
-        footer: { text: 'CrystalTides SMP Security Engine • Zero False Positives' },
-        timestamp: new Date().toISOString()
-    };
+    const embed = {};
 
     try {

[NoCoverage] StringLiteral
middleware/honeypotMiddleware.ts:77:16
  */
 const sendDiscordSecurityAlert = async (details: HoneypotLogDetails): Promise<void> => {
     const embed = {
-        title: '🚨 ¡BOT CAÍDO EN TRAMPA DE SEGURIDAD (HONEYPOT)!',
+        title: ""
         color: 0xef4444, // Red
         fields: [

[NoCoverage] ArrayDeclaration
middleware/honeypotMiddleware.ts:79:17
     const embed = {
         title: '🚨 ¡BOT CAÍDO EN TRAMPA DE SEGURIDAD (HONEYPOT)!',
         color: 0xef4444, // Red
-        fields: [
-            { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
-            { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
-            { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
-            { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
-            { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }
-        ],
+        fields: [],
         footer: { text: 'CrystalTides SMP Security Engine • Zero False Positives' },
         timestamp: new Date().toISOString()

[NoCoverage] BooleanLiteral
middleware/honeypotMiddleware.ts:80:97
         title: '🚨 ¡BOT CAÍDO EN TRAMPA DE SEGURIDAD (HONEYPOT)!',
         color: 0xef4444, // Red
         fields: [
-            { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
+            { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: tfalse},
             { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
             { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },

[NoCoverage] BooleanLiteral
middleware/honeypotMiddleware.ts:81:76
         color: 0xef4444, // Red
         fields: [
             { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
-            { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
+            { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: tfalse},
             { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
             { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },

[NoCoverage] BooleanLiteral
middleware/honeypotMiddleware.ts:82:91
         fields: [
             { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
             { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
-            { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
+            { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: false },
             { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
             { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }

[NoCoverage] StringLiteral
middleware/honeypotMiddleware.ts:82:21
         fields: [
             { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
             { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
-            { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
+            { name: "", value: `\`${details.delayMs}ms\``, inline: true },
             { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
             { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }

[NoCoverage] BooleanLiteral
middleware/honeypotMiddleware.ts:83:79
             { name: '📍 Ruta Afectada', value: `\`${details.method} ${details.path}\``, inline: true },
             { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
             { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
-            { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
+            { name: '🕵️ Motivo de Detección', value: details.reason, inline: ftrue},
             { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }
         ],

[NoCoverage] BooleanLiteral
middleware/honeypotMiddleware.ts:84:107
             { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
             { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
             { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
-            { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }
+            { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: ftrue}
         ],
         footer: { text: 'CrystalTides SMP Security Engine • Zero False Positives' },

[NoCoverage] MethodExpression
middleware/honeypotMiddleware.ts:84:54
             { name: '🌐 Dirección IP', value: `\`${details.ip}\``, inline: true },
             { name: '⏱️ Retardo (Tarpitting)', value: `\`${details.delayMs}ms\``, inline: true },
             { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
-            { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }
+            { name: '📱 User-Agent', value: `\`\`\`${ddetails.userAgent\`\`\``, inline: false }
         ],
         footer: { text: 'CrystalTides SMP Security Engine • Zero False Positives' },

[NoCoverage] ObjectLiteral
middleware/honeypotMiddleware.ts:86:17
             { name: '🕵️ Motivo de Detección', value: details.reason, inline: false },
             { name: '📱 User-Agent', value: `\`\`\`${details.userAgent.substring(0, 200)}\`\`\``, inline: false }
         ],
-        footer: { text: 'CrystalTides SMP Security Engine • Zero False Positives' },
+        footer: {},
         timestamp: new Date().toISOString()
     };

[NoCoverage] BlockStatement
middleware/honeypotMiddleware.ts:90:9
         timestamp: new Date().toISOString()
     };
 
-    try {
-        await fetch(DISCORD_SECURITY_WEBHOOK_URL!, {
-            method: 'POST',
-            headers: { 'Content-Type': 'application/json' },
-            body: JSON.stringify({ embeds: [embed] })
-        });
-    } catch (err) {
+    try {} catch (err) {
         console.error('[HONEYPOT_DISCORD_FETCH_FAILED]', err);
     }

[NoCoverage] BlockStatement
middleware/honeypotMiddleware.ts:96:19
             headers: { 'Content-Type': 'application/json' },
             body: JSON.stringify({ embeds: [embed] })
         });
-    } catch (err) {
-        console.error('[HONEYPOT_DISCORD_FETCH_FAILED]', err);
-    }
+    } catch (err) {}
 };
 

[NoCoverage] StringLiteral
middleware/honeypotMiddleware.ts:97:23
             body: JSON.stringify({ embeds: [embed] })
         });
     } catch (err) {
-        console.error('[HONEYPOT_DISCORD_FETCH_FAILED]', err);
+        console.error("", err);
     }
 };

[Timeout] BlockStatement
middleware/honeypotMiddleware.ts:105:67
  * Express Middleware: Inspects hidden honeypot form fields (e.g. 'confirm_email', 'user_website').
  * If populated by a bot, triggers Honeypot trap.
  */
-export const checkFormHoneypot = (fieldName = 'confirm_email') => {
-    return (req: Request, res: Response, next: NextFunction): void => {
-        if (req.body?.[fieldName]) {
-            const fieldValue = String(req.body[fieldName]);
-            if (fieldValue.trim().length > 0) {
-                triggerHoneypot(`Form Honeypot Field Activated ('${fieldName}')`, req, res);
-                return;
-            }
-        }
-        next();
-    };
-};
+export const checkFormHoneypot = (fieldName = 'confirm_email') => {};
 
 /**

[NoCoverage] StringLiteral
middleware/honeypotMiddleware.ts:105:47
  * Express Middleware: Inspects hidden honeypot form fields (e.g. 'confirm_email', 'user_website').
  * If populated by a bot, triggers Honeypot trap.
  */
-export const checkFormHoneypot = (fieldName = 'confirm_email') => {
+export const checkFormHoneypot = (fieldName = "") => {
     return (req: Request, res: Response, next: NextFunction): void => {
         if (req.body?.[fieldName]) {

[Killed] BlockStatement
middleware/honeypotMiddleware.ts:106:71
  * If populated by a bot, triggers Honeypot trap.
  */
 export const checkFormHoneypot = (fieldName = 'confirm_email') => {
-    return (req: Request, res: Response, next: NextFunction): void => {
-        if (req.body?.[fieldName]) {
-            const fieldValue = String(req.body[fieldName]);
-            if (fieldValue.trim().length > 0) {
-                triggerHoneypot(`Form Honeypot Field Activated ('${fieldName}')`, req, res);
-                return;
-            }
-        }
-        next();
-    };
+    return (req: Request, res: Response, next: NextFunction): void => {};
 };
 
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch form honeypot when confirm_email is populated on POST /api/auth/register
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
middleware/honeypotMiddleware.ts:107:13
  */
 export const checkFormHoneypot = (fieldName = 'confirm_email') => {
     return (req: Request, res: Response, next: NextFunction): void => {
-        if (req.body?.[fieldName]) {
+        if (false) {
             const fieldValue = String(req.body[fieldName]);
             if (fieldValue.trim().length > 0) {
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch form honeypot when confirm_email is populated on POST /api/auth/register
statusReason: expected { success: false, error: { …(2) } } to have property "error" with value 'Bad Request'

[Killed] ConditionalExpression
middleware/honeypotMiddleware.ts:107:13
  */
 export const checkFormHoneypot = (fieldName = 'confirm_email') => {
     return (req: Request, res: Response, next: NextFunction): void => {
-        if (req.body?.[fieldName]) {
+        if (true) {
             const fieldValue = String(req.body[fieldName]);
             if (fieldValue.trim().length > 0) {
killedBy: Public Registration Endpoint (/api/auth/register) should reject requests with invalid email or short password
statusReason: expected { error: 'Bad Request', …(1) } to have property "error" with value 'Validation Error'

[Killed] BlockStatement
middleware/honeypotMiddleware.ts:109:47
     return (req: Request, res: Response, next: NextFunction): void => {
         if (req.body?.[fieldName]) {
             const fieldValue = String(req.body[fieldName]);
-            if (fieldValue.trim().length > 0) {
-                triggerHoneypot(`Form Honeypot Field Activated ('${fieldName}')`, req, res);
-                return;
-            }
+            if (fieldValue.trim().length > 0) {}
         }
         next();
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch form honeypot when confirm_email is populated on POST /api/auth/register
statusReason: expected { success: false, error: { …(2) } } to have property "error" with value 'Bad Request'

[Killed] ConditionalExpression
middleware/honeypotMiddleware.ts:109:17
     return (req: Request, res: Response, next: NextFunction): void => {
         if (req.body?.[fieldName]) {
             const fieldValue = String(req.body[fieldName]);
-            if (fieldValue.trim().length > 0) {
+            if (false) {
                 triggerHoneypot(`Form Honeypot Field Activated ('${fieldName}')`, req, res);
                 return;
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch form honeypot when confirm_email is populated on POST /api/auth/register
statusReason: expected { success: false, error: { …(2) } } to have property "error" with value 'Bad Request'

[Survived] StringLiteral
middleware/honeypotMiddleware.ts:110:33
         if (req.body?.[fieldName]) {
             const fieldValue = String(req.body[fieldName]);
             if (fieldValue.trim().length > 0) {
-                triggerHoneypot(`Form Honeypot Field Activated ('${fieldName}')`, req, res);
+                triggerHoneypot(``, req, res);
                 return;
             }

[Killed] BlockStatement
middleware/honeypotMiddleware.ts:122:92
  * Express Middleware: Inspects incoming headers for decoy canary tokens (e.g. 'x-debug-canary-token').
  * If present, triggers Honeypot trap.
  */
-export const checkCanaryToken = (req: Request, res: Response, next: NextFunction): void => {
-    const canaryToken = req.headers[CANARY_HEADER_NAME];
-    if (canaryToken && String(canaryToken).toLowerCase() === CANARY_TOKEN_VAL) {
-        triggerHoneypot(`Canary Token Probe Detected ('${CANARY_HEADER_NAME}')`, req, res);
-        return;
-    }
-    next();
-};
+export const checkCanaryToken = (req: Request, res: Response, next: NextFunction): void => {};
 
killedBy: 🛡️ Stealth Honeypot & Security Engine should disable X-Powered-By header to conceal Express fingerprint
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
middleware/honeypotMiddleware.ts:124:24
  */
 export const checkCanaryToken = (req: Request, res: Response, next: NextFunction): void => {
     const canaryToken = req.headers[CANARY_HEADER_NAME];
-    if (canaryToken && String(canaryToken).toLowerCase() === CANARY_TOKEN_VAL) {
+    if (canaryToken && String(canaryToken).toUpperCase() === CANARY_TOKEN_VAL) {
         triggerHoneypot(`Canary Token Probe Detected ('${CANARY_HEADER_NAME}')`, req, res);
         return;
killedBy: 🛡️ Stealth Honeypot & Security Engine should catch decoy Canary Token header x-debug-canary-token
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
middleware/honeypotMiddleware.ts:124:9
  */
 export const checkCanaryToken = (req: Request, res: Response, next: NextFunction): void => {
     const canaryToken = req.headers[CANARY_HEADER_NAME];
-    if (canaryToken && String(canaryToken).toLowerCase() === CANARY_TOKEN_VAL) {
+    if (true) {
         triggerHoneypot(`Canary Token Probe Detected ('${CANARY_HEADER_NAME}')`, req, res);
         return;
killedBy: RAG Controller & Integration E2E Test Suite debe rechazar solicitudes a /api/rag/ingest sin header de autenticación válido (401 Unauthorized)
statusReason: expected 400 to be 401 // Object.is equality

[Survived] StringLiteral
middleware/honeypotMiddleware.ts:125:25
 export const checkCanaryToken = (req: Request, res: Response, next: NextFunction): void => {
     const canaryToken = req.headers[CANARY_HEADER_NAME];
     if (canaryToken && String(canaryToken).toLowerCase() === CANARY_TOKEN_VAL) {
-        triggerHoneypot(`Canary Token Probe Detected ('${CANARY_HEADER_NAME}')`, req, res);
+        triggerHoneypot(``, req, res);
         return;
     }
