[Killed] BlockStatement
routes/ragRoutes.ts:11:43
 router.post('/ingest', handleRagIngestPush)
 
 // Endpoint de prueba de búsqueda RAG
-router.get('/search', async (req, res) => {
-  try {
-    const q = (req.query.q as string) || ''
-    if (!q) {
-      res.status(400).json({ error: 'Falta el parámetro de consulta ?q=' })
-      return
-    }
-
-    const results = await searchModKnowledge(q, 5)
-    const sanitized = verifyAndSanitizeKnowledgeQuery(q, results)
-
-    res.json({
-      query: q,
-      total_found: results.length,
-      is_supported: sanitized.isSupported,
-      context: sanitized.formattedContext,
-      results
-    })
-  } catch (err: unknown) {
-    const errorMsg = err instanceof Error ? err.message : String(err)
-    res.status(500).json({ error: 'Error en la búsqueda RAG', details: errorMsg })
-  }
-})
+router.get('/search', async (req, res) => {})
 
 export default router
killedBy: RAG Controller & Integration E2E Test Suite debe responder a la búsqueda RAG GET /api/rag/search?q=Ignis
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/ragRoutes.ts:12:7
 
 // Endpoint de prueba de búsqueda RAG
 router.get('/search', async (req, res) => {
-  try {
-    const q = (req.query.q as string) || ''
-    if (!q) {
-      res.status(400).json({ error: 'Falta el parámetro de consulta ?q=' })
-      return
-    }
-
-    const results = await searchModKnowledge(q, 5)
-    const sanitized = verifyAndSanitizeKnowledgeQuery(q, results)
-
-    res.json({
-      query: q,
-      total_found: results.length,
-      is_supported: sanitized.isSupported,
-      context: sanitized.formattedContext,
-      results
-    })
-  } catch (err: unknown) {
+  try {} catch (err: unknown) {
     const errorMsg = err instanceof Error ? err.message : String(err)
     res.status(500).json({ error: 'Error en la búsqueda RAG', details: errorMsg })
killedBy: RAG Controller & Integration E2E Test Suite debe responder a la búsqueda RAG GET /api/rag/search?q=Ignis
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
routes/ragRoutes.ts:13:15
 // Endpoint de prueba de búsqueda RAG
 router.get('/search', async (req, res) => {
   try {
-    const q = (req.query.q as string) || ''
+    const q = req.query.q as string && ''
     if (!q) {
       res.status(400).json({ error: 'Falta el parámetro de consulta ?q=' })
killedBy: RAG Controller & Integration E2E Test Suite debe responder a la búsqueda RAG GET /api/rag/search?q=Ignis
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/ragRoutes.ts:13:15
 // Endpoint de prueba de búsqueda RAG
 router.get('/search', async (req, res) => {
   try {
-    const q = (req.query.q as string) || ''
+    const q = false
     if (!q) {
       res.status(400).json({ error: 'Falta el parámetro de consulta ?q=' })
killedBy: RAG Controller & Integration E2E Test Suite debe responder a la búsqueda RAG GET /api/rag/search?q=Ignis
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/ragRoutes.ts:14:9
 router.get('/search', async (req, res) => {
   try {
     const q = (req.query.q as string) || ''
-    if (!q) {
+    if (q) {
       res.status(400).json({ error: 'Falta el parámetro de consulta ?q=' })
       return
killedBy: RAG Controller & Integration E2E Test Suite debe responder a la búsqueda RAG GET /api/rag/search?q=Ignis
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/ragRoutes.ts:14:9
 router.get('/search', async (req, res) => {
   try {
     const q = (req.query.q as string) || ''
-    if (!q) {
+    if (true) {
       res.status(400).json({ error: 'Falta el parámetro de consulta ?q=' })
       return
killedBy: RAG Controller & Integration E2E Test Suite debe responder a la búsqueda RAG GET /api/rag/search?q=Ignis
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/ragRoutes.ts:22:14
     const results = await searchModKnowledge(q, 5)
     const sanitized = verifyAndSanitizeKnowledgeQuery(q, results)
 
-    res.json({
-      query: q,
-      total_found: results.length,
-      is_supported: sanitized.isSupported,
-      context: sanitized.formattedContext,
-      results
-    })
+    res.json({})
   } catch (err: unknown) {
     const errorMsg = err instanceof Error ? err.message : String(err)
killedBy: RAG Controller & Integration E2E Test Suite debe responder a la búsqueda RAG GET /api/rag/search?q=Ignis
statusReason: expected {} to have property "query" with value 'Ignis'

[NoCoverage] BlockStatement
routes/ragRoutes.ts:29:26
       context: sanitized.formattedContext,
       results
     })
-  } catch (err: unknown) {
-    const errorMsg = err instanceof Error ? err.message : String(err)
-    res.status(500).json({ error: 'Error en la búsqueda RAG', details: errorMsg })
-  }
+  } catch (err: unknown) {}
 })
 
