[NoCoverage] ConditionalExpression
routes/serverStatusRoutes.ts:9:18
 // Route: Get Live Server Status (Online/Offline, Player Count, List)
 // Endpoint: /api/status/live
 router.get('/live', async (req: Request, res: Response) => {
-    const host = process.env.MC_SERVER_HOST || 'localhost';
+    const host = true;
     const port = parseInt(process.env.MC_SERVER_PORT as string) || 25565;
 

[NoCoverage] ConditionalExpression
routes/serverStatusRoutes.ts:9:18
 // Route: Get Live Server Status (Online/Offline, Player Count, List)
 // Endpoint: /api/status/live
 router.get('/live', async (req: Request, res: Response) => {
-    const host = process.env.MC_SERVER_HOST || 'localhost';
+    const host = false;
     const port = parseInt(process.env.MC_SERVER_PORT as string) || 25565;
 

[NoCoverage] ConditionalExpression
routes/serverStatusRoutes.ts:10:18
 // Endpoint: /api/status/live
 router.get('/live', async (req: Request, res: Response) => {
     const host = process.env.MC_SERVER_HOST || 'localhost';
-    const port = parseInt(process.env.MC_SERVER_PORT as string) || 25565;
+    const port = true;
 
     try {

[NoCoverage] LogicalOperator
routes/serverStatusRoutes.ts:10:18
 // Endpoint: /api/status/live
 router.get('/live', async (req: Request, res: Response) => {
     const host = process.env.MC_SERVER_HOST || 'localhost';
-    const port = parseInt(process.env.MC_SERVER_PORT as string) || 25565;
+    const port = parseInt(process.env.MC_SERVER_PORT as string) && 25565;
 
     try {

[NoCoverage] BlockStatement
routes/serverStatusRoutes.ts:12:9
     const host = process.env.MC_SERVER_HOST || 'localhost';
     const port = parseInt(process.env.MC_SERVER_PORT as string) || 25565;
 
-    try {
-        // Use Java Status (Query Protocol) - Fast & Standard
-        const result = await util.status(host, port, { 
-            timeout: 3000, 
-            enableSRV: true 
-        });
-        
-        // Success
-        res.json({
-            online: true,
-            motd: result.motd.clean,
-            version: result.version.name,
-            players: {
-                online: result.players.online,
-                max: result.players.max,
-                sample: result.players.sample || [] // List of names if provided
-            },
-            icon: result.favicon, // Base64 icon
-            latency: result.roundTripLatency
-        });
-
-    } catch (error) {
+    try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error);
         console.warn(`[Server Status] Check Failed for ${host}:${port}: ${message}`);

[NoCoverage] BooleanLiteral
routes/serverStatusRoutes.ts:16:24
         // Use Java Status (Query Protocol) - Fast & Standard
         const result = await util.status(host, port, { 
             timeout: 3000, 
-            enableSRV: true 
+            enableSRV: false 
         });
         

[NoCoverage] BooleanLiteral
routes/serverStatusRoutes.ts:21:21
         
         // Success
         res.json({
-            online: true,
+            online: false,
             motd: result.motd.clean,
             version: result.version.name,

[NoCoverage] ObjectLiteral
routes/serverStatusRoutes.ts:24:22
             online: true,
             motd: result.motd.clean,
             version: result.version.name,
-            players: {
-                online: result.players.online,
-                max: result.players.max,
-                sample: result.players.sample || [] // List of names if provided
-            },
+            players: {},
             icon: result.favicon, // Base64 icon
             latency: result.roundTripLatency

[NoCoverage] LogicalOperator
routes/serverStatusRoutes.ts:27:25
             players: {
                 online: result.players.online,
                 max: result.players.max,
-                sample: result.players.sample || [] // List of names if provided
+                sample: result.players.sample && [] // List of names if provided
             },
             icon: result.favicon, // Base64 icon

[NoCoverage] ConditionalExpression
routes/serverStatusRoutes.ts:27:25
             players: {
                 online: result.players.online,
                 max: result.players.max,
-                sample: result.players.sample || [] // List of names if provided
+                sample: false // List of names if provided
             },
             icon: result.favicon, // Base64 icon

[NoCoverage] BlockStatement
routes/serverStatusRoutes.ts:33:21
             latency: result.roundTripLatency
         });
 
-    } catch (error) {
-        const message = error instanceof Error ? error.message : String(error);
-        console.warn(`[Server Status] Check Failed for ${host}:${port}: ${message}`);
-        
-        // Fallback: Return offline structure so frontend handles it gracefully
-        res.json({
-            online: false,
-            motd: "Server Unreachable",
-            version: "Unknown",
-            players: {
-                online: 0,
-                max: 0,
-                sample: []
-            },
-            error: message
-        });
-    }
+    } catch (error) {}
 });
 

[NoCoverage] BooleanLiteral
routes/serverStatusRoutes.ts:39:21
         
         // Fallback: Return offline structure so frontend handles it gracefully
         res.json({
-            online: false,
+            online: true,
             motd: "Server Unreachable",
             version: "Unknown",

[NoCoverage] StringLiteral
routes/serverStatusRoutes.ts:40:19
         // Fallback: Return offline structure so frontend handles it gracefully
         res.json({
             online: false,
-            motd: "Server Unreachable",
+            motd: "",
             version: "Unknown",
             players: {

[NoCoverage] StringLiteral
routes/serverStatusRoutes.ts:41:22
         res.json({
             online: false,
             motd: "Server Unreachable",
-            version: "Unknown",
+            version: "",
             players: {
                 online: 0,

[NoCoverage] ArrayDeclaration
routes/serverStatusRoutes.ts:45:25
             players: {
                 online: 0,
                 max: 0,
-                sample: []
+                sample: ["Stryker was here"]
             },
             error: message
