[NoCoverage] BlockStatement
routes/translationRoutes.ts:11:108
 const router = express.Router();
 
 // Rate-limited + length-capped: each call costs Gemini API quota
-router.post('/', authenticateToken, sensitiveActionLimiter, validate(translateSchema), async (req, res) => {
-    const { text, targetLang } = req.body;
-
-    try {
-        const translated = await translateText(text, targetLang || 'en');
-        res.json({ success: true, translatedText: translated });
-    } catch (error) {
-        console.error("Translation route error:", error);
-        res.status(500).json({ error: "Translation failed" });
-    }
-});
+router.post('/', authenticateToken, sensitiveActionLimiter, validate(translateSchema), async (req, res) => {});
 
 export default router;

[Timeout] StringLiteral
routes/translationRoutes.ts:11:13
 const router = express.Router();
 
 // Rate-limited + length-capped: each call costs Gemini API quota
-router.post('/', authenticateToken, sensitiveActionLimiter, validate(translateSchema), async (req, res) => {
+router.post("", authenticateToken, sensitiveActionLimiter, validate(translateSchema), async (req, res) => {
     const { text, targetLang } = req.body;
 

[NoCoverage] BlockStatement
routes/translationRoutes.ts:14:9
 router.post('/', authenticateToken, sensitiveActionLimiter, validate(translateSchema), async (req, res) => {
     const { text, targetLang } = req.body;
 
-    try {
-        const translated = await translateText(text, targetLang || 'en');
-        res.json({ success: true, translatedText: translated });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Translation route error:", error);
         res.status(500).json({ error: "Translation failed" });

[NoCoverage] LogicalOperator
routes/translationRoutes.ts:15:54
     const { text, targetLang } = req.body;
 
     try {
-        const translated = await translateText(text, targetLang || 'en');
+        const translated = await translateText(text, targetLang && 'en');
         res.json({ success: true, translatedText: translated });
     } catch (error) {

[NoCoverage] ConditionalExpression
routes/translationRoutes.ts:15:54
     const { text, targetLang } = req.body;
 
     try {
-        const translated = await translateText(text, targetLang || 'en');
+        const translated = await translateText(text, false);
         res.json({ success: true, translatedText: translated });
     } catch (error) {

[NoCoverage] BooleanLiteral
routes/translationRoutes.ts:16:29
 
     try {
         const translated = await translateText(text, targetLang || 'en');
-        res.json({ success: true, translatedText: translated });
+        res.json({ success: false, translatedText: translated });
     } catch (error) {
         console.error("Translation route error:", error);

[NoCoverage] BlockStatement
routes/translationRoutes.ts:17:21
     try {
         const translated = await translateText(text, targetLang || 'en');
         res.json({ success: true, translatedText: translated });
-    } catch (error) {
-        console.error("Translation route error:", error);
-        res.status(500).json({ error: "Translation failed" });
-    }
+    } catch (error) {}
 });
 
