[NoCoverage] BlockStatement
services/commandService.ts:10:56
  * @param command - The command string to execute (without leading /).
  * @returns Object indicating success or failure.
  */
-export const queueCommand = async (command: string) => {
-    try {
-        const [result] = await pool.query(
-            'INSERT INTO web_pending_commands (command) VALUES (?)',
-            [command]
-        );
-        console.log(`[Command Queue] Queued command: ${command}`);
-        
-        // Notify WebSocket clients (Plugin) to fetch immediately
-        sendToAll('REFRESH_COMMANDS');
-
-        const insertId = (result as { insertId: number }).insertId;
-        return { success: true, id: insertId };
-    } catch (error) {
-        console.error('[Command Queue] Failed to queue command:', error);
-        return { success: false, error: 'Database error' };
-    }
-};
+export const queueCommand = async (command: string) => {};
 
 /**

[NoCoverage] BlockStatement
services/commandService.ts:11:9
  * @returns Object indicating success or failure.
  */
 export const queueCommand = async (command: string) => {
-    try {
-        const [result] = await pool.query(
-            'INSERT INTO web_pending_commands (command) VALUES (?)',
-            [command]
-        );
-        console.log(`[Command Queue] Queued command: ${command}`);
-        
-        // Notify WebSocket clients (Plugin) to fetch immediately
-        sendToAll('REFRESH_COMMANDS');
-
-        const insertId = (result as { insertId: number }).insertId;
-        return { success: true, id: insertId };
-    } catch (error) {
+    try {} catch (error) {
         console.error('[Command Queue] Failed to queue command:', error);
         return { success: false, error: 'Database error' };

[NoCoverage] StringLiteral
services/commandService.ts:13:13
 export const queueCommand = async (command: string) => {
     try {
         const [result] = await pool.query(
-            'INSERT INTO web_pending_commands (command) VALUES (?)',
+            "",
             [command]
         );

[NoCoverage] BooleanLiteral
services/commandService.ts:22:27
         sendToAll('REFRESH_COMMANDS');
 
         const insertId = (result as { insertId: number }).insertId;
-        return { success: true, id: insertId };
+        return { success: false, id: insertId };
     } catch (error) {
         console.error('[Command Queue] Failed to queue command:', error);

[NoCoverage] BlockStatement
services/commandService.ts:23:21
 
         const insertId = (result as { insertId: number }).insertId;
         return { success: true, id: insertId };
-    } catch (error) {
-        console.error('[Command Queue] Failed to queue command:', error);
-        return { success: false, error: 'Database error' };
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
services/commandService.ts:25:27
         return { success: true, id: insertId };
     } catch (error) {
         console.error('[Command Queue] Failed to queue command:', error);
-        return { success: false, error: 'Database error' };
+        return { success: true, error: 'Database error' };
     }
 };

[NoCoverage] StringLiteral
services/commandService.ts:25:41
         return { success: true, id: insertId };
     } catch (error) {
         console.error('[Command Queue] Failed to queue command:', error);
-        return { success: false, error: 'Database error' };
+        return { success: false, error: "" };
     }
 };

[NoCoverage] BlockStatement
services/commandService.ts:32:60
 /**
  * Queues multiple Minecraft commands sequentially.
  */
-export const queueCommands = async (commands: string[]) => {
-    if (commands.length === 0) return [];
-
-    const results = [];
-    for (const command of commands) {
-        results.push(await queueCommand(command));
-    }
-    return results;
-};
+export const queueCommands = async (commands: string[]) => {};
 
 

[NoCoverage] EqualityOperator
services/commandService.ts:33:9
  * Queues multiple Minecraft commands sequentially.
  */
 export const queueCommands = async (commands: string[]) => {
-    if (commands.length === 0) return [];
+    if (commands.length !== 0) return [];
 
     const results = [];

[NoCoverage] ConditionalExpression
services/commandService.ts:33:9
  * Queues multiple Minecraft commands sequentially.
  */
 export const queueCommands = async (commands: string[]) => {
-    if (commands.length === 0) return [];
+    if (false) return [];
 
     const results = [];

[NoCoverage] BlockStatement
services/commandService.ts:36:37
     if (commands.length === 0) return [];
 
     const results = [];
-    for (const command of commands) {
-        results.push(await queueCommand(command));
-    }
+    for (const command of commands) {}
     return results;
 };
