[NoCoverage] BlockStatement
services/eventService.ts:17:41
 }
 
 
-export const getAllEvents = async () => {
-    const { data, error } = await supabase
-        .from('events')
-        .select('*')
-        .order('created_at', { ascending: false });
-
-    if (error) throw error;
-    return data;
-};
+export const getAllEvents = async () => {};
 
 export const createEvent = async (eventData: Partial<Event>) => {

[NoCoverage] BlockStatement
services/eventService.ts:29:9
 
 export const createEvent = async (eventData: Partial<Event>) => {
     // Auto translation
-    try {
-        if (eventData.title && !eventData.title_en) {
-            eventData.title_en = await translateText(eventData.title, 'en');
-        }
-        if (eventData.description && !eventData.description_en) {
-            eventData.description_en = await translateText(eventData.description, 'en');
-        }
-    } catch (err) {
+    try {} catch (err) {
         console.error("Error translating event:", err);
     }

[NoCoverage] LogicalOperator
services/eventService.ts:30:13
 export const createEvent = async (eventData: Partial<Event>) => {
     // Auto translation
     try {
-        if (eventData.title && !eventData.title_en) {
+        if (eventData.title || !eventData.title_en) {
             eventData.title_en = await translateText(eventData.title, 'en');
         }

[NoCoverage] BooleanLiteral
services/eventService.ts:30:32
 export const createEvent = async (eventData: Partial<Event>) => {
     // Auto translation
     try {
-        if (eventData.title && !eventData.title_en) {
+        if (eventData.title && eventData.title_en) {
             eventData.title_en = await translateText(eventData.title, 'en');
         }

[NoCoverage] ConditionalExpression
services/eventService.ts:33:13
         if (eventData.title && !eventData.title_en) {
             eventData.title_en = await translateText(eventData.title, 'en');
         }
-        if (eventData.description && !eventData.description_en) {
+        if (false) {
             eventData.description_en = await translateText(eventData.description, 'en');
         }

[NoCoverage] BooleanLiteral
services/eventService.ts:33:38
         if (eventData.title && !eventData.title_en) {
             eventData.title_en = await translateText(eventData.title, 'en');
         }
-        if (eventData.description && !eventData.description_en) {
+        if (eventData.description && eventData.description_en) {
             eventData.description_en = await translateText(eventData.description, 'en');
         }

[NoCoverage] BlockStatement
services/eventService.ts:36:19
         if (eventData.description && !eventData.description_en) {
             eventData.description_en = await translateText(eventData.description, 'en');
         }
-    } catch (err) {
-        console.error("Error translating event:", err);
-    }
+    } catch (err) {}
 
     // Sanitize data (Optional: remove this block if you trust all inputs, but good for safety)

[NoCoverage] StringLiteral
services/eventService.ts:37:23
             eventData.description_en = await translateText(eventData.description, 'en');
         }
     } catch (err) {
-        console.error("Error translating event:", err);
+        console.error("", err);
     }
 

[NoCoverage] ObjectLiteral
services/eventService.ts:42:23
 
     // Sanitize data (Optional: remove this block if you trust all inputs, but good for safety)
     const { title, description, title_en, description_en, type, status, image_url } = eventData;
-    const cleanData = { title, description, title_en, description_en, type, status, image_url };
+    const cleanData = {};
 
     const { data, error } = await supabase

[NoCoverage] StringLiteral
services/eventService.ts:45:15
     const cleanData = { title, description, title_en, description_en, type, status, image_url };
 
     const { data, error } = await supabase
-        .from('events')
+        .from("")
         .insert([cleanData])
         .select();

[NoCoverage] BlockStatement
services/eventService.ts:49:16
         .insert([cleanData])
         .select();
 
-    if (error) {
-        console.error("Supabase CREATE Event Error:", JSON.stringify(error));
-        throw error;
-    }
+    if (error) {}
     return data[0];
 };

[NoCoverage] StringLiteral
services/eventService.ts:50:23
         .select();
 
     if (error) {
-        console.error("Supabase CREATE Event Error:", JSON.stringify(error));
+        console.error("", JSON.stringify(error));
         throw error;
     }

[NoCoverage] BlockStatement
services/eventService.ts:58:9
 
 export const updateEvent = async (id: number, updates: Partial<Event>) => {
     // Auto translation
-    try {
-        if (updates.title && !updates.title_en) {
-            updates.title_en = await translateText(updates.title, 'en');
-        }
-        if (updates.description && !updates.description_en) {
-            updates.description_en = await translateText(updates.description, 'en');
-        }
-    } catch (err) {
+    try {} catch (err) {
         console.error("Error translating event update:", err);
     }

[NoCoverage] BooleanLiteral
services/eventService.ts:59:30
 export const updateEvent = async (id: number, updates: Partial<Event>) => {
     // Auto translation
     try {
-        if (updates.title && !updates.title_en) {
+        if (updates.title && updates.title_en) {
             updates.title_en = await translateText(updates.title, 'en');
         }

[NoCoverage] BlockStatement
services/eventService.ts:59:49
 export const updateEvent = async (id: number, updates: Partial<Event>) => {
     // Auto translation
     try {
-        if (updates.title && !updates.title_en) {
-            updates.title_en = await translateText(updates.title, 'en');
-        }
+        if (updates.title && !updates.title_en) {}
         if (updates.description && !updates.description_en) {
             updates.description_en = await translateText(updates.description, 'en');

[NoCoverage] BooleanLiteral
services/eventService.ts:62:36
         if (updates.title && !updates.title_en) {
             updates.title_en = await translateText(updates.title, 'en');
         }
-        if (updates.description && !updates.description_en) {
+        if (updates.description && updates.description_en) {
             updates.description_en = await translateText(updates.description, 'en');
         }

[NoCoverage] LogicalOperator
services/eventService.ts:62:13
         if (updates.title && !updates.title_en) {
             updates.title_en = await translateText(updates.title, 'en');
         }
-        if (updates.description && !updates.description_en) {
+        if (updates.description || !updates.description_en) {
             updates.description_en = await translateText(updates.description, 'en');
         }

[NoCoverage] BlockStatement
services/eventService.ts:65:19
         if (updates.description && !updates.description_en) {
             updates.description_en = await translateText(updates.description, 'en');
         }
-    } catch (err) {
-        console.error("Error translating event update:", err);
-    }
+    } catch (err) {}
 
     // Sanitize updates

[NoCoverage] BlockStatement
services/eventService.ts:72:30
     // Sanitize updates
     const cleanUpdates: Record<string, unknown> = {};
     const allowed = ['title', 'description', 'title_en', 'description_en', 'type', 'status', 'image_url'] as const;
-    allowed.forEach(field => {
-        if (updates[field as keyof Event] !== undefined) {
-             cleanUpdates[field] = updates[field as keyof Event];
-        }
-    });
+    allowed.forEach(field => {});
 
     const { data, error } = await supabase

[NoCoverage] ConditionalExpression
services/eventService.ts:73:13
     const cleanUpdates: Record<string, unknown> = {};
     const allowed = ['title', 'description', 'title_en', 'description_en', 'type', 'status', 'image_url'] as const;
     allowed.forEach(field => {
-        if (updates[field as keyof Event] !== undefined) {
+        if (true) {
              cleanUpdates[field] = updates[field as keyof Event];
         }

[NoCoverage] EqualityOperator
services/eventService.ts:73:13
     const cleanUpdates: Record<string, unknown> = {};
     const allowed = ['title', 'description', 'title_en', 'description_en', 'type', 'status', 'image_url'] as const;
     allowed.forEach(field => {
-        if (updates[field as keyof Event] !== undefined) {
+        if (updates[field as keyof Event] === undefined) {
              cleanUpdates[field] = updates[field as keyof Event];
         }

[NoCoverage] BlockStatement
services/eventService.ts:88:50
     return data[0];
 };
 
-export const deleteEvent = async (id: number) => {
-    const { error } = await supabase
-        .from('events')
-        .delete()
-        .eq('id', id);
-
-    if (error) throw error;
-    return true;
-};
+export const deleteEvent = async (id: number) => {};
 
 export const registerUser = async (eventId: number, userId: string) => {

[NoCoverage] BooleanLiteral
services/eventService.ts:95:12
         .eq('id', id);
 
     if (error) throw error;
-    return true;
+    return false;
 };
 

[NoCoverage] BlockStatement
services/eventService.ts:98:72
     return true;
 };
 
-export const registerUser = async (eventId: number, userId: string) => {
-    // Check if already registered
-    const { data: existing } = await supabase
-        .from('event_registrations')
-        .select('*')
-        .eq('event_id', eventId)
-        .eq('user_id', userId)
-        .single();
-
-    if (existing) {
-        throw new Error("Ya estás inscrito en este evento");
-    }
-
-    const { data, error } = await supabase
-        .from('event_registrations')
-        .insert([{ event_id: eventId, user_id: userId }])
-        .select();
-
-    if (error) throw error;
-    return data[0];
-};
+export const registerUser = async (eventId: number, userId: string) => {};
 
 export const getRegistrations = async (eventId: number) => {

[NoCoverage] BlockStatement
services/eventService.ts:107:19
         .eq('user_id', userId)
         .single();
 
-    if (existing) {
-        throw new Error("Ya estás inscrito en este evento");
-    }
+    if (existing) {}
 
     const { data, error } = await supabase

[NoCoverage] StringLiteral
services/eventService.ts:108:25
         .single();
 
     if (existing) {
-        throw new Error("Ya estás inscrito en este evento");
+        throw new Error("");
     }
 

[NoCoverage] ArrayDeclaration
services/eventService.ts:113:17
 
     const { data, error } = await supabase
         .from('event_registrations')
-        .insert([{ event_id: eventId, user_id: userId }])
+        .insert([])
         .select();
 

[NoCoverage] StringLiteral
services/eventService.ts:122:15
 
 export const getRegistrations = async (eventId: number) => {
      const { data: regs, error } = await supabase
-        .from('event_registrations')
+        .from("")
         .select('*')
         .eq('event_id', eventId);

[NoCoverage] StringLiteral
services/eventService.ts:123:17
 export const getRegistrations = async (eventId: number) => {
      const { data: regs, error } = await supabase
         .from('event_registrations')
-        .select('*')
+        .select("")
         .eq('event_id', eventId);
     

[NoCoverage] StringLiteral
services/eventService.ts:124:13
      const { data: regs, error } = await supabase
         .from('event_registrations')
         .select('*')
-        .eq('event_id', eventId);
+        .eq("", eventId);
     
     if (error) {

[NoCoverage] StringLiteral
services/eventService.ts:127:23
         .eq('event_id', eventId);
     
     if (error) {
-        console.error("Supabase Error (event_registrations):", error);
+        console.error("", error);
         return [];
     }

[NoCoverage] ArrayDeclaration
services/eventService.ts:128:16
     
     if (error) {
         console.error("Supabase Error (event_registrations):", error);
-        return [];
+        return ["Stryker was here"];
     }
     if (!regs) return []; // Access check

[NoCoverage] BooleanLiteral
services/eventService.ts:130:9
         console.error("Supabase Error (event_registrations):", error);
         return [];
     }
-    if (!regs) return []; // Access check
+    if (regs) return []; // Access check
 
     // Fetch all users to map names (Since we don't have a public profiles table relation)

[NoCoverage] ConditionalExpression
services/eventService.ts:130:9
         console.error("Supabase Error (event_registrations):", error);
         return [];
     }
-    if (!regs) return []; // Access check
+    if (false) return []; // Access check
 
     // Fetch all users to map names (Since we don't have a public profiles table relation)

[NoCoverage] ConditionalExpression
services/eventService.ts:136:9
     // Using safer destructuring
     const userResponse = await supabase.auth.admin.listUsers();
     
-    if (userResponse.error) {
+    if (true) {
         console.error("Error fetching users for registrations:", userResponse.error);
         return regs.map((r) => ({ ...r, profiles: { username: 'Unknown', avatar_url: null } }));

[NoCoverage] ConditionalExpression
services/eventService.ts:136:9
     // Using safer destructuring
     const userResponse = await supabase.auth.admin.listUsers();
     
-    if (userResponse.error) {
+    if (false) {
         console.error("Error fetching users for registrations:", userResponse.error);
         return regs.map((r) => ({ ...r, profiles: { username: 'Unknown', avatar_url: null } }));

[NoCoverage] ArrowFunction
services/eventService.ts:138:25
     
     if (userResponse.error) {
         console.error("Error fetching users for registrations:", userResponse.error);
-        return regs.map((r) => ({ ...r, profiles: { username: 'Unknown', avatar_url: null } }));
+        return regs.map(() => undefined);
     }
 

[NoCoverage] StringLiteral
services/eventService.ts:138:63
     
     if (userResponse.error) {
         console.error("Error fetching users for registrations:", userResponse.error);
-        return regs.map((r) => ({ ...r, profiles: { username: 'Unknown', avatar_url: null } }));
+        return regs.map((r) => ({ ...r, profiles: { username: "", avatar_url: null } }));
     }
 

[NoCoverage] OptionalChaining
services/eventService.ts:141:19
         return regs.map((r) => ({ ...r, profiles: { username: 'Unknown', avatar_url: null } }));
     }
 
-    const users = userResponse.data?.users || [];
+    const users = userResponse.data.users || [];
 
     return regs.map((reg) => {

[NoCoverage] ConditionalExpression
services/eventService.ts:141:19
         return regs.map((r) => ({ ...r, profiles: { username: 'Unknown', avatar_url: null } }));
     }
 
-    const users = userResponse.data?.users || [];
+    const users = true;
 
     return regs.map((reg) => {

[NoCoverage] BlockStatement
services/eventService.ts:143:30
 
     const users = userResponse.data?.users || [];
 
-    return regs.map((reg) => {
-        const user = users.find((u) => u.id === reg.user_id);
-        const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
-        const avatar = user?.user_metadata?.avatar_url || null;
-
-        return {
-            ...reg,
-            profiles: {
-                username,
-                avatar_url: avatar
-            }
-        };
-    });
+    return regs.map((reg) => {});
 }
 

[NoCoverage] ConditionalExpression
services/eventService.ts:144:40
     const users = userResponse.data?.users || [];
 
     return regs.map((reg) => {
-        const user = users.find((u) => u.id === reg.user_id);
+        const user = users.find((u) => false);
         const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
         const avatar = user?.user_metadata?.avatar_url || null;

[NoCoverage] ArrowFunction
services/eventService.ts:144:33
     const users = userResponse.data?.users || [];
 
     return regs.map((reg) => {
-        const user = users.find((u) => u.id === reg.user_id);
+        const user = users.find(() => undefined);
         const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
         const avatar = user?.user_metadata?.avatar_url || null;

[NoCoverage] OptionalChaining
services/eventService.ts:145:26
 
     return regs.map((reg) => {
         const user = users.find((u) => u.id === reg.user_id);
-        const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
+        const username = user?.user_metadata.username || user?.user_metadata?.full_name || 'Desconocido';
         const avatar = user?.user_metadata?.avatar_url || null;
 

[NoCoverage] OptionalChaining
services/eventService.ts:145:59
 
     return regs.map((reg) => {
         const user = users.find((u) => u.id === reg.user_id);
-        const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
+        const username = user?.user_metadata?.username || user.user_metadata?.full_name || 'Desconocido';
         const avatar = user?.user_metadata?.avatar_url || null;
 

[NoCoverage] OptionalChaining
services/eventService.ts:146:24
     return regs.map((reg) => {
         const user = users.find((u) => u.id === reg.user_id);
         const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
-        const avatar = user?.user_metadata?.avatar_url || null;
+        const avatar = user.user_metadata?.avatar_url || null;
 
         return {

[NoCoverage] ConditionalExpression
services/eventService.ts:146:24
     return regs.map((reg) => {
         const user = users.find((u) => u.id === reg.user_id);
         const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
-        const avatar = user?.user_metadata?.avatar_url || null;
+        const avatar = true;
 
         return {

[NoCoverage] ObjectLiteral
services/eventService.ts:148:16
         const username = user?.user_metadata?.username || user?.user_metadata?.full_name || 'Desconocido';
         const avatar = user?.user_metadata?.avatar_url || null;
 
-        return {
-            ...reg,
-            profiles: {
-                username,
-                avatar_url: avatar
-            }
-        };
+        return {};
     });
 }

[NoCoverage] BlockStatement
services/eventService.ts:158:63
     });
 }
 
-export const getUserRegistrations = async (userId: string) => {
-    const { data, error } = await supabase
-        .from('event_registrations')
-        .select('event_id')
-        .eq('user_id', userId);
-
-    if (error) throw error;
-    return data.map((r) => r.event_id);
-}
+export const getUserRegistrations = async (userId: string) => {}
 

[NoCoverage] StringLiteral
services/eventService.ts:161:17
 export const getUserRegistrations = async (userId: string) => {
     const { data, error } = await supabase
         .from('event_registrations')
-        .select('event_id')
+        .select("")
         .eq('user_id', userId);
 

[NoCoverage] StringLiteral
services/eventService.ts:162:13
     const { data, error } = await supabase
         .from('event_registrations')
         .select('event_id')
-        .eq('user_id', userId);
+        .eq("", userId);
 
     if (error) throw error;

[NoCoverage] ArrowFunction
services/eventService.ts:165:21
         .eq('user_id', userId);
 
     if (error) throw error;
-    return data.map((r) => r.event_id);
+    return data.map(() => undefined);
 }
 
