[NoCoverage] BlockStatement
services/gachaBalanceService.ts:11:84
     minecraft_name: string | null;
 }
 
-async function syncSupabaseBalance(userId: string, balance: number): Promise<void> {
-    await supabase.from('profiles').update({ gacha_balance: balance }).eq('id', userId);
-
-    try {
-        const { data: { user } } = await supabase.auth.admin.getUserById(userId);
-        if (!user) return;
-        await supabase.auth.admin.updateUserById(userId, {
-            user_metadata: { ...user.user_metadata, gacha_balance: balance },
-        });
-    } catch (error) {
-        console.error('[GachaBalance] Metadata sync failed (non-fatal):', error);
-    }
-}
+async function syncSupabaseBalance(userId: string, balance: number): Promise<void> {}
 
 export async function getGachaBalance(userId: string): Promise<number> {

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:12:25
 }
 
 async function syncSupabaseBalance(userId: string, balance: number): Promise<void> {
-    await supabase.from('profiles').update({ gacha_balance: balance }).eq('id', userId);
+    await supabase.from("").update({ gacha_balance: balance }).eq('id', userId);
 
     try {

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:14:9
 async function syncSupabaseBalance(userId: string, balance: number): Promise<void> {
     await supabase.from('profiles').update({ gacha_balance: balance }).eq('id', userId);
 
-    try {
-        const { data: { user } } = await supabase.auth.admin.getUserById(userId);
-        if (!user) return;
-        await supabase.auth.admin.updateUserById(userId, {
-            user_metadata: { ...user.user_metadata, gacha_balance: balance },
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error('[GachaBalance] Metadata sync failed (non-fatal):', error);
     }

[NoCoverage] BooleanLiteral
services/gachaBalanceService.ts:16:13
 
     try {
         const { data: { user } } = await supabase.auth.admin.getUserById(userId);
-        if (!user) return;
+        if (user) return;
         await supabase.auth.admin.updateUserById(userId, {
             user_metadata: { ...user.user_metadata, gacha_balance: balance },

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:16:13
 
     try {
         const { data: { user } } = await supabase.auth.admin.getUserById(userId);
-        if (!user) return;
+        if (true) return;
         await supabase.auth.admin.updateUserById(userId, {
             user_metadata: { ...user.user_metadata, gacha_balance: balance },

[NoCoverage] ObjectLiteral
services/gachaBalanceService.ts:17:58
     try {
         const { data: { user } } = await supabase.auth.admin.getUserById(userId);
         if (!user) return;
-        await supabase.auth.admin.updateUserById(userId, {
-            user_metadata: { ...user.user_metadata, gacha_balance: balance },
-        });
+        await supabase.auth.admin.updateUserById(userId, {});
     } catch (error) {
         console.error('[GachaBalance] Metadata sync failed (non-fatal):', error);

[NoCoverage] ObjectLiteral
services/gachaBalanceService.ts:18:28
         const { data: { user } } = await supabase.auth.admin.getUserById(userId);
         if (!user) return;
         await supabase.auth.admin.updateUserById(userId, {
-            user_metadata: { ...user.user_metadata, gacha_balance: balance },
+            user_metadata: {},
         });
     } catch (error) {

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:20:21
         await supabase.auth.admin.updateUserById(userId, {
             user_metadata: { ...user.user_metadata, gacha_balance: balance },
         });
-    } catch (error) {
-        console.error('[GachaBalance] Metadata sync failed (non-fatal):', error);
-    }
+    } catch (error) {}
 }
 

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:25:72
     }
 }
 
-export async function getGachaBalance(userId: string): Promise<number> {
-    try {
-        const [rows] = await pool.execute<LinkedAccountRow[]>(
-            'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-            [userId]
-        );
-
-        if (rows.length > 0 && rows[0].gacha_balance != null) {
-            return Number(rows[0].gacha_balance);
-        }
-    } catch (error) {
-        console.error('[GachaBalance] MySQL read failed, falling back to Supabase:', error);
-    }
-
-    const { data: profile } = await supabase
-        .from('profiles')
-        .select('gacha_balance')
-        .eq('id', userId)
-        .single();
-
-    return Number(profile?.gacha_balance ?? 0);
-}
+export async function getGachaBalance(userId: string): Promise<number> {}
 
 export async function deductGachaBalance(userId: string, amount: number): Promise<number> {

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:26:9
 }
 
 export async function getGachaBalance(userId: string): Promise<number> {
-    try {
-        const [rows] = await pool.execute<LinkedAccountRow[]>(
-            'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-            [userId]
-        );
-
-        if (rows.length > 0 && rows[0].gacha_balance != null) {
-            return Number(rows[0].gacha_balance);
-        }
-    } catch (error) {
+    try {} catch (error) {
         console.error('[GachaBalance] MySQL read failed, falling back to Supabase:', error);
     }

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:28:13
 export async function getGachaBalance(userId: string): Promise<number> {
     try {
         const [rows] = await pool.execute<LinkedAccountRow[]>(
-            'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
+            "",
             [userId]
         );

[NoCoverage] ArrayDeclaration
services/gachaBalanceService.ts:29:13
     try {
         const [rows] = await pool.execute<LinkedAccountRow[]>(
             'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-            [userId]
+            []
         );
 

[NoCoverage] EqualityOperator
services/gachaBalanceService.ts:32:32
             [userId]
         );
 
-        if (rows.length > 0 && rows[0].gacha_balance != null) {
+        if (rows.length > 0 && rows[0].gacha_balance == null) {
             return Number(rows[0].gacha_balance);
         }

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:32:63
             [userId]
         );
 
-        if (rows.length > 0 && rows[0].gacha_balance != null) {
-            return Number(rows[0].gacha_balance);
-        }
+        if (rows.length > 0 && rows[0].gacha_balance != null) {}
     } catch (error) {
         console.error('[GachaBalance] MySQL read failed, falling back to Supabase:', error);

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:35:21
         if (rows.length > 0 && rows[0].gacha_balance != null) {
             return Number(rows[0].gacha_balance);
         }
-    } catch (error) {
-        console.error('[GachaBalance] MySQL read failed, falling back to Supabase:', error);
-    }
+    } catch (error) {}
 
     const { data: profile } = await supabase

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:36:23
             return Number(rows[0].gacha_balance);
         }
     } catch (error) {
-        console.error('[GachaBalance] MySQL read failed, falling back to Supabase:', error);
+        console.error("", error);
     }
 

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:41:17
 
     const { data: profile } = await supabase
         .from('profiles')
-        .select('gacha_balance')
+        .select("")
         .eq('id', userId)
         .single();

[NoCoverage] LogicalOperator
services/gachaBalanceService.ts:45:19
         .eq('id', userId)
         .single();
 
-    return Number(profile?.gacha_balance ?? 0);
+    return Number(profile?.gacha_balance && 0);
 }
 

[NoCoverage] OptionalChaining
services/gachaBalanceService.ts:45:19
         .eq('id', userId)
         .single();
 
-    return Number(profile?.gacha_balance ?? 0);
+    return Number(profile.gacha_balance ?? 0);
 }
 

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:49:9
 }
 
 export async function deductGachaBalance(userId: string, amount: number): Promise<number> {
-    if (amount <= 0) return getGachaBalance(userId);
+    if (false) return getGachaBalance(userId);
 
     try {

[NoCoverage] EqualityOperator
services/gachaBalanceService.ts:49:9
 }
 
 export async function deductGachaBalance(userId: string, amount: number): Promise<number> {
-    if (amount <= 0) return getGachaBalance(userId);
+    if (amount > 0) return getGachaBalance(userId);
 
     try {

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:51:9
 export async function deductGachaBalance(userId: string, amount: number): Promise<number> {
     if (amount <= 0) return getGachaBalance(userId);
 
-    try {
-        const [result] = await pool.execute<ResultSetHeader>(
-            'UPDATE linked_accounts SET gacha_balance = gacha_balance - ? WHERE web_user_id = ? AND gacha_balance >= ?',
-            [amount, userId, amount]
-        );
-
-        if (result.affectedRows > 0) {
-            const [rows] = await pool.execute<LinkedAccountRow[]>(
-                'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-                [userId]
-            );
-            const newBalance = Number(rows[0]?.gacha_balance ?? 0);
-            await syncSupabaseBalance(userId, newBalance);
-            return newBalance;
-        }
-    } catch (error) {
+    try {} catch (error) {
         console.error('[GachaBalance] MySQL deduct failed, trying Supabase:', error);
     }

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:53:13
 
     try {
         const [result] = await pool.execute<ResultSetHeader>(
-            'UPDATE linked_accounts SET gacha_balance = gacha_balance - ? WHERE web_user_id = ? AND gacha_balance >= ?',
+            "",
             [amount, userId, amount]
         );

[NoCoverage] EqualityOperator
services/gachaBalanceService.ts:57:13
             [amount, userId, amount]
         );
 
-        if (result.affectedRows > 0) {
+        if (result.affectedRows >= 0) {
             const [rows] = await pool.execute<LinkedAccountRow[]>(
                 'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:57:13
             [amount, userId, amount]
         );
 
-        if (result.affectedRows > 0) {
+        if (false) {
             const [rows] = await pool.execute<LinkedAccountRow[]>(
                 'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',

[NoCoverage] LogicalOperator
services/gachaBalanceService.ts:62:39
                 'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
                 [userId]
             );
-            const newBalance = Number(rows[0]?.gacha_balance ?? 0);
+            const newBalance = Number(rows[0]?.gacha_balance && 0);
             await syncSupabaseBalance(userId, newBalance);
             return newBalance;

[NoCoverage] OptionalChaining
services/gachaBalanceService.ts:62:39
                 'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
                 [userId]
             );
-            const newBalance = Number(rows[0]?.gacha_balance ?? 0);
+            const newBalance = Number(rows[0].gacha_balance ?? 0);
             await syncSupabaseBalance(userId, newBalance);
             return newBalance;

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:66:21
             await syncSupabaseBalance(userId, newBalance);
             return newBalance;
         }
-    } catch (error) {
-        console.error('[GachaBalance] MySQL deduct failed, trying Supabase:', error);
-    }
+    } catch (error) {}
 
     const currentBalance = await getGachaBalance(userId);

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:71:34
     }
 
     const currentBalance = await getGachaBalance(userId);
-    if (currentBalance < amount) {
-        throw new Error('INSUFFICIENT_BALANCE');
-    }
+    if (currentBalance < amount) {}
 
     const newBalance = currentBalance - amount;

[NoCoverage] EqualityOperator
services/gachaBalanceService.ts:71:9
     }
 
     const currentBalance = await getGachaBalance(userId);
-    if (currentBalance < amount) {
+    if (currentBalance <= amount) {
         throw new Error('INSUFFICIENT_BALANCE');
     }

[NoCoverage] ArithmeticOperator
services/gachaBalanceService.ts:75:24
         throw new Error('INSUFFICIENT_BALANCE');
     }
 
-    const newBalance = currentBalance - amount;
+    const newBalance = currentBalance + amount;
     const { data, error } = await supabase
         .from('profiles')

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:77:15
 
     const newBalance = currentBalance - amount;
     const { data, error } = await supabase
-        .from('profiles')
+        .from("")
         .update({ gacha_balance: newBalance })
         .eq('id', userId)

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:79:13
     const { data, error } = await supabase
         .from('profiles')
         .update({ gacha_balance: newBalance })
-        .eq('id', userId)
+        .eq("", userId)
         .gte('gacha_balance', amount)
         .select('gacha_balance')

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:81:17
         .update({ gacha_balance: newBalance })
         .eq('id', userId)
         .gte('gacha_balance', amount)
-        .select('gacha_balance')
+        .select("")
         .single();
 

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:84:9
         .select('gacha_balance')
         .single();
 
-    if (error || !data) {
+    if (false) {
         throw new Error('BALANCE_DEDUCTION_FAILED');
     }

[NoCoverage] LogicalOperator
services/gachaBalanceService.ts:84:9
         .select('gacha_balance')
         .single();
 
-    if (error || !data) {
+    if (error && !data) {
         throw new Error('BALANCE_DEDUCTION_FAILED');
     }

[NoCoverage] EqualityOperator
services/gachaBalanceService.ts:94:9
 }
 
 export async function refundGachaBalance(userId: string, amount: number): Promise<void> {
-    if (amount <= 0) return;
+    if (amount > 0) return;
 
     try {

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:94:9
 }
 
 export async function refundGachaBalance(userId: string, amount: number): Promise<void> {
-    if (amount <= 0) return;
+    if (false) return;
 
     try {

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:96:9
 export async function refundGachaBalance(userId: string, amount: number): Promise<void> {
     if (amount <= 0) return;
 
-    try {
-        const [result] = await pool.execute<ResultSetHeader>(
-            'UPDATE linked_accounts SET gacha_balance = gacha_balance + ? WHERE web_user_id = ?',
-            [amount, userId]
-        );
-
-        if (result.affectedRows > 0) {
-            const [rows] = await pool.execute<LinkedAccountRow[]>(
-                'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-                [userId]
-            );
-            const newBalance = Number(rows[0]?.gacha_balance ?? 0);
-            await syncSupabaseBalance(userId, newBalance);
-            return;
-        }
-    } catch (error) {
+    try {} catch (error) {
         console.error('[GachaBalance] MySQL refund failed, trying Supabase:', error);
     }

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:102:13
             [amount, userId]
         );
 
-        if (result.affectedRows > 0) {
+        if (true) {
             const [rows] = await pool.execute<LinkedAccountRow[]>(
                 'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:102:38
             [amount, userId]
         );
 
-        if (result.affectedRows > 0) {
-            const [rows] = await pool.execute<LinkedAccountRow[]>(
-                'SELECT gacha_balance FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-                [userId]
-            );
-            const newBalance = Number(rows[0]?.gacha_balance ?? 0);
-            await syncSupabaseBalance(userId, newBalance);
-            return;
-        }
+        if (result.affectedRows > 0) {}
     } catch (error) {
         console.error('[GachaBalance] MySQL refund failed, trying Supabase:', error);

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:111:21
             await syncSupabaseBalance(userId, newBalance);
             return;
         }
-    } catch (error) {
-        console.error('[GachaBalance] MySQL refund failed, trying Supabase:', error);
-    }
+    } catch (error) {}
 
     const currentBalance = await getGachaBalance(userId);

[NoCoverage] ArithmeticOperator
services/gachaBalanceService.ts:116:24
     }
 
     const currentBalance = await getGachaBalance(userId);
-    const newBalance = currentBalance + amount;
+    const newBalance = currentBalance - amount;
     await supabase.from('profiles').update({ gacha_balance: newBalance }).eq('id', userId);
     await syncSupabaseBalance(userId, newBalance);

[NoCoverage] ObjectLiteral
services/gachaBalanceService.ts:117:44
 
     const currentBalance = await getGachaBalance(userId);
     const newBalance = currentBalance + amount;
-    await supabase.from('profiles').update({ gacha_balance: newBalance }).eq('id', userId);
+    await supabase.from('profiles').update({}).eq('id', userId);
     await syncSupabaseBalance(userId, newBalance);
 }

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:117:78
 
     const currentBalance = await getGachaBalance(userId);
     const newBalance = currentBalance + amount;
-    await supabase.from('profiles').update({ gacha_balance: newBalance }).eq('id', userId);
+    await supabase.from('profiles').update({ gacha_balance: newBalance }).eq("", userId);
     await syncSupabaseBalance(userId, newBalance);
 }

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:121:75
     await syncSupabaseBalance(userId, newBalance);
 }
 
-export async function getUnlockedTiers(userId: string): Promise<string[]> {
-    try {
-        const [rows] = await pool.execute<LinkedAccountRow[]>(
-            'SELECT unlocked_tiers FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-            [userId]
-        );
-
-        if (rows.length === 0 || !rows[0].unlocked_tiers) return [];
-
-        return rows[0].unlocked_tiers
-            .replace(/[[\]"]/g, '')
-            .split(',')
-            .map((tier) => tier.trim().toLowerCase())
-            .filter(Boolean);
-    } catch (error) {
-        console.error('[GachaBalance] Failed to read unlocked tiers:', error);
-        return [];
-    }
-}
+export async function getUnlockedTiers(userId: string): Promise<string[]> {}
 
 export async function getLinkedMinecraftNick(userId: string): Promise<string | null> {

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:122:9
 }
 
 export async function getUnlockedTiers(userId: string): Promise<string[]> {
-    try {
-        const [rows] = await pool.execute<LinkedAccountRow[]>(
-            'SELECT unlocked_tiers FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-            [userId]
-        );
-
-        if (rows.length === 0 || !rows[0].unlocked_tiers) return [];
-
-        return rows[0].unlocked_tiers
-            .replace(/[[\]"]/g, '')
-            .split(',')
-            .map((tier) => tier.trim().toLowerCase())
-            .filter(Boolean);
-    } catch (error) {
+    try {} catch (error) {
         console.error('[GachaBalance] Failed to read unlocked tiers:', error);
         return [];

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:128:13
             [userId]
         );
 
-        if (rows.length === 0 || !rows[0].unlocked_tiers) return [];
+        if (false) return [];
 
         return rows[0].unlocked_tiers

[NoCoverage] ConditionalExpression
services/gachaBalanceService.ts:128:13
             [userId]
         );
 
-        if (rows.length === 0 || !rows[0].unlocked_tiers) return [];
+        if (false || !rows[0].unlocked_tiers) return [];
 
         return rows[0].unlocked_tiers

[NoCoverage] MethodExpression
services/gachaBalanceService.ts:130:16
 
         if (rows.length === 0 || !rows[0].unlocked_tiers) return [];
 
-        return rows[0].unlocked_tiers
-            .replace(/[[\]"]/g, '')
-            .split(',')
-            .map((tier) => tier.trim().toLowerCase())
-            .filter(Boolean);
+        return rows[0].unlocked_tiers.replace(/[[\]"]/g, '').split(',').map(tier => tier.trim().toLowerCase());
     } catch (error) {
         console.error('[GachaBalance] Failed to read unlocked tiers:', error);

[NoCoverage] MethodExpression
services/gachaBalanceService.ts:133:28
         return rows[0].unlocked_tiers
             .replace(/[[\]"]/g, '')
             .split(',')
-            .map((tier) => tier.trim().toLowerCase())
+            .map((tier) => tier.trim().toUpperCase())
             .filter(Boolean);
     } catch (error) {

[NoCoverage] MethodExpression
services/gachaBalanceService.ts:133:28
         return rows[0].unlocked_tiers
             .replace(/[[\]"]/g, '')
             .split(',')
-            .map((tier) => tier.trim().toLowerCase())
+            .map((tier) => tier.toLowerCase())
             .filter(Boolean);
     } catch (error) {

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:135:21
             .split(',')
             .map((tier) => tier.trim().toLowerCase())
             .filter(Boolean);
-    } catch (error) {
-        console.error('[GachaBalance] Failed to read unlocked tiers:', error);
-        return [];
-    }
+    } catch (error) {}
 }
 

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:141:86
     }
 }
 
-export async function getLinkedMinecraftNick(userId: string): Promise<string | null> {
-    try {
-        const [rows] = await pool.execute<LinkedAccountRow[]>(
-            'SELECT minecraft_name FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-            [userId]
-        );
-        if (rows.length > 0 && rows[0].minecraft_name) {
-            return rows[0].minecraft_name;
-        }
-    } catch (error) {
-        console.error('[GachaBalance] MySQL nick lookup failed:', error);
-    }
-
-    const { data: profile } = await supabase
-        .from('profiles')
-        .select('minecraft_nick')
-        .eq('id', userId)
-        .single();
-
-    return profile?.minecraft_nick ?? null;
-}
+export async function getLinkedMinecraftNick(userId: string): Promise<string | null> {}
 

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:142:9
 }
 
 export async function getLinkedMinecraftNick(userId: string): Promise<string | null> {
-    try {
-        const [rows] = await pool.execute<LinkedAccountRow[]>(
-            'SELECT minecraft_name FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
-            [userId]
-        );
-        if (rows.length > 0 && rows[0].minecraft_name) {
-            return rows[0].minecraft_name;
-        }
-    } catch (error) {
+    try {} catch (error) {
         console.error('[GachaBalance] MySQL nick lookup failed:', error);
     }

[NoCoverage] EqualityOperator
services/gachaBalanceService.ts:147:13
             'SELECT minecraft_name FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
             [userId]
         );
-        if (rows.length > 0 && rows[0].minecraft_name) {
+        if (rows.length >= 0 && rows[0].minecraft_name) {
             return rows[0].minecraft_name;
         }

[NoCoverage] EqualityOperator
services/gachaBalanceService.ts:147:13
             'SELECT minecraft_name FROM linked_accounts WHERE web_user_id = ? LIMIT 1',
             [userId]
         );
-        if (rows.length > 0 && rows[0].minecraft_name) {
+        if (rows.length <= 0 && rows[0].minecraft_name) {
             return rows[0].minecraft_name;
         }

[NoCoverage] BlockStatement
services/gachaBalanceService.ts:150:21
         if (rows.length > 0 && rows[0].minecraft_name) {
             return rows[0].minecraft_name;
         }
-    } catch (error) {
-        console.error('[GachaBalance] MySQL nick lookup failed:', error);
-    }
+    } catch (error) {}
 
     const { data: profile } = await supabase

[NoCoverage] StringLiteral
services/gachaBalanceService.ts:156:17
 
     const { data: profile } = await supabase
         .from('profiles')
-        .select('minecraft_nick')
+        .select("")
         .eq('id', userId)
         .single();

[NoCoverage] OptionalChaining
services/gachaBalanceService.ts:160:12
         .eq('id', userId)
         .single();
 
-    return profile?.minecraft_nick ?? null;
+    return profile.minecraft_nick ?? null;
 }
 

[NoCoverage] LogicalOperator
services/gachaBalanceService.ts:160:12
         .eq('id', userId)
         .single();
 
-    return profile?.minecraft_nick ?? null;
+    return profile?.minecraft_nick && null;
 }
 
