[NoCoverage] BlockStatement
services/gachaService.ts:25:89
 
 validateGachaTierWeights();
 
-const resolveHasFreeRoll = async (userId: string, tierKey: string): Promise<boolean> => {
-    const { data: hasEverRolled } = await supabase
-        .from('gacha_history')
-        .select('id')
-        .eq('user_id', userId)
-        .ilike('reward_id', `${TIER_PREFIXES[tierKey]}%`)
-        .limit(1);
-
-    const isFirstTime = !hasEverRolled || hasEverRolled.length === 0;
-    if (isFirstTime) return true;
-
-    const cooldownHours = TIER_COOLDOWNS[tierKey] ?? 24;
-    return checkCooldown(userId, tierKey, cooldownHours);
-};
+const resolveHasFreeRoll = async (userId: string, tierKey: string): Promise<boolean> => {};
 
 export const getGachaStatus = async (userId: string) => {

[NoCoverage] StringLiteral
services/gachaService.ts:29:13
     const { data: hasEverRolled } = await supabase
         .from('gacha_history')
         .select('id')
-        .eq('user_id', userId)
+        .eq("", userId)
         .ilike('reward_id', `${TIER_PREFIXES[tierKey]}%`)
         .limit(1);

[NoCoverage] StringLiteral
services/gachaService.ts:30:29
         .from('gacha_history')
         .select('id')
         .eq('user_id', userId)
-        .ilike('reward_id', `${TIER_PREFIXES[tierKey]}%`)
+        .ilike('reward_id', ``)
         .limit(1);
 

[NoCoverage] LogicalOperator
services/gachaService.ts:33:25
         .ilike('reward_id', `${TIER_PREFIXES[tierKey]}%`)
         .limit(1);
 
-    const isFirstTime = !hasEverRolled || hasEverRolled.length === 0;
+    const isFirstTime = !hasEverRolled && hasEverRolled.length === 0;
     if (isFirstTime) return true;
 

[NoCoverage] EqualityOperator
services/gachaService.ts:33:43
         .ilike('reward_id', `${TIER_PREFIXES[tierKey]}%`)
         .limit(1);
 
-    const isFirstTime = !hasEverRolled || hasEverRolled.length === 0;
+    const isFirstTime = !hasEverRolled || hasEverRolled.length !== 0;
     if (isFirstTime) return true;
 

[NoCoverage] ConditionalExpression
services/gachaService.ts:34:9
         .limit(1);
 
     const isFirstTime = !hasEverRolled || hasEverRolled.length === 0;
-    if (isFirstTime) return true;
+    if (true) return true;
 
     const cooldownHours = TIER_COOLDOWNS[tierKey] ?? 24;

[NoCoverage] ConditionalExpression
services/gachaService.ts:34:9
         .limit(1);
 
     const isFirstTime = !hasEverRolled || hasEverRolled.length === 0;
-    if (isFirstTime) return true;
+    if (false) return true;
 
     const cooldownHours = TIER_COOLDOWNS[tierKey] ?? 24;

[NoCoverage] LogicalOperator
services/gachaService.ts:36:27
     const isFirstTime = !hasEverRolled || hasEverRolled.length === 0;
     if (isFirstTime) return true;
 
-    const cooldownHours = TIER_COOLDOWNS[tierKey] ?? 24;
+    const cooldownHours = TIER_COOLDOWNS[tierKey] && 24;
     return checkCooldown(userId, tierKey, cooldownHours);
 };

[NoCoverage] BlockStatement
services/gachaService.ts:40:57
     return checkCooldown(userId, tierKey, cooldownHours);
 };
 
-export const getGachaStatus = async (userId: string) => {
-    const [balance, unlockedTiers] = await Promise.all([
-        getGachaBalance(userId),
-        getUnlockedTiers(userId),
-    ]);
-
-    const tierStatus: Record<string, { hasFreeRoll: boolean; cooldownHours: number }> = {};
-
-    await Promise.all(
-        Object.keys(GACHA_TIERS_MAP).map(async (tierId) => {
-            tierStatus[tierId] = {
-                hasFreeRoll: await resolveHasFreeRoll(userId, tierId),
-                cooldownHours: TIER_COOLDOWNS[tierId] ?? 24,
-            };
-        })
-    );
-
-    return { balance, unlockedTiers, tiers: tierStatus };
-};
+export const getGachaStatus = async (userId: string) => {};
 
 export const rollGacha = async (

[NoCoverage] BlockStatement
services/gachaService.ts:49:60
     const tierStatus: Record<string, { hasFreeRoll: boolean; cooldownHours: number }> = {};
 
     await Promise.all(
-        Object.keys(GACHA_TIERS_MAP).map(async (tierId) => {
-            tierStatus[tierId] = {
-                hasFreeRoll: await resolveHasFreeRoll(userId, tierId),
-                cooldownHours: TIER_COOLDOWNS[tierId] ?? 24,
-            };
-        })
+        Object.keys(GACHA_TIERS_MAP).map(async (tierId) => {})
     );
 

[NoCoverage] LogicalOperator
services/gachaService.ts:52:32
         Object.keys(GACHA_TIERS_MAP).map(async (tierId) => {
             tierStatus[tierId] = {
                 hasFreeRoll: await resolveHasFreeRoll(userId, tierId),
-                cooldownHours: TIER_COOLDOWNS[tierId] ?? 24,
+                cooldownHours: TIER_COOLDOWNS[tierId] && 24,
             };
         })

[NoCoverage] BooleanLiteral
services/gachaService.ts:64:24
     userId: string,
     tierId: string = 'bronze',
     quantity: number = 1,
-    isAdmin: boolean = false,
+    isAdmin: boolean = true,
     testResult?: 'win' | 'loss' | 'random',
     forceDeduction: boolean = false

[NoCoverage] BooleanLiteral
services/gachaService.ts:66:31
     quantity: number = 1,
     isAdmin: boolean = false,
     testResult?: 'win' | 'loss' | 'random',
-    forceDeduction: boolean = false
+    forceDeduction: boolean = true
 ) => {
     const tierKey = tierId.toLowerCase();

[NoCoverage] MethodExpression
services/gachaService.ts:68:21
     testResult?: 'win' | 'loss' | 'random',
     forceDeduction: boolean = false
 ) => {
-    const tierKey = tierId.toLowerCase();
+    const tierKey = tierId.toUpperCase();
     const tier = GACHA_TIERS_MAP[tierKey];
     if (!tier) throw new Error('INVALID_TIER');

[NoCoverage] ConditionalExpression
services/gachaService.ts:70:9
 ) => {
     const tierKey = tierId.toLowerCase();
     const tier = GACHA_TIERS_MAP[tierKey];
-    if (!tier) throw new Error('INVALID_TIER');
+    if (true) throw new Error('INVALID_TIER');
 
     if (EVENT_ONLY_TIERS.has(tierKey) && !isAdmin) {

[NoCoverage] ConditionalExpression
services/gachaService.ts:70:9
 ) => {
     const tierKey = tierId.toLowerCase();
     const tier = GACHA_TIERS_MAP[tierKey];
-    if (!tier) throw new Error('INVALID_TIER');
+    if (false) throw new Error('INVALID_TIER');
 
     if (EVENT_ONLY_TIERS.has(tierKey) && !isAdmin) {

[NoCoverage] LogicalOperator
services/gachaService.ts:72:9
     const tier = GACHA_TIERS_MAP[tierKey];
     if (!tier) throw new Error('INVALID_TIER');
 
-    if (EVENT_ONLY_TIERS.has(tierKey) && !isAdmin) {
+    if (EVENT_ONLY_TIERS.has(tierKey) || !isAdmin) {
         const unlockedTiers = await getUnlockedTiers(userId);
         if (!unlockedTiers.includes(tierKey)) {

[NoCoverage] ConditionalExpression
services/gachaService.ts:72:9
     const tier = GACHA_TIERS_MAP[tierKey];
     if (!tier) throw new Error('INVALID_TIER');
 
-    if (EVENT_ONLY_TIERS.has(tierKey) && !isAdmin) {
+    if (true) {
         const unlockedTiers = await getUnlockedTiers(userId);
         if (!unlockedTiers.includes(tierKey)) {

[NoCoverage] BlockStatement
services/gachaService.ts:74:47
 
     if (EVENT_ONLY_TIERS.has(tierKey) && !isAdmin) {
         const unlockedTiers = await getUnlockedTiers(userId);
-        if (!unlockedTiers.includes(tierKey)) {
-            throw new Error('TIER_LOCKED');
-        }
+        if (!unlockedTiers.includes(tierKey)) {}
     }
 

[NoCoverage] BooleanLiteral
services/gachaService.ts:74:13
 
     if (EVENT_ONLY_TIERS.has(tierKey) && !isAdmin) {
         const unlockedTiers = await getUnlockedTiers(userId);
-        if (!unlockedTiers.includes(tierKey)) {
+        if (unlockedTiers.includes(tierKey)) {
             throw new Error('TIER_LOCKED');
         }

[NoCoverage] StringLiteral
services/gachaService.ts:75:29
     if (EVENT_ONLY_TIERS.has(tierKey) && !isAdmin) {
         const unlockedTiers = await getUnlockedTiers(userId);
         if (!unlockedTiers.includes(tierKey)) {
-            throw new Error('TIER_LOCKED');
+            throw new Error("");
         }
     }

[NoCoverage] BooleanLiteral
services/gachaService.ts:80:9
     }
 
     const minecraftNick = await getLinkedMinecraftNick(userId);
-    if (!minecraftNick) throw new Error('ACCOUNT_NOT_LINKED');
+    if (minecraftNick) throw new Error('ACCOUNT_NOT_LINKED');
 
     const hasFreeRoll = await resolveHasFreeRoll(userId, tierKey);

[NoCoverage] ConditionalExpression
services/gachaService.ts:80:9
     }
 
     const minecraftNick = await getLinkedMinecraftNick(userId);
-    if (!minecraftNick) throw new Error('ACCOUNT_NOT_LINKED');
+    if (false) throw new Error('ACCOUNT_NOT_LINKED');
 
     const hasFreeRoll = await resolveHasFreeRoll(userId, tierKey);

[NoCoverage] MethodExpression
services/gachaService.ts:84:23
 
     const hasFreeRoll = await resolveHasFreeRoll(userId, tierKey);
     const totalCost = hasFreeRoll
-        ? tier.cost * Math.max(0, quantity - 1)
+        ? tier.cost * Math.min(0, quantity - 1)
         : tier.cost * quantity;
 

[NoCoverage] ArithmeticOperator
services/gachaService.ts:84:11
 
     const hasFreeRoll = await resolveHasFreeRoll(userId, tierKey);
     const totalCost = hasFreeRoll
-        ? tier.cost * Math.max(0, quantity - 1)
+        ? tier.cost / Math.max(0, quantity - 1)
         : tier.cost * quantity;
 

[NoCoverage] ArithmeticOperator
services/gachaService.ts:85:11
     const hasFreeRoll = await resolveHasFreeRoll(userId, tierKey);
     const totalCost = hasFreeRoll
         ? tier.cost * Math.max(0, quantity - 1)
-        : tier.cost * quantity;
+        : tier.cost / quantity;
 
     const skipAllConsumption = isAdmin && !forceDeduction;

[NoCoverage] ConditionalExpression
services/gachaService.ts:87:32
         ? tier.cost * Math.max(0, quantity - 1)
         : tier.cost * quantity;
 
-    const skipAllConsumption = isAdmin && !forceDeduction;
+    const skipAllConsumption = true;
     const currentBalance = await getGachaBalance(userId);
 

[NoCoverage] BooleanLiteral
services/gachaService.ts:87:43
         ? tier.cost * Math.max(0, quantity - 1)
         : tier.cost * quantity;
 
-    const skipAllConsumption = isAdmin && !forceDeduction;
+    const skipAllConsumption = isAdmin && forceDeduction;
     const currentBalance = await getGachaBalance(userId);
 

[NoCoverage] ConditionalExpression
services/gachaService.ts:90:9
     const skipAllConsumption = isAdmin && !forceDeduction;
     const currentBalance = await getGachaBalance(userId);
 
-    if (!skipAllConsumption && totalCost > 0 && currentBalance < totalCost) {
+    if (true) {
         throw new Error('INSUFFICIENT_BALANCE');
     }

[NoCoverage] ConditionalExpression
services/gachaService.ts:90:9
     const skipAllConsumption = isAdmin && !forceDeduction;
     const currentBalance = await getGachaBalance(userId);
 
-    if (!skipAllConsumption && totalCost > 0 && currentBalance < totalCost) {
+    if (true && currentBalance < totalCost) {
         throw new Error('INSUFFICIENT_BALANCE');
     }

[NoCoverage] StringLiteral
services/gachaService.ts:91:25
     const currentBalance = await getGachaBalance(userId);
 
     if (!skipAllConsumption && totalCost > 0 && currentBalance < totalCost) {
-        throw new Error('INSUFFICIENT_BALANCE');
+        throw new Error("");
     }
 

[NoCoverage] BooleanLiteral
services/gachaService.ts:95:20
     }
 
     let newBalance = currentBalance;
-    let deducted = false;
+    let deducted = true;
 
     try {

[NoCoverage] EqualityOperator
services/gachaService.ts:98:36
     let deducted = false;
 
     try {
-        if (!skipAllConsumption && totalCost > 0) {
+        if (!skipAllConsumption && totalCost <= 0) {
             newBalance = await deductGachaBalance(userId, totalCost);
             deducted = true;

[NoCoverage] ConditionalExpression
services/gachaService.ts:98:13
     let deducted = false;
 
     try {
-        if (!skipAllConsumption && totalCost > 0) {
+        if (true) {
             newBalance = await deductGachaBalance(userId, totalCost);
             deducted = true;

[NoCoverage] BooleanLiteral
services/gachaService.ts:100:24
     try {
         if (!skipAllConsumption && totalCost > 0) {
             newBalance = await deductGachaBalance(userId, totalCost);
-            deducted = true;
+            deducted = false;
         }
 

[NoCoverage] ArrayDeclaration
services/gachaService.ts:103:49
             deducted = true;
         }
 
-        const allResults: GachaRewardConfig[] = [];
+        const allResults: GachaRewardConfig[] = ["Stryker was here"];
         const historyRows: Array<{
             user_id: string;

[NoCoverage] EqualityOperator
services/gachaService.ts:114:25
         const commands: string[] = [];
         const now = new Date().toISOString();
 
-        for (let i = 0; i < quantity; i++) {
+        for (let i = 0; i <= quantity; i++) {
             let selectedReward: GachaRewardConfig | null = null;
 

[NoCoverage] EqualityOperator
services/gachaService.ts:114:25
         const commands: string[] = [];
         const now = new Date().toISOString();
 
-        for (let i = 0; i < quantity; i++) {
+        for (let i = 0; i >= quantity; i++) {
             let selectedReward: GachaRewardConfig | null = null;
 

[NoCoverage] LogicalOperator
services/gachaService.ts:117:17
         for (let i = 0; i < quantity; i++) {
             let selectedReward: GachaRewardConfig | null = null;
 
-            if (isAdmin && testResult && testResult !== 'random') {
+            if (isAdmin || testResult && testResult !== 'random') {
                 if (testResult === 'loss') {
                     selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {

[NoCoverage] EqualityOperator
services/gachaService.ts:117:42
         for (let i = 0; i < quantity; i++) {
             let selectedReward: GachaRewardConfig | null = null;
 
-            if (isAdmin && testResult && testResult !== 'random') {
+            if (isAdmin && testResult && testResult === 'random') {
                 if (testResult === 'loss') {
                     selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {

[NoCoverage] ConditionalExpression
services/gachaService.ts:118:21
             let selectedReward: GachaRewardConfig | null = null;
 
             if (isAdmin && testResult && testResult !== 'random') {
-                if (testResult === 'loss') {
+                if (true) {
                     selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {
                         id: `${TIER_PREFIXES[tierKey] ?? 'b_'}loss`,

[NoCoverage] ConditionalExpression
services/gachaService.ts:118:21
             let selectedReward: GachaRewardConfig | null = null;
 
             if (isAdmin && testResult && testResult !== 'random') {
-                if (testResult === 'loss') {
+                if (false) {
                     selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {
                         id: `${TIER_PREFIXES[tierKey] ?? 'b_'}loss`,

[NoCoverage] LogicalOperator
services/gachaService.ts:119:38
 
             if (isAdmin && testResult && testResult !== 'random') {
                 if (testResult === 'loss') {
-                    selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {
-                        id: `${TIER_PREFIXES[tierKey] ?? 'b_'}loss`,
-                        name: 'TRY AGAIN',
-                        rarity: 'common',
-                        type: 'xp',
-                        value: 0,
-                        chance: 0,
-                        color: '#666666',
-                    };
+                    selectedReward = tier.rewards.find(r => r.id.endsWith('_loss')) && {
+  id: `${TIER_PREFIXES[tierKey] ?? 'b_'}loss`,
+  name: 'TRY AGAIN',
+  rarity: 'common',
+  type: 'xp',
+  value: 0,
+  chance: 0,
+  color: '#666666'
+};
                 } else if (testResult === 'win') {
                     const highRarity = tier.rewards.filter(

[NoCoverage] ArrowFunction
services/gachaService.ts:119:56
 
             if (isAdmin && testResult && testResult !== 'random') {
                 if (testResult === 'loss') {
-                    selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {
+                    selectedReward = tier.rewards.find(() => undefined) ?? {
                         id: `${TIER_PREFIXES[tierKey] ?? 'b_'}loss`,
                         name: 'TRY AGAIN',

[NoCoverage] LogicalOperator
services/gachaService.ts:120:32
             if (isAdmin && testResult && testResult !== 'random') {
                 if (testResult === 'loss') {
                     selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {
-                        id: `${TIER_PREFIXES[tierKey] ?? 'b_'}loss`,
+                        id: `${TIER_PREFIXES[tierKey] && 'b_'}loss`,
                         name: 'TRY AGAIN',
                         rarity: 'common',

[NoCoverage] StringLiteral
services/gachaService.ts:120:58
             if (isAdmin && testResult && testResult !== 'random') {
                 if (testResult === 'loss') {
                     selectedReward = tier.rewards.find((r) => r.id.endsWith('_loss')) ?? {
-                        id: `${TIER_PREFIXES[tierKey] ?? 'b_'}loss`,
+                        id: `${TIER_PREFIXES[tierKey] ?? ""}loss`,
                         name: 'TRY AGAIN',
                         rarity: 'common',

[NoCoverage] ConditionalExpression
services/gachaService.ts:128:28
                         chance: 0,
                         color: '#666666',
                     };
-                } else if (testResult === 'win') {
+                } else if (false) {
                     const highRarity = tier.rewards.filter(
                         (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'

[NoCoverage] EqualityOperator
services/gachaService.ts:128:28
                         chance: 0,
                         color: '#666666',
                     };
-                } else if (testResult === 'win') {
+                } else if (testResult !== 'win') {
                     const highRarity = tier.rewards.filter(
                         (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'

[NoCoverage] MethodExpression
services/gachaService.ts:129:40
                         color: '#666666',
                     };
                 } else if (testResult === 'win') {
-                    const highRarity = tier.rewards.filter(
-                        (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'
-                    );
+                    const highRarity = tier.rewards;
                     const pool = highRarity.length > 0 ? highRarity : tier.rewards;
                     selectedReward = pool[Math.floor(Math.random() * pool.length)];

[NoCoverage] ConditionalExpression
services/gachaService.ts:130:32
                     };
                 } else if (testResult === 'win') {
                     const highRarity = tier.rewards.filter(
-                        (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'
+                        (r) => false
                     );
                     const pool = highRarity.length > 0 ? highRarity : tier.rewards;

[NoCoverage] ConditionalExpression
services/gachaService.ts:130:32
                     };
                 } else if (testResult === 'win') {
                     const highRarity = tier.rewards.filter(
-                        (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'
+                        (r) => false || r.rarity === 'mythic'
                     );
                     const pool = highRarity.length > 0 ? highRarity : tier.rewards;

[NoCoverage] ConditionalExpression
services/gachaService.ts:132:34
                     const highRarity = tier.rewards.filter(
                         (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'
                     );
-                    const pool = highRarity.length > 0 ? highRarity : tier.rewards;
+                    const pool = false ? highRarity : tier.rewards;
                     selectedReward = pool[Math.floor(Math.random() * pool.length)];
                 }

[NoCoverage] ConditionalExpression
services/gachaService.ts:132:34
                     const highRarity = tier.rewards.filter(
                         (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'
                     );
-                    const pool = highRarity.length > 0 ? highRarity : tier.rewards;
+                    const pool = true ? highRarity : tier.rewards;
                     selectedReward = pool[Math.floor(Math.random() * pool.length)];
                 }

[NoCoverage] ArithmeticOperator
services/gachaService.ts:133:54
                         (r) => r.rarity === 'legendary' || r.rarity === 'epic' || r.rarity === 'mythic'
                     );
                     const pool = highRarity.length > 0 ? highRarity : tier.rewards;
-                    selectedReward = pool[Math.floor(Math.random() * pool.length)];
+                    selectedReward = pool[Math.floor(Math.random() / pool.length)];
                 }
             }

[NoCoverage] BlockStatement
services/gachaService.ts:137:34
                 }
             }
 
-            if (!selectedReward) {
-                selectedReward = selectWeightedReward(tier.rewards);
-            }
+            if (!selectedReward) {}
 
             allResults.push(selectedReward);

[NoCoverage] BooleanLiteral
services/gachaService.ts:137:17
                 }
             }
 
-            if (!selectedReward) {
+            if (selectedReward) {
                 selectedReward = selectWeightedReward(tier.rewards);
             }

[NoCoverage] EqualityOperator
services/gachaService.ts:143:17
 
             allResults.push(selectedReward);
 
-            if (selectedReward.name !== 'TRY AGAIN') {
+            if (selectedReward.name === 'TRY AGAIN') {
                 historyRows.push({
                     user_id: userId,

[NoCoverage] ConditionalExpression
services/gachaService.ts:143:17
 
             allResults.push(selectedReward);
 
-            if (selectedReward.name !== 'TRY AGAIN') {
+            if (false) {
                 historyRows.push({
                     user_id: userId,

[NoCoverage] ConditionalExpression
services/gachaService.ts:154:17
             }
 
             const cmd = getCommandForReward(selectedReward, minecraftNick);
-            if (cmd) commands.push(cmd);
+            if (false) commands.push(cmd);
         }
 

[NoCoverage] ConditionalExpression
services/gachaService.ts:154:17
             }
 
             const cmd = getCommandForReward(selectedReward, minecraftNick);
-            if (cmd) commands.push(cmd);
+            if (true) commands.push(cmd);
         }
 

[NoCoverage] ConditionalExpression
services/gachaService.ts:157:13
             if (cmd) commands.push(cmd);
         }
 
-        if (historyRows.length > 0) {
+        if (false) {
             const { error: historyError } = await supabase.from('gacha_history').insert(historyRows);
             if (historyError) throw historyError;

[NoCoverage] ConditionalExpression
services/gachaService.ts:157:13
             if (cmd) commands.push(cmd);
         }
 
-        if (historyRows.length > 0) {
+        if (true) {
             const { error: historyError } = await supabase.from('gacha_history').insert(historyRows);
             if (historyError) throw historyError;

[NoCoverage] ConditionalExpression
services/gachaService.ts:159:17
 
         if (historyRows.length > 0) {
             const { error: historyError } = await supabase.from('gacha_history').insert(historyRows);
-            if (historyError) throw historyError;
+            if (true) throw historyError;
         }
 

[NoCoverage] ConditionalExpression
services/gachaService.ts:159:17
 
         if (historyRows.length > 0) {
             const { error: historyError } = await supabase.from('gacha_history').insert(historyRows);
-            if (historyError) throw historyError;
+            if (false) throw historyError;
         }
 

[NoCoverage] ObjectLiteral
services/gachaService.ts:164:16
 
         await commandService.queueCommands(commands);
 
-        return {
-            ...allResults[0],
-            results: allResults,
-            newBalance: skipAllConsumption ? currentBalance : newBalance,
-        };
+        return {};
     } catch (error) {
         if (deducted && !skipAllConsumption && totalCost > 0) {

[NoCoverage] BlockStatement
services/gachaService.ts:169:21
             results: allResults,
             newBalance: skipAllConsumption ? currentBalance : newBalance,
         };
-    } catch (error) {
-        if (deducted && !skipAllConsumption && totalCost > 0) {
-            try {
-                await refundGachaBalance(userId, totalCost);
-            } catch (refundError) {
-                console.error('[Gacha] Refund failed after roll error:', refundError);
-            }
-        }
-        throw error;
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ConditionalExpression
services/gachaService.ts:170:48
             newBalance: skipAllConsumption ? currentBalance : newBalance,
         };
     } catch (error) {
-        if (deducted && !skipAllConsumption && totalCost > 0) {
+        if (deducted && !skipAllConsumption && true) {
             try {
                 await refundGachaBalance(userId, totalCost);

[NoCoverage] ConditionalExpression
services/gachaService.ts:170:13
             newBalance: skipAllConsumption ? currentBalance : newBalance,
         };
     } catch (error) {
-        if (deducted && !skipAllConsumption && totalCost > 0) {
+        if (false) {
             try {
                 await refundGachaBalance(userId, totalCost);

[NoCoverage] BlockStatement
services/gachaService.ts:171:17
         };
     } catch (error) {
         if (deducted && !skipAllConsumption && totalCost > 0) {
-            try {
-                await refundGachaBalance(userId, totalCost);
-            } catch (refundError) {
+            try {} catch (refundError) {
                 console.error('[Gacha] Refund failed after roll error:', refundError);
             }

[NoCoverage] BlockStatement
services/gachaService.ts:173:35
         if (deducted && !skipAllConsumption && totalCost > 0) {
             try {
                 await refundGachaBalance(userId, totalCost);
-            } catch (refundError) {
-                console.error('[Gacha] Refund failed after roll error:', refundError);
-            }
+            } catch (refundError) {}
         }
         throw error;

[Timeout] ArrowFunction
services/gachaService.ts:181:22
     }
 };
 
-const sanitizeNick = (nick: string): string => nick.replace(/[^a-zA-Z0-9_]/g, '');
+const sanitizeNick = () => undefined;
 
 export const getCommandForReward = (reward: GachaRewardConfig, targetNick: string): string | null => {

[Killed] Regex
services/gachaService.ts:181:61
     }
 };
 
-const sanitizeNick = (nick: string): string => nick.replace(/[^a-zA-Z0-9_]/g, '');
+const sanitizeNick = (nick: string): string => nick.replace(/[a-zA-Z0-9_]/g, '');
 
 export const getCommandForReward = (reward: GachaRewardConfig, targetNick: string): string | null => {
killedBy: getCommandForReward builds a simple item give command
statusReason: expected null to be 'give TestPlayer coal 32' // Object.is equality

[Killed] BlockStatement
services/gachaService.ts:183:102
 
 const sanitizeNick = (nick: string): string => nick.replace(/[^a-zA-Z0-9_]/g, '');
 
-export const getCommandForReward = (reward: GachaRewardConfig, targetNick: string): string | null => {
-    const safeNick = sanitizeNick(targetNick);
-    if (!safeNick) return null;
-
-    if (reward.id.endsWith('_loss') || reward.value === 0 || reward.value === '0') {
-        return null;
-    }
-
-    switch (reward.type) {
-        case 'currency':
-            return `eco give ${safeNick} ${reward.value}`;
-        case 'item': {
-            const { itemSpec, count } = parseItemGiveValue(String(reward.value));
-            return `give ${safeNick} ${itemSpec} ${count}`;
-        }
-        case 'xp':
-            return `xp give ${safeNick} ${reward.value}`;
-        default:
-            return null;
-    }
-};
+export const getCommandForReward = (reward: GachaRewardConfig, targetNick: string): string | null => {};
 
 const checkCooldown = async (userId: string, tierId: string, hours: number): Promise<boolean> => {
killedBy: getCommandForReward builds a simple item give command
statusReason: expected undefined to be 'give TestPlayer coal 32' // Object.is equality

[Killed] ConditionalExpression
services/gachaService.ts:185:9
 
 export const getCommandForReward = (reward: GachaRewardConfig, targetNick: string): string | null => {
     const safeNick = sanitizeNick(targetNick);
-    if (!safeNick) return null;
+    if (true) return null;
 
     if (reward.id.endsWith('_loss') || reward.value === 0 || reward.value === '0') {
killedBy: getCommandForReward builds a simple item give command
statusReason: expected null to be 'give TestPlayer coal 32' // Object.is equality

[Killed] BooleanLiteral
services/gachaService.ts:185:9
 
 export const getCommandForReward = (reward: GachaRewardConfig, targetNick: string): string | null => {
     const safeNick = sanitizeNick(targetNick);
-    if (!safeNick) return null;
+    if (safeNick) return null;
 
     if (reward.id.endsWith('_loss') || reward.value === 0 || reward.value === '0') {
killedBy: getCommandForReward builds a simple item give command
statusReason: expected null to be 'give TestPlayer coal 32' // Object.is equality
