[NoCoverage] BlockStatement
services/locationService.ts:22:44
     updated_at?: string;
 }
 
-export const getAllLocations = async () => {
-    const { data, error } = await supabase
-        .from('world_locations')
-        .select('*')
-        .order('sort_order', { ascending: true });
-    
-    if (error) throw error;
-    return data as WorldLocation[];
-};
+export const getAllLocations = async () => {};
 
 export const createLocation = async (locationData: Omit<WorldLocation, 'id' | 'created_at' | 'updated_at'>) => {

[NoCoverage] StringLiteral
services/locationService.ts:24:15
 
 export const getAllLocations = async () => {
     const { data, error } = await supabase
-        .from('world_locations')
+        .from("")
         .select('*')
         .order('sort_order', { ascending: true });

[NoCoverage] StringLiteral
services/locationService.ts:25:17
 export const getAllLocations = async () => {
     const { data, error } = await supabase
         .from('world_locations')
-        .select('*')
+        .select("")
         .order('sort_order', { ascending: true });
     

[NoCoverage] BooleanLiteral
services/locationService.ts:26:43
     const { data, error } = await supabase
         .from('world_locations')
         .select('*')
-        .order('sort_order', { ascending: true });
+        .order('sort_order', { ascending: false });
     
     if (error) throw error;

[NoCoverage] ObjectLiteral
services/locationService.ts:26:30
     const { data, error } = await supabase
         .from('world_locations')
         .select('*')
-        .order('sort_order', { ascending: true });
+        .order('sort_order', {});
     
     if (error) throw error;

[NoCoverage] BlockStatement
services/locationService.ts:32:112
     return data as WorldLocation[];
 };
 
-export const createLocation = async (locationData: Omit<WorldLocation, 'id' | 'created_at' | 'updated_at'>) => {
-    const { data, error } = await supabase
-        .from('world_locations')
-        .insert([locationData])
-        .select()
-        .single();
-    
-    if (error) throw error;
-    return data as WorldLocation;
-};
+export const createLocation = async (locationData: Omit<WorldLocation, 'id' | 'created_at' | 'updated_at'>) => {};
 
 export const updateLocation = async (id: number, updates: Partial<WorldLocation>) => {

[NoCoverage] BlockStatement
services/locationService.ts:43:86
     return data as WorldLocation;
 };
 
-export const updateLocation = async (id: number, updates: Partial<WorldLocation>) => {
-    const { data, error } = await supabase
-        .from('world_locations')
-        .update({ ...updates, updated_at: new Date().toISOString() })
-        .eq('id', id)
-        .select()
-        .single();
-    
-    if (error) throw error;
-    return data as WorldLocation;
-};
+export const updateLocation = async (id: number, updates: Partial<WorldLocation>) => {};
 
 export const deleteLocation = async (id: number) => {

[NoCoverage] BlockStatement
services/locationService.ts:55:53
     return data as WorldLocation;
 };
 
-export const deleteLocation = async (id: number) => {
-    const { error } = await supabase
-        .from('world_locations')
-        .delete()
-        .eq('id', id);
-    
-    if (error) throw error;
-    return true;
-};
+export const deleteLocation = async (id: number) => {};
 
