[Timeout] BooleanLiteral
services/minecraftService.ts:5:16
 
 const options = {
     timeout: 5000,
-    enableSRV: true
+    enableSRV: false
 };
 

[NoCoverage] BlockStatement
services/minecraftService.ts:15:9
  * @returns {Promise<object>} - Datos del servidor (players, version, favicon, etc.)
  */
 export const getServerStatus = async (host: string, port = 25565) => {
-    try {
-        const result = await util.status(host, port, options);
-
-        // Limpiamos y formateamos la respuesta para que sea fácil de usar en el frontend
-        return {
-            online: true,
-            version: result.version.name,
-            players: {
-                online: result.players.online,
-                max: result.players.max,
-                list: result.players.sample || [] // Lista de nombres (si el server la envía)
-            },
-            motd: result.motd.clean, // Texto plano sin códigos de color
-            motdHtml: result.motd.html, // Texto con colores HTML (útil para la web)
-            favicon: result.favicon, // Base64 image
-            ping: result.roundTripLatency
-        };
-    } catch (error) {
+    try {} catch (error) {
         // Safe error handling for unknown error type
         const errorMessage = error instanceof Error ? error.message : "Unknown error";

[NoCoverage] BooleanLiteral
services/minecraftService.ts:20:21
 
         // Limpiamos y formateamos la respuesta para que sea fácil de usar en el frontend
         return {
-            online: true,
+            online: false,
             version: result.version.name,
             players: {

[NoCoverage] ConditionalExpression
services/minecraftService.ts:25:23
             players: {
                 online: result.players.online,
                 max: result.players.max,
-                list: result.players.sample || [] // Lista de nombres (si el server la envía)
+                list: false // Lista de nombres (si el server la envía)
             },
             motd: result.motd.clean, // Texto plano sin códigos de color

[NoCoverage] LogicalOperator
services/minecraftService.ts:25:23
             players: {
                 online: result.players.online,
                 max: result.players.max,
-                list: result.players.sample || [] // Lista de nombres (si el server la envía)
+                list: result.players.sample && [] // Lista de nombres (si el server la envía)
             },
             motd: result.motd.clean, // Texto plano sin códigos de color

[NoCoverage] BlockStatement
services/minecraftService.ts:32:21
             favicon: result.favicon, // Base64 image
             ping: result.roundTripLatency
         };
-    } catch (error) {
-        // Safe error handling for unknown error type
-        const errorMessage = error instanceof Error ? error.message : "Unknown error";
-        console.error('Error fetching Minecraft server status:', errorMessage);
-        
-        // Devolvemos un objeto indicando que está offline, en lugar de crashear
-        return {
-            online: false,
-            error: "Server offline or unreachable"
-        };
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
services/minecraftService.ts:34:71
         };
     } catch (error) {
         // Safe error handling for unknown error type
-        const errorMessage = error instanceof Error ? error.message : "Unknown error";
+        const errorMessage = error instanceof Error ? error.message : "";
         console.error('Error fetching Minecraft server status:', errorMessage);
         

[NoCoverage] BooleanLiteral
services/minecraftService.ts:39:21
         
         // Devolvemos un objeto indicando que está offline, en lugar de crashear
         return {
-            online: false,
+            online: true,
             error: "Server offline or unreachable"
         };
