[NoCoverage] BlockStatement
services/notionService.ts:13:54
 const DATABASE_ID = process.env.NOTION_DATABASE_ID;
 
 export const getNotionTasks = async () => {
-    if (!process.env.NOTION_API_KEY || !DATABASE_ID) {
-        console.warn('NOTION_API_KEY or NOTION_DATABASE_ID not set');
-        return [];
-    }
+    if (!process.env.NOTION_API_KEY || !DATABASE_ID) {}
 
     try {

[NoCoverage] ConditionalExpression
services/notionService.ts:13:9
 const DATABASE_ID = process.env.NOTION_DATABASE_ID;
 
 export const getNotionTasks = async () => {
-    if (!process.env.NOTION_API_KEY || !DATABASE_ID) {
+    if (true) {
         console.warn('NOTION_API_KEY or NOTION_DATABASE_ID not set');
         return [];

[NoCoverage] BlockStatement
services/notionService.ts:27:52
 
         // Simplified mapping - adjusts based on user's actual DB schema
         /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
-        return response.results.map((page: any) => {
-            const props = page.properties;
-            // Robustly try to find 'Name' or 'Title' property
-            /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
-            const titleProp = props.Name || props.Title || props.Task || Object.values(props).find((p: any) => p.id === 'title');
-            const statusProp = props.Status || props.State;
-            const dateProp = props.Date || props.Due || props.Timeline;
-            
-            const title = titleProp?.title?.[0]?.plain_text || 'Untitled';
-            const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
-            const date = dateProp?.date?.start || page.created_time;
-
-            return {
-                id: page.id,
-                title,
-                status,
-                created_at: date,
-                source: 'notion',
-                url: page.url
-            };
-        });
+        return response.results.map((page: any) => {});
     } catch (error) {
         console.error('Error fetching Notion tasks:', error);

[NoCoverage] LogicalOperator
services/notionService.ts:31:31
             const props = page.properties;
             // Robustly try to find 'Name' or 'Title' property
             /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
-            const titleProp = props.Name || props.Title || props.Task || Object.values(props).find((p: any) => p.id === 'title');
+            const titleProp = (props.Name || props.Title) && props.Task || Object.values(props).find((p: any) => p.id === 'title');
             const statusProp = props.Status || props.State;
             const dateProp = props.Date || props.Due || props.Timeline;

[NoCoverage] ConditionalExpression
services/notionService.ts:31:31
             const props = page.properties;
             // Robustly try to find 'Name' or 'Title' property
             /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
-            const titleProp = props.Name || props.Title || props.Task || Object.values(props).find((p: any) => p.id === 'title');
+            const titleProp = true;
             const statusProp = props.Status || props.State;
             const dateProp = props.Date || props.Due || props.Timeline;

[NoCoverage] ConditionalExpression
services/notionService.ts:32:32
             // Robustly try to find 'Name' or 'Title' property
             /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
             const titleProp = props.Name || props.Title || props.Task || Object.values(props).find((p: any) => p.id === 'title');
-            const statusProp = props.Status || props.State;
+            const statusProp = false;
             const dateProp = props.Date || props.Due || props.Timeline;
             

[NoCoverage] LogicalOperator
services/notionService.ts:32:32
             // Robustly try to find 'Name' or 'Title' property
             /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
             const titleProp = props.Name || props.Title || props.Task || Object.values(props).find((p: any) => p.id === 'title');
-            const statusProp = props.Status || props.State;
+            const statusProp = props.Status && props.State;
             const dateProp = props.Date || props.Due || props.Timeline;
             

[NoCoverage] ConditionalExpression
services/notionService.ts:33:30
             /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
             const titleProp = props.Name || props.Title || props.Task || Object.values(props).find((p: any) => p.id === 'title');
             const statusProp = props.Status || props.State;
-            const dateProp = props.Date || props.Due || props.Timeline;
+            const dateProp = false;
             
             const title = titleProp?.title?.[0]?.plain_text || 'Untitled';

[NoCoverage] ConditionalExpression
services/notionService.ts:33:30
             /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
             const titleProp = props.Name || props.Title || props.Task || Object.values(props).find((p: any) => p.id === 'title');
             const statusProp = props.Status || props.State;
-            const dateProp = props.Date || props.Due || props.Timeline;
+            const dateProp = false || props.Timeline;
             
             const title = titleProp?.title?.[0]?.plain_text || 'Untitled';

[NoCoverage] OptionalChaining
services/notionService.ts:35:27
             const statusProp = props.Status || props.State;
             const dateProp = props.Date || props.Due || props.Timeline;
             
-            const title = titleProp?.title?.[0]?.plain_text || 'Untitled';
+            const title = titleProp.title?.[0]?.plain_text || 'Untitled';
             const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
             const date = dateProp?.date?.start || page.created_time;

[NoCoverage] ConditionalExpression
services/notionService.ts:35:27
             const statusProp = props.Status || props.State;
             const dateProp = props.Date || props.Due || props.Timeline;
             
-            const title = titleProp?.title?.[0]?.plain_text || 'Untitled';
+            const title = false;
             const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
             const date = dateProp?.date?.start || page.created_time;

[NoCoverage] LogicalOperator
services/notionService.ts:36:28
             const dateProp = props.Date || props.Due || props.Timeline;
             
             const title = titleProp?.title?.[0]?.plain_text || 'Untitled';
-            const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
+            const status = statusProp?.status?.name && statusProp?.select?.name || 'Todo';
             const date = dateProp?.date?.start || page.created_time;
 

[NoCoverage] OptionalChaining
services/notionService.ts:36:56
             const dateProp = props.Date || props.Due || props.Timeline;
             
             const title = titleProp?.title?.[0]?.plain_text || 'Untitled';
-            const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
+            const status = statusProp?.status?.name || statusProp.select?.name || 'Todo';
             const date = dateProp?.date?.start || page.created_time;
 

[NoCoverage] OptionalChaining
services/notionService.ts:37:26
             
             const title = titleProp?.title?.[0]?.plain_text || 'Untitled';
             const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
-            const date = dateProp?.date?.start || page.created_time;
+            const date = dateProp?.date.start || page.created_time;
 
             return {

[NoCoverage] ConditionalExpression
services/notionService.ts:37:26
             
             const title = titleProp?.title?.[0]?.plain_text || 'Untitled';
             const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
-            const date = dateProp?.date?.start || page.created_time;
+            const date = true;
 
             return {

[NoCoverage] ObjectLiteral
services/notionService.ts:39:20
             const status = statusProp?.status?.name || statusProp?.select?.name || 'Todo';
             const date = dateProp?.date?.start || page.created_time;
 
-            return {
-                id: page.id,
-                title,
-                status,
-                created_at: date,
-                source: 'notion',
-                url: page.url
-            };
+            return {};
         });
     } catch (error) {

[NoCoverage] StringLiteral
services/notionService.ts:44:25
                 title,
                 status,
                 created_at: date,
-                source: 'notion',
+                source: "",
                 url: page.url
             };

[NoCoverage] BlockStatement
services/notionService.ts:48:21
                 url: page.url
             };
         });
-    } catch (error) {
-        console.error('Error fetching Notion tasks:', error);
-        throw error;
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
services/notionService.ts:54:85
     }
 };
 
-export const createNotionPage = async (task: { title: string, status?: string }) => {
-    if (!process.env.NOTION_API_KEY || !DATABASE_ID) throw new Error('Notion credentials missing');
-
-    try {
-        const response = await notion.pages.create({
-            parent: { database_id: DATABASE_ID },
-            properties: {
-                Name: {
-                    title: [
-                        { text: { content: task.title } }
-                    ]
-                },
-                Status: {
-                    status: { name: task.status || 'Not started' } // Adjust 'Not started' to match DB schema
-                }
-            }
-        });
-        return response;
-    } catch (error) {
-        console.error('Error creating Notion page:', error);
-        throw error;
-    }
-};
+export const createNotionPage = async (task: { title: string, status?: string }) => {};
 

[NoCoverage] ConditionalExpression
services/notionService.ts:55:9
 };
 
 export const createNotionPage = async (task: { title: string, status?: string }) => {
-    if (!process.env.NOTION_API_KEY || !DATABASE_ID) throw new Error('Notion credentials missing');
+    if (false) throw new Error('Notion credentials missing');
 
     try {

[NoCoverage] BooleanLiteral
services/notionService.ts:55:9
 };
 
 export const createNotionPage = async (task: { title: string, status?: string }) => {
-    if (!process.env.NOTION_API_KEY || !DATABASE_ID) throw new Error('Notion credentials missing');
+    if (process.env.NOTION_API_KEY || !DATABASE_ID) throw new Error('Notion credentials missing');
 
     try {

[NoCoverage] BlockStatement
services/notionService.ts:57:9
 export const createNotionPage = async (task: { title: string, status?: string }) => {
     if (!process.env.NOTION_API_KEY || !DATABASE_ID) throw new Error('Notion credentials missing');
 
-    try {
-        const response = await notion.pages.create({
-            parent: { database_id: DATABASE_ID },
-            properties: {
-                Name: {
-                    title: [
-                        { text: { content: task.title } }
-                    ]
-                },
-                Status: {
-                    status: { name: task.status || 'Not started' } // Adjust 'Not started' to match DB schema
-                }
-            }
-        });
-        return response;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error creating Notion page:', error);
         throw error;

[NoCoverage] ObjectLiteral
services/notionService.ts:63:25
             properties: {
                 Name: {
                     title: [
-                        { text: { content: task.title } }
+                        {}
                     ]
                 },

[NoCoverage] ObjectLiteral
services/notionService.ts:66:25
                         { text: { content: task.title } }
                     ]
                 },
-                Status: {
-                    status: { name: task.status || 'Not started' } // Adjust 'Not started' to match DB schema
-                }
+                Status: {}
             }
         });

[NoCoverage] ConditionalExpression
services/notionService.ts:67:37
                     ]
                 },
                 Status: {
-                    status: { name: task.status || 'Not started' } // Adjust 'Not started' to match DB schema
+                    status: { name: true } // Adjust 'Not started' to match DB schema
                 }
             }

[NoCoverage] ConditionalExpression
services/notionService.ts:67:37
                     ]
                 },
                 Status: {
-                    status: { name: task.status || 'Not started' } // Adjust 'Not started' to match DB schema
+                    status: { name: false } // Adjust 'Not started' to match DB schema
                 }
             }

[NoCoverage] BlockStatement
services/notionService.ts:72:21
             }
         });
         return response;
-    } catch (error) {
-        console.error('Error creating Notion page:', error);
-        throw error;
-    }
+    } catch (error) {}
 };
 
