[Timeout] StringLiteral
services/playerStatsService.ts:32:14
 const GROUP_MAP: GroupMap = {
     '§f§r': 'neroferno',
     '§f§r': 'fundador',
-    '§f§r': 'donador',
+    '§f§r': "",
     '§f§r': 'developer',
     '': 'killuwu',

[Timeout] StringLiteral
services/playerStatsService.ts:34:10
     '§f§r': 'fundador',
     '§f§r': 'donador',
     '§f§r': 'developer',
-    '': 'killuwu',
+    '': "",
     'default': 'default'
 };

[Timeout] StringLiteral
services/playerStatsService.ts:37:24
     '': 'killuwu',
     'default': 'default'
 };
-const RANK_PRIORITY = ['default', 'donador', 'fundador', 'developer', 'killuwu', 'neroferno'];
+const RANK_PRIORITY = ["", 'donador', 'fundador', 'developer', 'killuwu', 'neroferno'];
 
 export const getPlayerStats = async (usernameFragment: string): Promise<PlayerStats | null> => {

[NoCoverage] MethodExpression
services/playerStatsService.ts:40:27
 const RANK_PRIORITY = ['default', 'donador', 'fundador', 'developer', 'killuwu', 'neroferno'];
 
 export const getPlayerStats = async (usernameFragment: string): Promise<PlayerStats | null> => {
-    const cleanUsername = usernameFragment.trim();
+    const cleanUsername = usernameFragment;
     if (!cleanUsername) return null;
 

[NoCoverage] BooleanLiteral
services/playerStatsService.ts:41:9
 
 export const getPlayerStats = async (usernameFragment: string): Promise<PlayerStats | null> => {
     const cleanUsername = usernameFragment.trim();
-    if (!cleanUsername) return null;
+    if (cleanUsername) return null;
 
     // 1. Resolve User (UUID/Name) from PLAN

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:41:9
 
 export const getPlayerStats = async (usernameFragment: string): Promise<PlayerStats | null> => {
     const cleanUsername = usernameFragment.trim();
-    if (!cleanUsername) return null;
+    if (true) return null;
 
     // 1. Resolve User (UUID/Name) from PLAN

[NoCoverage] Regex
services/playerStatsService.ts:44:20
     if (!cleanUsername) return null;
 
     // 1. Resolve User (UUID/Name) from PLAN
-    const isUUID = /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(cleanUsername);
+    const isUUID = /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]-[0-9a-f]{12}$/i.test(cleanUsername);
     const query = isUUID 
         ? `SELECT uuid, name, id, registered FROM plan_users WHERE uuid = ? LIMIT 1`

[NoCoverage] Regex
services/playerStatsService.ts:44:20
     if (!cleanUsername) return null;
 
     // 1. Resolve User (UUID/Name) from PLAN
-    const isUUID = /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(cleanUsername);
+    const isUUID = /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]$/i.test(cleanUsername);
     const query = isUUID 
         ? `SELECT uuid, name, id, registered FROM plan_users WHERE uuid = ? LIMIT 1`

[NoCoverage] ArrayDeclaration
services/playerStatsService.ts:49:60
         ? `SELECT uuid, name, id, registered FROM plan_users WHERE uuid = ? LIMIT 1`
         : `SELECT uuid, name, id, registered FROM plan_users WHERE name = ? ORDER BY registered DESC LIMIT 1`;
 
-    const [users] = await db.query<RowDataPacket[]>(query, [cleanUsername]);
+    const [users] = await db.query<RowDataPacket[]>(query, []);
 
     // Fallback logic for compacted/dashed UUIDs

[NoCoverage] EqualityOperator
services/playerStatsService.ts:52:9
     const [users] = await db.query<RowDataPacket[]>(query, [cleanUsername]);
 
     // Fallback logic for compacted/dashed UUIDs
-    if (users.length === 0 && isUUID) {
+    if (users.length !== 0 && isUUID) {
          // Logic skipped for brevity, keeping core flow clean. 
          // If exact match fails, return null. use proper UUID format

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:52:9
     const [users] = await db.query<RowDataPacket[]>(query, [cleanUsername]);
 
     // Fallback logic for compacted/dashed UUIDs
-    if (users.length === 0 && isUUID) {
+    if (false) {
          // Logic skipped for brevity, keeping core flow clean. 
          // If exact match fails, return null. use proper UUID format

[NoCoverage] BooleanLiteral
services/playerStatsService.ts:58:9
          return null; 
     }
 
-    if (!users || users.length === 0) return null;
+    if (users || users.length === 0) return null;
 
     const user = users[0];

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:58:19
          return null; 
     }
 
-    if (!users || users.length === 0) return null;
+    if (!users || false) return null;
 
     const user = users[0];

[NoCoverage] ArrayDeclaration
services/playerStatsService.ts:66:79
     const planUserId = user.id;
 
     // 2. Parallel Fetching for Performance
-    const [sessionStats, killStats, moneyStats, lpGroups] = await Promise.all([
-        getSessionStats(planUserId),
-        getPvpKills(uuid),
-        getMoney(uuid),
-        getLuckPermsGroups(uuid)
-    ]);
+    const [sessionStats, killStats, moneyStats, lpGroups] = await Promise.all([]);
 
     // 3. Process Rank

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:77:24
     const rankData = processRank(lpGroups);
 
     // 4. Format Playtime
-    const playtimeMs = sessionStats.playtime || 0;
+    const playtimeMs = false;
     const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
     const hours = Math.floor(totalMinutes / 60);

[NoCoverage] LogicalOperator
services/playerStatsService.ts:77:24
     const rankData = processRank(lpGroups);
 
     // 4. Format Playtime
-    const playtimeMs = sessionStats.playtime || 0;
+    const playtimeMs = sessionStats.playtime && 0;
     const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
     const hours = Math.floor(totalMinutes / 60);

[NoCoverage] ArithmeticOperator
services/playerStatsService.ts:78:37
 
     // 4. Format Playtime
     const playtimeMs = sessionStats.playtime || 0;
-    const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
+    const totalMinutes = Math.floor(playtimeMs * 1000 / 60);
     const hours = Math.floor(totalMinutes / 60);
     const minutes = totalMinutes % 60;

[NoCoverage] ArithmeticOperator
services/playerStatsService.ts:78:37
 
     // 4. Format Playtime
     const playtimeMs = sessionStats.playtime || 0;
-    const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
+    const totalMinutes = Math.floor(playtimeMs / 1000 * 60);
     const hours = Math.floor(totalMinutes / 60);
     const minutes = totalMinutes % 60;

[NoCoverage] ArithmeticOperator
services/playerStatsService.ts:79:30
     // 4. Format Playtime
     const playtimeMs = sessionStats.playtime || 0;
     const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
-    const hours = Math.floor(totalMinutes / 60);
+    const hours = Math.floor(totalMinutes * 60);
     const minutes = totalMinutes % 60;
     const playtimeStr = hours > 0 ? `${hours}h ${minutes}m` : `${minutes}m`;

[NoCoverage] ArithmeticOperator
services/playerStatsService.ts:80:21
     const playtimeMs = sessionStats.playtime || 0;
     const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
     const hours = Math.floor(totalMinutes / 60);
-    const minutes = totalMinutes % 60;
+    const minutes = totalMinutes * 60;
     const playtimeStr = hours > 0 ? `${hours}h ${minutes}m` : `${minutes}m`;
 

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:81:25
     const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
     const hours = Math.floor(totalMinutes / 60);
     const minutes = totalMinutes % 60;
-    const playtimeStr = hours > 0 ? `${hours}h ${minutes}m` : `${minutes}m`;
+    const playtimeStr = true ? `${hours}h ${minutes}m` : `${minutes}m`;
 
     return {

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:81:25
     const totalMinutes = Math.floor(playtimeMs / 1000 / 60);
     const hours = Math.floor(totalMinutes / 60);
     const minutes = totalMinutes % 60;
-    const playtimeStr = hours > 0 ? `${hours}h ${minutes}m` : `${minutes}m`;
+    const playtimeStr = false ? `${hours}h ${minutes}m` : `${minutes}m`;
 
     return {

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:89:20
         rank_image: rankData.image,
         playtime: playtimeStr,
         kills: killStats,
-        mob_kills: sessionStats.mobs || 0,
+        mob_kills: false,
         deaths: sessionStats.deaths || 0,
         money: formatMoneyCompact(moneyStats),

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:89:20
         rank_image: rankData.image,
         playtime: playtimeStr,
         kills: killStats,
-        mob_kills: sessionStats.mobs || 0,
+        mob_kills: true,
         deaths: sessionStats.deaths || 0,
         money: formatMoneyCompact(moneyStats),

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:90:17
         playtime: playtimeStr,
         kills: killStats,
         mob_kills: sessionStats.mobs || 0,
-        deaths: sessionStats.deaths || 0,
+        deaths: false,
         money: formatMoneyCompact(moneyStats),
         blocks_mined: "0",

[NoCoverage] LogicalOperator
services/playerStatsService.ts:90:17
         playtime: playtimeStr,
         kills: killStats,
         mob_kills: sessionStats.mobs || 0,
-        deaths: sessionStats.deaths || 0,
+        deaths: sessionStats.deaths && 0,
         money: formatMoneyCompact(moneyStats),
         blocks_mined: "0",

[NoCoverage] StringLiteral
services/playerStatsService.ts:92:23
         mob_kills: sessionStats.mobs || 0,
         deaths: sessionStats.deaths || 0,
         money: formatMoneyCompact(moneyStats),
-        blocks_mined: "0",
+        blocks_mined: "",
         blocks_placed: "0",
         member_since: new Date(user.registered).toLocaleDateString('es-ES'),

[NoCoverage] StringLiteral
services/playerStatsService.ts:94:68
         money: formatMoneyCompact(moneyStats),
         blocks_mined: "0",
         blocks_placed: "0",
-        member_since: new Date(user.registered).toLocaleDateString('es-ES'),
+        member_since: new Date(user.registered).toLocaleDateString(""),
         raw_id: planUserId, 
         raw_playtime: playtimeMs,

[NoCoverage] BlockStatement
services/playerStatsService.ts:112:78
     deaths?: number;
 }
 
-const getSessionStats = async (planUserId: number): Promise<SessionStats> => {
-    try {
-        const [rows] = await db.query<RowDataPacket[]>(`
-            SELECT 
-                SUM(CASE WHEN session_end IS NOT NULL THEN (session_end - session_start) ELSE (UNIX_TIMESTAMP(NOW()) * 1000 - session_start) END) as playtime,
-                SUM(mob_kills) as mobs,
-                SUM(deaths) as deaths
-            FROM plan_sessions WHERE user_id = ?
-        `, [planUserId]);
-        return (rows[0] as SessionStats) || { playtime: 0, mobs: 0, deaths: 0 };
-    } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
-};
+const getSessionStats = async (planUserId: number): Promise<SessionStats> => {};
 
 const getPvpKills = async (uuid: string) => {

[NoCoverage] BlockStatement
services/playerStatsService.ts:113:9
 }
 
 const getSessionStats = async (planUserId: number): Promise<SessionStats> => {
-    try {
-        const [rows] = await db.query<RowDataPacket[]>(`
-            SELECT 
-                SUM(CASE WHEN session_end IS NOT NULL THEN (session_end - session_start) ELSE (UNIX_TIMESTAMP(NOW()) * 1000 - session_start) END) as playtime,
-                SUM(mob_kills) as mobs,
-                SUM(deaths) as deaths
-            FROM plan_sessions WHERE user_id = ?
-        `, [planUserId]);
-        return (rows[0] as SessionStats) || { playtime: 0, mobs: 0, deaths: 0 };
-    } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
+    try {} catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
 };
 

[NoCoverage] StringLiteral
services/playerStatsService.ts:114:56
 
 const getSessionStats = async (planUserId: number): Promise<SessionStats> => {
     try {
-        const [rows] = await db.query<RowDataPacket[]>(`
-            SELECT 
-                SUM(CASE WHEN session_end IS NOT NULL THEN (session_end - session_start) ELSE (UNIX_TIMESTAMP(NOW()) * 1000 - session_start) END) as playtime,
-                SUM(mob_kills) as mobs,
-                SUM(deaths) as deaths
-            FROM plan_sessions WHERE user_id = ?
-        `, [planUserId]);
+        const [rows] = await db.query<RowDataPacket[]>(``, [planUserId]);
         return (rows[0] as SessionStats) || { playtime: 0, mobs: 0, deaths: 0 };
     } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:121:16
                 SUM(deaths) as deaths
             FROM plan_sessions WHERE user_id = ?
         `, [planUserId]);
-        return (rows[0] as SessionStats) || { playtime: 0, mobs: 0, deaths: 0 };
+        return false;
     } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
 };

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:121:16
                 SUM(deaths) as deaths
             FROM plan_sessions WHERE user_id = ?
         `, [planUserId]);
-        return (rows[0] as SessionStats) || { playtime: 0, mobs: 0, deaths: 0 };
+        return true;
     } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
 };

[NoCoverage] BlockStatement
services/playerStatsService.ts:122:17
             FROM plan_sessions WHERE user_id = ?
         `, [planUserId]);
         return (rows[0] as SessionStats) || { playtime: 0, mobs: 0, deaths: 0 };
-    } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
+    } catch (e) {}
 };
 

[NoCoverage] ObjectLiteral
services/playerStatsService.ts:122:66
             FROM plan_sessions WHERE user_id = ?
         `, [planUserId]);
         return (rows[0] as SessionStats) || { playtime: 0, mobs: 0, deaths: 0 };
-    } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
+    } catch (e) { console.error("SessionStats Error", e); return {}; }
 };
 

[NoCoverage] BlockStatement
services/playerStatsService.ts:125:45
     } catch (e) { console.error("SessionStats Error", e); return { playtime: 0, mobs: 0, deaths: 0 }; }
 };
 
-const getPvpKills = async (uuid: string) => {
-    try {
-        const [rows] = await db.query<RowDataPacket[]>(`SELECT COUNT(*) as count FROM plan_kills WHERE killer_uuid = ?`, [uuid]);
-        return rows[0]?.count || 0;
-    } catch { return 0; }
-};
+const getPvpKills = async (uuid: string) => {};
 
 export const getMoney = async (uuid: string) => {

[NoCoverage] BlockStatement
services/playerStatsService.ts:126:9
 };
 
 const getPvpKills = async (uuid: string) => {
-    try {
-        const [rows] = await db.query<RowDataPacket[]>(`SELECT COUNT(*) as count FROM plan_kills WHERE killer_uuid = ?`, [uuid]);
-        return rows[0]?.count || 0;
-    } catch { return 0; }
+    try {} catch { return 0; }
 };
 

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:128:16
 const getPvpKills = async (uuid: string) => {
     try {
         const [rows] = await db.query<RowDataPacket[]>(`SELECT COUNT(*) as count FROM plan_kills WHERE killer_uuid = ?`, [uuid]);
-        return rows[0]?.count || 0;
+        return false;
     } catch { return 0; }
 };

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:128:16
 const getPvpKills = async (uuid: string) => {
     try {
         const [rows] = await db.query<RowDataPacket[]>(`SELECT COUNT(*) as count FROM plan_kills WHERE killer_uuid = ?`, [uuid]);
-        return rows[0]?.count || 0;
+        return true;
     } catch { return 0; }
 };

[NoCoverage] BlockStatement
services/playerStatsService.ts:129:13
     try {
         const [rows] = await db.query<RowDataPacket[]>(`SELECT COUNT(*) as count FROM plan_kills WHERE killer_uuid = ?`, [uuid]);
         return rows[0]?.count || 0;
-    } catch { return 0; }
+    } catch {}
 };
 

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:140:19
         `, [uuid, uuid]);
         
-        let val = Number(rows[0]?.vault_balance) || 0;
+        let val = false;
         if (val === 0 && rows[0]?.vault_balance_str) {
             val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) || 0;

[NoCoverage] LogicalOperator
services/playerStatsService.ts:140:19
         `, [uuid, uuid]);
         
-        let val = Number(rows[0]?.vault_balance) || 0;
+        let val = Number(rows[0]?.vault_balance) && 0;
         if (val === 0 && rows[0]?.vault_balance_str) {
             val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) || 0;

[NoCoverage] LogicalOperator
services/playerStatsService.ts:141:13
         `, [uuid, uuid]);
         
         let val = Number(rows[0]?.vault_balance) || 0;
-        if (val === 0 && rows[0]?.vault_balance_str) {
+        if (val === 0 || rows[0]?.vault_balance_str) {
             val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) || 0;
         }

[NoCoverage] EqualityOperator
services/playerStatsService.ts:141:13
         `, [uuid, uuid]);
         
         let val = Number(rows[0]?.vault_balance) || 0;
-        if (val === 0 && rows[0]?.vault_balance_str) {
+        if (val !== 0 && rows[0]?.vault_balance_str) {
             val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) || 0;
         }

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:142:19
         
         let val = Number(rows[0]?.vault_balance) || 0;
         if (val === 0 && rows[0]?.vault_balance_str) {
-            val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) || 0;
+            val = false;
         }
         return val;

[NoCoverage] LogicalOperator
services/playerStatsService.ts:142:19
         
         let val = Number(rows[0]?.vault_balance) || 0;
         if (val === 0 && rows[0]?.vault_balance_str) {
-            val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) || 0;
+            val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) && 0;
         }
         return val;

[NoCoverage] BlockStatement
services/playerStatsService.ts:145:13
             val = Number(rows[0].vault_balance_str.replace(/[^0-9.]/g, '')) || 0;
         }
         return val;
-    } catch { return 0; }
+    } catch {}
 };
 

[NoCoverage] BlockStatement
services/playerStatsService.ts:148:52
     } catch { return 0; }
 };
 
-const getLuckPermsGroups = async (uuid: string) => {
-    try {
-        const [lpUsers] = await db.query<RowDataPacket[]>(`SELECT primary_group FROM luckperms_players WHERE uuid = ?`, [uuid]);
-        const groups: string[] = [];
-        if (lpUsers.length > 0 && lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);
-        
-        const [lpPerms] = await db.query<RowDataPacket[]>(`SELECT permission FROM luckperms_user_permissions WHERE uuid = ? AND permission LIKE 'group.%'`, [uuid]);
-        // Typed row instead of any
-        lpPerms.forEach((row) => groups.push(row.permission.replace('group.', '')));
-        return groups;
-    } catch { return ['default']; }
-};
+const getLuckPermsGroups = async (uuid: string) => {};
 
 

[NoCoverage] BlockStatement
services/playerStatsService.ts:149:9
 };
 
 const getLuckPermsGroups = async (uuid: string) => {
-    try {
-        const [lpUsers] = await db.query<RowDataPacket[]>(`SELECT primary_group FROM luckperms_players WHERE uuid = ?`, [uuid]);
-        const groups: string[] = [];
-        if (lpUsers.length > 0 && lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);
-        
-        const [lpPerms] = await db.query<RowDataPacket[]>(`SELECT permission FROM luckperms_user_permissions WHERE uuid = ? AND permission LIKE 'group.%'`, [uuid]);
-        // Typed row instead of any
-        lpPerms.forEach((row) => groups.push(row.permission.replace('group.', '')));
-        return groups;
-    } catch { return ['default']; }
+    try {} catch { return ['default']; }
 };
 

[NoCoverage] ArrayDeclaration
services/playerStatsService.ts:150:121
 
 const getLuckPermsGroups = async (uuid: string) => {
     try {
-        const [lpUsers] = await db.query<RowDataPacket[]>(`SELECT primary_group FROM luckperms_players WHERE uuid = ?`, [uuid]);
+        const [lpUsers] = await db.query<RowDataPacket[]>(`SELECT primary_group FROM luckperms_players WHERE uuid = ?`, []);
         const groups: string[] = [];
         if (lpUsers.length > 0 && lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);

[NoCoverage] ArrayDeclaration
services/playerStatsService.ts:151:34
 const getLuckPermsGroups = async (uuid: string) => {
     try {
         const [lpUsers] = await db.query<RowDataPacket[]>(`SELECT primary_group FROM luckperms_players WHERE uuid = ?`, [uuid]);
-        const groups: string[] = [];
+        const groups: string[] = ["Stryker was here"];
         if (lpUsers.length > 0 && lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);
         

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:152:13
     try {
         const [lpUsers] = await db.query<RowDataPacket[]>(`SELECT primary_group FROM luckperms_players WHERE uuid = ?`, [uuid]);
         const groups: string[] = [];
-        if (lpUsers.length > 0 && lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);
+        if (false) groups.push(lpUsers[0].primary_group);
         
         const [lpPerms] = await db.query<RowDataPacket[]>(`SELECT permission FROM luckperms_user_permissions WHERE uuid = ? AND permission LIKE 'group.%'`, [uuid]);

[NoCoverage] LogicalOperator
services/playerStatsService.ts:152:13
     try {
         const [lpUsers] = await db.query<RowDataPacket[]>(`SELECT primary_group FROM luckperms_players WHERE uuid = ?`, [uuid]);
         const groups: string[] = [];
-        if (lpUsers.length > 0 && lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);
+        if (lpUsers.length > 0 || lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);
         
         const [lpPerms] = await db.query<RowDataPacket[]>(`SELECT permission FROM luckperms_user_permissions WHERE uuid = ? AND permission LIKE 'group.%'`, [uuid]);

[NoCoverage] StringLiteral
services/playerStatsService.ts:154:59
         const groups: string[] = [];
         if (lpUsers.length > 0 && lpUsers[0].primary_group) groups.push(lpUsers[0].primary_group);
         
-        const [lpPerms] = await db.query<RowDataPacket[]>(`SELECT permission FROM luckperms_user_permissions WHERE uuid = ? AND permission LIKE 'group.%'`, [uuid]);
+        const [lpPerms] = await db.query<RowDataPacket[]>(``, [uuid]);
         // Typed row instead of any
         lpPerms.forEach((row) => groups.push(row.permission.replace('group.', '')));

[NoCoverage] ArrowFunction
services/playerStatsService.ts:156:25
         
         const [lpPerms] = await db.query<RowDataPacket[]>(`SELECT permission FROM luckperms_user_permissions WHERE uuid = ? AND permission LIKE 'group.%'`, [uuid]);
         // Typed row instead of any
-        lpPerms.forEach((row) => groups.push(row.permission.replace('group.', '')));
+        lpPerms.forEach(() => undefined);
         return groups;
     } catch { return ['default']; }

[NoCoverage] BlockStatement
services/playerStatsService.ts:158:13
         // Typed row instead of any
         lpPerms.forEach((row) => groups.push(row.permission.replace('group.', '')));
         return groups;
-    } catch { return ['default']; }
+    } catch {}
 };
 

[NoCoverage] ArrayDeclaration
services/playerStatsService.ts:158:22
         // Typed row instead of any
         lpPerms.forEach((row) => groups.push(row.permission.replace('group.', '')));
         return groups;
-    } catch { return ['default']; }
+    } catch { return []; }
 };
 

[NoCoverage] LogicalOperator
services/playerStatsService.ts:163:46
 
 
 const processRank = (groups: string[]) => {
-    const normalizedGroups = groups.map(g => GROUP_MAP[g] || g.toLowerCase());
+    const normalizedGroups = groups.map(g => GROUP_MAP[g] && g.toLowerCase());
     let highestRank = 'default';
     let highestIndex = -1;

[NoCoverage] ArrowFunction
services/playerStatsService.ts:163:41
 
 
 const processRank = (groups: string[]) => {
-    const normalizedGroups = groups.map(g => GROUP_MAP[g] || g.toLowerCase());
+    const normalizedGroups = groups.map(() => undefined);
     let highestRank = 'default';
     let highestIndex = -1;

[NoCoverage] UnaryOperator
services/playerStatsService.ts:165:24
 const processRank = (groups: string[]) => {
     const normalizedGroups = groups.map(g => GROUP_MAP[g] || g.toLowerCase());
     let highestRank = 'default';
-    let highestIndex = -1;
+    let highestIndex = +1;
     
     normalizedGroups.forEach(g => {

[NoCoverage] BlockStatement
services/playerStatsService.ts:167:35
     let highestRank = 'default';
     let highestIndex = -1;
     
-    normalizedGroups.forEach(g => {
-        const idx = RANK_PRIORITY.indexOf(g);
-        if (idx > highestIndex) { highestIndex = idx; highestRank = g; }
-    });
+    normalizedGroups.forEach(g => {});
     
     if (highestIndex === -1 && normalizedGroups.length > 0) {

[NoCoverage] EqualityOperator
services/playerStatsService.ts:169:13
     
     normalizedGroups.forEach(g => {
         const idx = RANK_PRIORITY.indexOf(g);
-        if (idx > highestIndex) { highestIndex = idx; highestRank = g; }
+        if (idx >= highestIndex) { highestIndex = idx; highestRank = g; }
     });
     

[NoCoverage] EqualityOperator
services/playerStatsService.ts:169:13
     
     normalizedGroups.forEach(g => {
         const idx = RANK_PRIORITY.indexOf(g);
-        if (idx > highestIndex) { highestIndex = idx; highestRank = g; }
+        if (idx <= highestIndex) { highestIndex = idx; highestRank = g; }
     });
     

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:172:9
         if (idx > highestIndex) { highestIndex = idx; highestRank = g; }
     });
     
-    if (highestIndex === -1 && normalizedGroups.length > 0) {
+    if (false) {
             const nonDef = normalizedGroups.find(g => g !== 'default');
             if (nonDef) highestRank = nonDef;

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:172:9
         if (idx > highestIndex) { highestIndex = idx; highestRank = g; }
     });
     
-    if (highestIndex === -1 && normalizedGroups.length > 0) {
+    if (true) {
             const nonDef = normalizedGroups.find(g => g !== 'default');
             if (nonDef) highestRank = nonDef;

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:173:55
     });
     
     if (highestIndex === -1 && normalizedGroups.length > 0) {
-            const nonDef = normalizedGroups.find(g => g !== 'default');
+            const nonDef = normalizedGroups.find(g => true);
             if (nonDef) highestRank = nonDef;
     }

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:173:55
     });
     
     if (highestIndex === -1 && normalizedGroups.length > 0) {
-            const nonDef = normalizedGroups.find(g => g !== 'default');
+            const nonDef = normalizedGroups.find(g => false);
             if (nonDef) highestRank = nonDef;
     }

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:174:17
     
     if (highestIndex === -1 && normalizedGroups.length > 0) {
             const nonDef = normalizedGroups.find(g => g !== 'default');
-            if (nonDef) highestRank = nonDef;
+            if (true) highestRank = nonDef;
     }
 

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:174:17
     
     if (highestIndex === -1 && normalizedGroups.length > 0) {
             const nonDef = normalizedGroups.find(g => g !== 'default');
-            if (nonDef) highestRank = nonDef;
+            if (false) highestRank = nonDef;
     }
 

[NoCoverage] MethodExpression
services/playerStatsService.ts:177:58
             if (nonDef) highestRank = nonDef;
     }
 
-    let rankName = highestRank.charAt(0).toUpperCase() + highestRank.slice(1);
+    let rankName = highestRank.charAt(0).toUpperCase() + highestRank;
     if (highestRank === 'developer') rankName = 'Developer';
 

[NoCoverage] ArithmeticOperator
services/playerStatsService.ts:177:20
             if (nonDef) highestRank = nonDef;
     }
 
-    let rankName = highestRank.charAt(0).toUpperCase() + highestRank.slice(1);
+    let rankName = highestRank.charAt(0).toUpperCase() - highestRank.slice(1);
     if (highestRank === 'developer') rankName = 'Developer';
 

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:178:9
     }
 
     let rankName = highestRank.charAt(0).toUpperCase() + highestRank.slice(1);
-    if (highestRank === 'developer') rankName = 'Developer';
+    if (true) rankName = 'Developer';
 
     let rankImage = 'user.png';

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:178:9
     }
 
     let rankName = highestRank.charAt(0).toUpperCase() + highestRank.slice(1);
-    if (highestRank === 'developer') rankName = 'Developer';
+    if (false) rankName = 'Developer';
 
     let rankImage = 'user.png';

[NoCoverage] ConditionalExpression
services/playerStatsService.ts:182:9
 
     let rankImage = 'user.png';
     switch (highestRank) {
-        case 'neroferno': rankImage = 'rank-neroferno.png'; break;
+        case 'neroferno':
         case 'fundador':  rankImage = 'rank-fundador.png'; break;
         case 'donador':   rankImage = 'rank-donador.png'; break;
