[NoCoverage] BlockStatement
services/policyService.ts:4:43
 import supabase from '../config/supabaseClient.js';
 
 
-export const getAllPolicies = async () => {
-    const { data, error } = await supabase
-        .from('site_policies')
-        .select('*');
-    
-    if (error) throw error;
-    return data;
-};
+export const getAllPolicies = async () => {};
 
 export const getPolicyBySlug = async (slug: string) => {

[NoCoverage] StringLiteral
services/policyService.ts:6:15
 
 export const getAllPolicies = async () => {
     const { data, error } = await supabase
-        .from('site_policies')
+        .from("")
         .select('*');
     

[NoCoverage] BlockStatement
services/policyService.ts:13:56
     return data;
 };
 
-export const getPolicyBySlug = async (slug: string) => {
-    const { data, error } = await supabase
-        .from('site_policies')
-        .select('*')
-        .eq('slug', slug)
-        .single();
-    
-    if (error) throw error;
-    return data;
-};
+export const getPolicyBySlug = async (slug: string) => {};
 
 export const updatePolicy = async (slug: string, title: string, content: string, title_en: string, content_en: string, userId: string) => {

[NoCoverage] BlockStatement
services/policyService.ts:24:139
     return data;
 };
 
-export const updatePolicy = async (slug: string, title: string, content: string, title_en: string, content_en: string, userId: string) => {
-    const { data, error } = await supabase
-        .from('site_policies')
-        .update({ 
-            title, 
-            content,
-            title_en,
-            content_en,
-            last_updated_by: userId,
-            updated_at: new Date().toISOString()
-        })
-        .eq('slug', slug)
-        .select()
-        .single();
-    
-    if (error) throw error;
-    return data;
-};
+export const updatePolicy = async (slug: string, title: string, content: string, title_en: string, content_en: string, userId: string) => {};
 
