[NoCoverage] BooleanLiteral
services/pollService.ts:53:26
     const { data: poll, error } = await supabase
         .from('polls')
         .select('*')
-        .eq('is_active', true)
+        .eq('is_active', false)
         .order('created_at', { ascending: false })
         .limit(1)

[NoCoverage] BooleanLiteral
services/pollService.ts:54:43
         .from('polls')
         .select('*')
         .eq('is_active', true)
-        .order('created_at', { ascending: false })
+        .order('created_at', { ascending: true })
         .limit(1)
         .maybeSingle(); // maybeSingle allows null if 0 rows

[NoCoverage] StringLiteral
services/pollService.ts:54:16
         .from('polls')
         .select('*')
         .eq('is_active', true)
-        .order('created_at', { ascending: false })
+        .order("", { ascending: false })
         .limit(1)
         .maybeSingle(); // maybeSingle allows null if 0 rows

[NoCoverage] BlockStatement
services/pollService.ts:58:16
         .limit(1)
         .maybeSingle(); // maybeSingle allows null if 0 rows
     
-    if (error) {
-        console.error("Error fetching active poll:", error);
-        return null;
-    }
+    if (error) {}
     if (!poll) return null;
 

[NoCoverage] ConditionalExpression
services/pollService.ts:62:9
         console.error("Error fetching active poll:", error);
         return null;
     }
-    if (!poll) return null;
+    if (true) return null;
 
     // 2. Fetch options

[NoCoverage] ConditionalExpression
services/pollService.ts:62:9
         console.error("Error fetching active poll:", error);
         return null;
     }
-    if (!poll) return null;
+    if (false) return null;
 
     // 2. Fetch options

[NoCoverage] StringLiteral
services/pollService.ts:68:13
     const { data: options } = await supabase
         .from('poll_options')
         .select('*')
-        .eq('poll_id', poll.id)
+        .eq("", poll.id)
         .order('id', { ascending: true });
     

[NoCoverage] BooleanLiteral
services/pollService.ts:69:35
         .from('poll_options')
         .select('*')
         .eq('poll_id', poll.id)
-        .order('id', { ascending: true });
+        .order('id', { ascending: false });
     
     const safeOptions: PollOption[] = options || [];

[NoCoverage] ObjectLiteral
services/pollService.ts:69:22
         .from('poll_options')
         .select('*')
         .eq('poll_id', poll.id)
-        .order('id', { ascending: true });
+        .order('id', {});
     
     const safeOptions: PollOption[] = options || [];

[NoCoverage] ConditionalExpression
services/pollService.ts:71:39
         .eq('poll_id', poll.id)
         .order('id', { ascending: true });
     
-    const safeOptions: PollOption[] = options || [];
+    const safeOptions: PollOption[] = true;
         
     // Calculate total votes

[NoCoverage] ConditionalExpression
services/pollService.ts:71:39
         .eq('poll_id', poll.id)
         .order('id', { ascending: true });
     
-    const safeOptions: PollOption[] = options || [];
+    const safeOptions: PollOption[] = false;
         
     // Calculate total votes

[NoCoverage] ArrowFunction
services/pollService.ts:74:43
     const safeOptions: PollOption[] = options || [];
         
     // Calculate total votes
-    const totalVotes = safeOptions.reduce((sum: number, opt: PollOption) => sum + (opt.votes || 0), 0);
+    const totalVotes = safeOptions.reduce(() => undefined, 0);
     
     // Calculate percentages

[NoCoverage] LogicalOperator
services/pollService.ts:74:84
     const safeOptions: PollOption[] = options || [];
         
     // Calculate total votes
-    const totalVotes = safeOptions.reduce((sum: number, opt: PollOption) => sum + (opt.votes || 0), 0);
+    const totalVotes = safeOptions.reduce((sum: number, opt: PollOption) => sum + (opt.votes && 0), 0);
     
     // Calculate percentages

[NoCoverage] ArrowFunction
services/pollService.ts:77:48
     const totalVotes = safeOptions.reduce((sum: number, opt: PollOption) => sum + (opt.votes || 0), 0);
     
     // Calculate percentages
-    const optionsWithPercent = safeOptions.map((opt: PollOption) => ({
-        ...opt,
-        percent: totalVotes === 0 ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
-    }));
+    const optionsWithPercent = safeOptions.map(() => undefined);
 
     // Calculate time remaining string

[NoCoverage] ObjectLiteral
services/pollService.ts:77:70
     const totalVotes = safeOptions.reduce((sum: number, opt: PollOption) => sum + (opt.votes || 0), 0);
     
     // Calculate percentages
-    const optionsWithPercent = safeOptions.map((opt: PollOption) => ({
-        ...opt,
-        percent: totalVotes === 0 ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
-    }));
+    const optionsWithPercent = safeOptions.map((opt: PollOption) => ({}));
 
     // Calculate time remaining string

[NoCoverage] ConditionalExpression
services/pollService.ts:79:18
     // Calculate percentages
     const optionsWithPercent = safeOptions.map((opt: PollOption) => ({
         ...opt,
-        percent: totalVotes === 0 ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
+        percent: false ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
     }));
 

[NoCoverage] ConditionalExpression
services/pollService.ts:79:18
     // Calculate percentages
     const optionsWithPercent = safeOptions.map((opt: PollOption) => ({
         ...opt,
-        percent: totalVotes === 0 ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
+        percent: true ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
     }));
 

[NoCoverage] ConditionalExpression
services/pollService.ts:84:8
 
     // Calculate time remaining string
     let closesIn = 'Indefinido';
-    if(poll.closes_at) {
+    if(true) {
         const total = Date.parse(poll.closes_at) - Date.now();
         const days = Math.floor(total / (1000 * 60 * 60 * 24));

[NoCoverage] BlockStatement
services/pollService.ts:84:24
 
     // Calculate time remaining string
     let closesIn = 'Indefinido';
-    if(poll.closes_at) {
-        const total = Date.parse(poll.closes_at) - Date.now();
-        const days = Math.floor(total / (1000 * 60 * 60 * 24));
-        const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
-        
-        if (total <= 0) closesIn = "Finalizada";
-        else if (days > 0) closesIn = `${days} días`;
-        else closesIn = `${hours} horas`;
-    }
+    if(poll.closes_at) {}
 
     return {

[NoCoverage] ArithmeticOperator
services/pollService.ts:85:23
     // Calculate time remaining string
     let closesIn = 'Indefinido';
     if(poll.closes_at) {
-        const total = Date.parse(poll.closes_at) - Date.now();
+        const total = Date.parse(poll.closes_at) + Date.now();
         const days = Math.floor(total / (1000 * 60 * 60 * 24));
         const hours = Math.floor((total / (1000 * 60 * 60)) % 24);

[NoCoverage] ArithmeticOperator
services/pollService.ts:86:42
     let closesIn = 'Indefinido';
     if(poll.closes_at) {
         const total = Date.parse(poll.closes_at) - Date.now();
-        const days = Math.floor(total / (1000 * 60 * 60 * 24));
+        const days = Math.floor(total / (1000 * 60 * 60 / 24));
         const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
         

[NoCoverage] ArithmeticOperator
services/pollService.ts:86:42
     let closesIn = 'Indefinido';
     if(poll.closes_at) {
         const total = Date.parse(poll.closes_at) - Date.now();
-        const days = Math.floor(total / (1000 * 60 * 60 * 24));
+        const days = Math.floor(total / (1000 * 60 / 60 * 24));
         const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
         

[NoCoverage] ArithmeticOperator
services/pollService.ts:87:44
     if(poll.closes_at) {
         const total = Date.parse(poll.closes_at) - Date.now();
         const days = Math.floor(total / (1000 * 60 * 60 * 24));
-        const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
+        const hours = Math.floor((total / (1000 / 60 * 60)) % 24);
         
         if (total <= 0) closesIn = "Finalizada";

[NoCoverage] ArithmeticOperator
services/pollService.ts:87:35
     if(poll.closes_at) {
         const total = Date.parse(poll.closes_at) - Date.now();
         const days = Math.floor(total / (1000 * 60 * 60 * 24));
-        const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
+        const hours = Math.floor((total * (1000 * 60 * 60)) % 24);
         
         if (total <= 0) closesIn = "Finalizada";

[NoCoverage] EqualityOperator
services/pollService.ts:89:13
         const days = Math.floor(total / (1000 * 60 * 60 * 24));
         const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
         
-        if (total <= 0) closesIn = "Finalizada";
+        if (total > 0) closesIn = "Finalizada";
         else if (days > 0) closesIn = `${days} días`;
         else closesIn = `${hours} horas`;

[NoCoverage] EqualityOperator
services/pollService.ts:89:13
         const days = Math.floor(total / (1000 * 60 * 60 * 24));
         const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
         
-        if (total <= 0) closesIn = "Finalizada";
+        if (total < 0) closesIn = "Finalizada";
         else if (days > 0) closesIn = `${days} días`;
         else closesIn = `${hours} horas`;

[NoCoverage] EqualityOperator
services/pollService.ts:90:18
         const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
         
         if (total <= 0) closesIn = "Finalizada";
-        else if (days > 0) closesIn = `${days} días`;
+        else if (days <= 0) closesIn = `${days} días`;
         else closesIn = `${hours} horas`;
     }

[NoCoverage] ConditionalExpression
services/pollService.ts:90:18
         const hours = Math.floor((total / (1000 * 60 * 60)) % 24);
         
         if (total <= 0) closesIn = "Finalizada";
-        else if (days > 0) closesIn = `${days} días`;
+        else if (false) closesIn = `${days} días`;
         else closesIn = `${hours} horas`;
     }

[NoCoverage] StringLiteral
services/pollService.ts:91:25
         
         if (total <= 0) closesIn = "Finalizada";
         else if (days > 0) closesIn = `${days} días`;
-        else closesIn = `${hours} horas`;
+        else closesIn = ``;
     }
 

[NoCoverage] BlockStatement
services/pollService.ts:102:50
     };
 };
 
-export const getPollById = async (id: number) => {
-    const { data: poll, error } = await supabase.from('polls').select('*').eq('id', id).single();
-    if(error || !poll) return null;
-
-    const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);
-    const safeOptions: PollOption[] = options || [];
-    const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (o.votes||0), 0);
-    
-    // Calculate percentages
-    const optionsWithPercent = safeOptions.map((opt: PollOption) => ({
-        ...opt,
-        percent: totalVotes === 0 ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
-    }));
-
-    // Time Calc
-    let closesIn = 'Indefinido';
-    if(poll.closes_at) {
-        const total = Date.parse(poll.closes_at) - Date.now();
-        const days = Math.floor(total / (1000 * 60 * 60 * 24));
-        if (total <= 0) closesIn = "Finalizada";
-        else closesIn = `${days} días`;
-    }
-
-    return { ...poll, options: optionsWithPercent, totalVotes, closesIn };
-};
+export const getPollById = async (id: number) => {};
 
 export const votePoll = async (pollId: number, optionId: number, userId: string) => {

[NoCoverage] StringLiteral
services/pollService.ts:103:79
 };
 
 export const getPollById = async (id: number) => {
-    const { data: poll, error } = await supabase.from('polls').select('*').eq('id', id).single();
+    const { data: poll, error } = await supabase.from('polls').select('*').eq("", id).single();
     if(error || !poll) return null;
 

[NoCoverage] BooleanLiteral
services/pollService.ts:104:17
 
 export const getPollById = async (id: number) => {
     const { data: poll, error } = await supabase.from('polls').select('*').eq('id', id).single();
-    if(error || !poll) return null;
+    if(error || poll) return null;
 
     const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);

[NoCoverage] ConditionalExpression
services/pollService.ts:104:8
 
 export const getPollById = async (id: number) => {
     const { data: poll, error } = await supabase.from('polls').select('*').eq('id', id).single();
-    if(error || !poll) return null;
+    if(true) return null;
 
     const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);

[NoCoverage] StringLiteral
services/pollService.ts:106:82
     const { data: poll, error } = await supabase.from('polls').select('*').eq('id', id).single();
     if(error || !poll) return null;
 
-    const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);
+    const { data: options } = await supabase.from('poll_options').select('*').eq("", poll.id);
     const safeOptions: PollOption[] = options || [];
     const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (o.votes||0), 0);

[NoCoverage] ConditionalExpression
services/pollService.ts:107:39
     if(error || !poll) return null;
 
     const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);
-    const safeOptions: PollOption[] = options || [];
+    const safeOptions: PollOption[] = false;
     const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (o.votes||0), 0);
     

[NoCoverage] LogicalOperator
services/pollService.ts:107:39
     if(error || !poll) return null;
 
     const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);
-    const safeOptions: PollOption[] = options || [];
+    const safeOptions: PollOption[] = options && [];
     const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (o.votes||0), 0);
     

[NoCoverage] ConditionalExpression
services/pollService.ts:108:82
 
     const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);
     const safeOptions: PollOption[] = options || [];
-    const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (o.votes||0), 0);
+    const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (true), 0);
     
     // Calculate percentages

[NoCoverage] ConditionalExpression
services/pollService.ts:108:82
 
     const { data: options } = await supabase.from('poll_options').select('*').eq('poll_id', poll.id);
     const safeOptions: PollOption[] = options || [];
-    const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (o.votes||0), 0);
+    const totalVotes = safeOptions.reduce((acc: number, o: PollOption) => acc + (false), 0);
     
     // Calculate percentages

[NoCoverage] LogicalOperator
services/pollService.ts:113:54
     // Calculate percentages
     const optionsWithPercent = safeOptions.map((opt: PollOption) => ({
         ...opt,
-        percent: totalVotes === 0 ? 0 : Math.round(((opt.votes || 0) / totalVotes) * 100)
+        percent: totalVotes === 0 ? 0 : Math.round(((opt.votes && 0) / totalVotes) * 100)
     }));
 

[NoCoverage] ConditionalExpression
services/pollService.ts:118:8
 
     // Time Calc
     let closesIn = 'Indefinido';
-    if(poll.closes_at) {
+    if(false) {
         const total = Date.parse(poll.closes_at) - Date.now();
         const days = Math.floor(total / (1000 * 60 * 60 * 24));

[NoCoverage] ArithmeticOperator
services/pollService.ts:120:42
     let closesIn = 'Indefinido';
     if(poll.closes_at) {
         const total = Date.parse(poll.closes_at) - Date.now();
-        const days = Math.floor(total / (1000 * 60 * 60 * 24));
+        const days = Math.floor(total / (1000 / 60 * 60 * 24));
         if (total <= 0) closesIn = "Finalizada";
         else closesIn = `${days} días`;

[NoCoverage] EqualityOperator
services/pollService.ts:121:13
     if(poll.closes_at) {
         const total = Date.parse(poll.closes_at) - Date.now();
         const days = Math.floor(total / (1000 * 60 * 60 * 24));
-        if (total <= 0) closesIn = "Finalizada";
+        if (total > 0) closesIn = "Finalizada";
         else closesIn = `${days} días`;
     }

[NoCoverage] ConditionalExpression
services/pollService.ts:121:13
     if(poll.closes_at) {
         const total = Date.parse(poll.closes_at) - Date.now();
         const days = Math.floor(total / (1000 * 60 * 60 * 24));
-        if (total <= 0) closesIn = "Finalizada";
+        if (false) closesIn = "Finalizada";
         else closesIn = `${days} días`;
     }

[NoCoverage] StringLiteral
services/pollService.ts:133:13
     const { data: option, error: fetchError } = await supabase
         .from('poll_options')
         .select('id, poll_id')
-        .eq('id', optionId)
+        .eq("", optionId)
         .single();
         

[NoCoverage] LogicalOperator
services/pollService.ts:136:9
         .eq('id', optionId)
         .single();
         
-    if (fetchError || !option) throw new Error("Option not found");
+    if (fetchError && !option) throw new Error("Option not found");
     if (option.poll_id !== pollId) throw new Error("Invalid option for this poll");
 

[NoCoverage] ConditionalExpression
services/pollService.ts:136:9
         .eq('id', optionId)
         .single();
         
-    if (fetchError || !option) throw new Error("Option not found");
+    if (false) throw new Error("Option not found");
     if (option.poll_id !== pollId) throw new Error("Invalid option for this poll");
 

[NoCoverage] ConditionalExpression
services/pollService.ts:137:9
         .single();
         
     if (fetchError || !option) throw new Error("Option not found");
-    if (option.poll_id !== pollId) throw new Error("Invalid option for this poll");
+    if (false) throw new Error("Invalid option for this poll");
 
     // 2. Check if the poll is active and not expired

[NoCoverage] EqualityOperator
services/pollService.ts:137:9
         .single();
         
     if (fetchError || !option) throw new Error("Option not found");
-    if (option.poll_id !== pollId) throw new Error("Invalid option for this poll");
+    if (option.poll_id === pollId) throw new Error("Invalid option for this poll");
 
     // 2. Check if the poll is active and not expired

[NoCoverage] BooleanLiteral
services/pollService.ts:146:22
         .eq('id', pollId)
         .single();
 
-    if (pollError || !poll) throw new Error("Poll not found");
+    if (pollError || poll) throw new Error("Poll not found");
     if (!poll.is_active) throw new Error("La encuesta ya no está activa");
     if (poll.closes_at && new Date(poll.closes_at) <= new Date()) {

[NoCoverage] ConditionalExpression
services/pollService.ts:146:9
         .eq('id', pollId)
         .single();
 
-    if (pollError || !poll) throw new Error("Poll not found");
+    if (false) throw new Error("Poll not found");
     if (!poll.is_active) throw new Error("La encuesta ya no está activa");
     if (poll.closes_at && new Date(poll.closes_at) <= new Date()) {

[NoCoverage] BooleanLiteral
services/pollService.ts:147:9
         .single();
 
     if (pollError || !poll) throw new Error("Poll not found");
-    if (!poll.is_active) throw new Error("La encuesta ya no está activa");
+    if (poll.is_active) throw new Error("La encuesta ya no está activa");
     if (poll.closes_at && new Date(poll.closes_at) <= new Date()) {
         throw new Error("La encuesta ha finalizado");

[NoCoverage] ConditionalExpression
services/pollService.ts:147:9
         .single();
 
     if (pollError || !poll) throw new Error("Poll not found");
-    if (!poll.is_active) throw new Error("La encuesta ya no está activa");
+    if (true) throw new Error("La encuesta ya no está activa");
     if (poll.closes_at && new Date(poll.closes_at) <= new Date()) {
         throw new Error("La encuesta ha finalizado");

[NoCoverage] EqualityOperator
services/pollService.ts:148:27
 
     if (pollError || !poll) throw new Error("Poll not found");
     if (!poll.is_active) throw new Error("La encuesta ya no está activa");
-    if (poll.closes_at && new Date(poll.closes_at) <= new Date()) {
+    if (poll.closes_at && new Date(poll.closes_at) < new Date()) {
         throw new Error("La encuesta ha finalizado");
     }

[NoCoverage] ConditionalExpression
services/pollService.ts:148:9
 
     if (pollError || !poll) throw new Error("Poll not found");
     if (!poll.is_active) throw new Error("La encuesta ya no está activa");
-    if (poll.closes_at && new Date(poll.closes_at) <= new Date()) {
+    if (true) {
         throw new Error("La encuesta ha finalizado");
     }

[NoCoverage] StringLiteral
services/pollService.ts:149:25
     if (pollError || !poll) throw new Error("Poll not found");
     if (!poll.is_active) throw new Error("La encuesta ya no está activa");
     if (poll.closes_at && new Date(poll.closes_at) <= new Date()) {
-        throw new Error("La encuesta ha finalizado");
+        throw new Error("");
     }
 

[NoCoverage] StringLiteral
services/pollService.ts:154:15
 
     // 2. Insert into poll_votes (unique constraint handles double-voting)
     const { error: voteError } = await supabase
-        .from('poll_votes')
+        .from("")
         .insert([{
             poll_id: pollId,

[NoCoverage] BlockStatement
services/pollService.ts:161:20
             option_id: optionId
         }]);
 
-    if (voteError) {
-        if (voteError.code === '23505') { // Unique violation
-            throw new Error("Ya has votado en esta encuesta");
-        }
-        throw voteError;
-    }
+    if (voteError) {}
     
     // 3. fetch the updated count from poll_options (updated via trigger)

[NoCoverage] ConditionalExpression
services/pollService.ts:161:9
             option_id: optionId
         }]);
 
-    if (voteError) {
+    if (true) {
         if (voteError.code === '23505') { // Unique violation
             throw new Error("Ya has votado en esta encuesta");

[NoCoverage] ConditionalExpression
services/pollService.ts:162:13
         }]);
 
     if (voteError) {
-        if (voteError.code === '23505') { // Unique violation
+        if (true) { // Unique violation
             throw new Error("Ya has votado en esta encuesta");
         }

[NoCoverage] BlockStatement
services/pollService.ts:162:41
         }]);
 
     if (voteError) {
-        if (voteError.code === '23505') { // Unique violation
-            throw new Error("Ya has votado en esta encuesta");
-        }
+        if (voteError.code === '23505') {}
         throw voteError;
     }

[NoCoverage] StringLiteral
services/pollService.ts:163:29
 
     if (voteError) {
         if (voteError.code === '23505') { // Unique violation
-            throw new Error("Ya has votado en esta encuesta");
+            throw new Error("");
         }
         throw voteError;

[NoCoverage] StringLiteral
services/pollService.ts:172:13
     const { data: updatedOption } = await supabase
         .from('poll_options')
         .select('votes')
-        .eq('id', optionId)
+        .eq("", optionId)
         .single();
 

[NoCoverage] ConditionalExpression
services/pollService.ts:175:36
         .eq('id', optionId)
         .single();
 
-    return { success: true, votes: updatedOption?.votes || 0 };
+    return { success: true, votes: false };
 };
 

[NoCoverage] BooleanLiteral
services/pollService.ts:175:23
         .eq('id', optionId)
         .single();
 
-    return { success: true, votes: updatedOption?.votes || 0 };
+    return { success: false, votes: updatedOption?.votes || 0 };
 };
 

[NoCoverage] ConditionalExpression
services/pollService.ts:180:9
 
 export const createPoll = async ({ title, title_en, question, question_en, options, closes_at, thread_id, discord_link }: CreatePollDTO) => {
     // Deactivate others ONLY if Global (no thread_id)
-    if (!thread_id) {
+    if (false) {
         await supabase.from('polls').update({ is_active: false }).is('thread_id', null).neq('id', -1); 
     }

[NoCoverage] BlockStatement
services/pollService.ts:180:21
 
 export const createPoll = async ({ title, title_en, question, question_en, options, closes_at, thread_id, discord_link }: CreatePollDTO) => {
     // Deactivate others ONLY if Global (no thread_id)
-    if (!thread_id) {
-        await supabase.from('polls').update({ is_active: false }).is('thread_id', null).neq('id', -1); 
-    }
+    if (!thread_id) {}
 
     const finalTitleEn = title_en ? title_en : await translateText(title, 'en');

[NoCoverage] BooleanLiteral
services/pollService.ts:181:58
 export const createPoll = async ({ title, title_en, question, question_en, options, closes_at, thread_id, discord_link }: CreatePollDTO) => {
     // Deactivate others ONLY if Global (no thread_id)
     if (!thread_id) {
-        await supabase.from('polls').update({ is_active: false }).is('thread_id', null).neq('id', -1); 
+        await supabase.from('polls').update({ is_active: true }).is('thread_id', null).neq('id', -1); 
     }
 

[NoCoverage] UnaryOperator
services/pollService.ts:181:99
 export const createPoll = async ({ title, title_en, question, question_en, options, closes_at, thread_id, discord_link }: CreatePollDTO) => {
     // Deactivate others ONLY if Global (no thread_id)
     if (!thread_id) {
-        await supabase.from('polls').update({ is_active: false }).is('thread_id', null).neq('id', -1); 
+        await supabase.from('polls').update({ is_active: false }).is('thread_id', null).neq('id', +1); 
     }
 

[NoCoverage] StringLiteral
services/pollService.ts:184:75
         await supabase.from('polls').update({ is_active: false }).is('thread_id', null).neq('id', -1); 
     }
 
-    const finalTitleEn = title_en ? title_en : await translateText(title, 'en');
+    const finalTitleEn = title_en ? title_en : await translateText(title, "");
     const finalQuestionEn = question_en ? question_en : await translateText(question, 'en');
 

[NoCoverage] StringLiteral
services/pollService.ts:185:87
     }
 
     const finalTitleEn = title_en ? title_en : await translateText(title, 'en');
-    const finalQuestionEn = question_en ? question_en : await translateText(question, 'en');
+    const finalQuestionEn = question_en ? question_en : await translateText(question, "");
 
     const { data: poll, error } = await supabase

[NoCoverage] StringLiteral
services/pollService.ts:188:15
     const finalQuestionEn = question_en ? question_en : await translateText(question, 'en');
 
     const { data: poll, error } = await supabase
-        .from('polls')
+        .from("")
         .insert([{ 
             title, 

[NoCoverage] ObjectLiteral
services/pollService.ts:189:18
 
     const { data: poll, error } = await supabase
         .from('polls')
-        .insert([{ 
-            title, 
-            question, 
-            title_en: finalTitleEn,
-            question_en: finalQuestionEn,
-            is_active: true, 
-            closes_at,
-            thread_id: thread_id || null,
-            discord_link: discord_link || null
-        }])
+        .insert([{}])
         .select()
         .single();

[NoCoverage] BooleanLiteral
services/pollService.ts:194:24
             question, 
             title_en: finalTitleEn,
             question_en: finalQuestionEn,
-            is_active: true, 
+            is_active: false, 
             closes_at,
             thread_id: thread_id || null,

[NoCoverage] ConditionalExpression
services/pollService.ts:196:24
             question_en: finalQuestionEn,
             is_active: true, 
             closes_at,
-            thread_id: thread_id || null,
+            thread_id: false,
             discord_link: discord_link || null
         }])

[NoCoverage] ConditionalExpression
services/pollService.ts:196:24
             question_en: finalQuestionEn,
             is_active: true, 
             closes_at,
-            thread_id: thread_id || null,
+            thread_id: true,
             discord_link: discord_link || null
         }])

[NoCoverage] ConditionalExpression
services/pollService.ts:197:27
             is_active: true, 
             closes_at,
             thread_id: thread_id || null,
-            discord_link: discord_link || null
+            discord_link: false
         }])
         .select()

[NoCoverage] LogicalOperator
services/pollService.ts:197:27
             is_active: true, 
             closes_at,
             thread_id: thread_id || null,
-            discord_link: discord_link || null
+            discord_link: discord_link && null
         }])
         .select()

[NoCoverage] LogicalOperator
services/pollService.ts:204:9
     
     if (error) throw error;
 
-    if (options && options.length > 0) {
+    if (options || options.length > 0) {
         // Options can be string[] or { label, label_en }[]
         const optionsData = await Promise.all(options.map(async (opt) => {

[NoCoverage] ConditionalExpression
services/pollService.ts:204:20
     
     if (error) throw error;
 
-    if (options && options.length > 0) {
+    if (options && true) {
         // Options can be string[] or { label, label_en }[]
         const optionsData = await Promise.all(options.map(async (opt) => {
