[Survived] ConditionalExpression
services/prompts/pressAgentPrompt.ts:21:3
 - Trata las tragedias del juego (caer a la lava, morir contra un boss) con exageración cómica.
 
 DATOS OFICIALES DEL MODPACK (RAG VERIFICADO):
-${input.ragKnowledgeContext || 'No hay datos específicos de mods para esta edición.'}
+${false}
 
 MEMES DISPONIBLES EN EL CATÁLOGO (RAG):

[Survived] ConditionalExpression
services/prompts/pressAgentPrompt.ts:21:3
 - Trata las tragedias del juego (caer a la lava, morir contra un boss) con exageración cómica.
 
 DATOS OFICIALES DEL MODPACK (RAG VERIFICADO):
-${input.ragKnowledgeContext || 'No hay datos específicos de mods para esta edición.'}
+${true}
 
 MEMES DISPONIBLES EN EL CATÁLOGO (RAG):

[Survived] ConditionalExpression
services/prompts/pressAgentPrompt.ts:24:3
 ${input.ragKnowledgeContext || 'No hay datos específicos de mods para esta edición.'}
 
 MEMES DISPONIBLES EN EL CATÁLOGO (RAG):
-${input.ragMemeContext || 'Catálogo estándar de memes hispanos.'}
+${false}
 
 CHISMES Y DEBATES DE DISCORD (#charla-general / HILOS 72H):

[Survived] ConditionalExpression
services/prompts/pressAgentPrompt.ts:24:3
 ${input.ragKnowledgeContext || 'No hay datos específicos de mods para esta edición.'}
 
 MEMES DISPONIBLES EN EL CATÁLOGO (RAG):
-${input.ragMemeContext || 'Catálogo estándar de memes hispanos.'}
+${true}
 
 CHISMES Y DEBATES DE DISCORD (#charla-general / HILOS 72H):

[Survived] ConditionalExpression
services/prompts/pressAgentPrompt.ts:27:3
 ${input.ragMemeContext || 'Catálogo estándar de memes hispanos.'}
 
 CHISMES Y DEBATES DE DISCORD (#charla-general / HILOS 72H):
-${input.discordGossipContext || 'El chat de Discord estuvo tranquilo hoy.'}
+${true}
 
 EVENTOS Y TELEMETRÍA DEL SERVIDOR (COMBATES / ECONOMÍA):

[Survived] LogicalOperator
services/prompts/pressAgentPrompt.ts:27:3
 ${input.ragMemeContext || 'Catálogo estándar de memes hispanos.'}
 
 CHISMES Y DEBATES DE DISCORD (#charla-general / HILOS 72H):
-${input.discordGossipContext || 'El chat de Discord estuvo tranquilo hoy.'}
+${input.discordGossipContext && 'El chat de Discord estuvo tranquilo hoy.'}
 
 EVENTOS Y TELEMETRÍA DEL SERVIDOR (COMBATES / ECONOMÍA):

[Survived] ConditionalExpression
services/prompts/pressAgentPrompt.ts:30:3
 ${input.discordGossipContext || 'El chat de Discord estuvo tranquilo hoy.'}
 
 EVENTOS Y TELEMETRÍA DEL SERVIDOR (COMBATES / ECONOMÍA):
-${input.inGameEventsContext || 'Actividad rutinaria registrada en el servidor.'}
+${false}
 
 ESTRUCTURA OBLIGATORIA DEL PERIÓDICO (EN MARKDOWN):

[Survived] LogicalOperator
services/prompts/pressAgentPrompt.ts:30:3
 ${input.discordGossipContext || 'El chat de Discord estuvo tranquilo hoy.'}
 
 EVENTOS Y TELEMETRÍA DEL SERVIDOR (COMBATES / ECONOMÍA):
-${input.inGameEventsContext || 'Actividad rutinaria registrada en el servidor.'}
+${input.inGameEventsContext && 'Actividad rutinaria registrada en el servidor.'}
 
 ESTRUCTURA OBLIGATORIA DEL PERIÓDICO (EN MARKDOWN):
