[NoCoverage] ConditionalExpression
services/suggestionService.ts:16:9
 export const createSuggestion = async (data: SuggestionData) => {
     const validation = await validateSuggestion(data.message);
 
-    if (!validation.isValid) {
+    if (true) {
         return {
             error: true,

[NoCoverage] BooleanLiteral
services/suggestionService.ts:16:9
 export const createSuggestion = async (data: SuggestionData) => {
     const validation = await validateSuggestion(data.message);
 
-    if (!validation.isValid) {
+    if (validation.isValid) {
         return {
             error: true,

[NoCoverage] ObjectLiteral
services/suggestionService.ts:17:16
     const validation = await validateSuggestion(data.message);
 
     if (!validation.isValid) {
-        return {
-            error: true,
-            isValid: false,
-            message: validation.explanation,
-            engine: validation.engine
-        };
+        return {};
     }
 

[NoCoverage] BooleanLiteral
services/suggestionService.ts:18:20
 
     if (!validation.isValid) {
         return {
-            error: true,
+            error: false,
             isValid: false,
             message: validation.explanation,

[NoCoverage] BooleanLiteral
services/suggestionService.ts:19:22
     if (!validation.isValid) {
         return {
             error: true,
-            isValid: false,
+            isValid: true,
             message: validation.explanation,
             engine: validation.engine

[NoCoverage] BlockStatement
services/suggestionService.ts:26:9
     }
 
     let messageEn = '';
-    try {
-        messageEn = await translateText(data.message, 'en');
-    } catch {
+    try {} catch {
         messageEn = data.message;
     }

[NoCoverage] BlockStatement
services/suggestionService.ts:28:13
     let messageEn = '';
     try {
         messageEn = await translateText(data.message, 'en');
-    } catch {
-        messageEn = data.message;
-    }
+    } catch {}
 
     const { data: result, error } = await supabase

[NoCoverage] ObjectLiteral
services/suggestionService.ts:34:18
 
     const { data: result, error } = await supabase
         .from('suggestions')
-        .insert([{
-            nickname: data.nickname || 'Anónimo',
-            type: data.type || 'General',
-            message: data.message,
-            message_en: messageEn,
-            user_id: data.user_id || null,
-            status: 'pending',
-            auto_validated: true,
-            kc_awarded: 100
-        }])
+        .insert([{}])
         .select()
         .single();

[NoCoverage] ConditionalExpression
services/suggestionService.ts:35:23
     const { data: result, error } = await supabase
         .from('suggestions')
         .insert([{
-            nickname: data.nickname || 'Anónimo',
+            nickname: false,
             type: data.type || 'General',
             message: data.message,

[NoCoverage] LogicalOperator
services/suggestionService.ts:35:23
     const { data: result, error } = await supabase
         .from('suggestions')
         .insert([{
-            nickname: data.nickname || 'Anónimo',
+            nickname: data.nickname && 'Anónimo',
             type: data.type || 'General',
             message: data.message,

[NoCoverage] ConditionalExpression
services/suggestionService.ts:36:19
         .from('suggestions')
         .insert([{
             nickname: data.nickname || 'Anónimo',
-            type: data.type || 'General',
+            type: false,
             message: data.message,
             message_en: messageEn,

[NoCoverage] ConditionalExpression
services/suggestionService.ts:36:19
         .from('suggestions')
         .insert([{
             nickname: data.nickname || 'Anónimo',
-            type: data.type || 'General',
+            type: true,
             message: data.message,
             message_en: messageEn,

[NoCoverage] LogicalOperator
services/suggestionService.ts:39:22
             type: data.type || 'General',
             message: data.message,
             message_en: messageEn,
-            user_id: data.user_id || null,
+            user_id: data.user_id && null,
             status: 'pending',
             auto_validated: true,

[NoCoverage] ConditionalExpression
services/suggestionService.ts:39:22
             type: data.type || 'General',
             message: data.message,
             message_en: messageEn,
-            user_id: data.user_id || null,
+            user_id: true,
             status: 'pending',
             auto_validated: true,

[NoCoverage] BooleanLiteral
services/suggestionService.ts:41:29
             message_en: messageEn,
             user_id: data.user_id || null,
             status: 'pending',
-            auto_validated: true,
+            auto_validated: false,
             kc_awarded: 100
         }])

[NoCoverage] ConditionalExpression
services/suggestionService.ts:50:9
     if (error) throw error;
 
     let newBalance: number | undefined;
-    if (data.user_id) {
+    if (true) {
         try {
             await addGachaBalance(data.user_id, 100);

[NoCoverage] ConditionalExpression
services/suggestionService.ts:50:9
     if (error) throw error;
 
     let newBalance: number | undefined;
-    if (data.user_id) {
+    if (false) {
         try {
             await addGachaBalance(data.user_id, 100);

[NoCoverage] BlockStatement
services/suggestionService.ts:51:13
 
     let newBalance: number | undefined;
     if (data.user_id) {
-        try {
-            await addGachaBalance(data.user_id, 100);
-        } catch (kcError) {
+        try {} catch (kcError) {
             console.error('[SuggestionService] Failed to award instant 100 KC:', kcError);
         }

[NoCoverage] BlockStatement
services/suggestionService.ts:53:27
     if (data.user_id) {
         try {
             await addGachaBalance(data.user_id, 100);
-        } catch (kcError) {
-            console.error('[SuggestionService] Failed to award instant 100 KC:', kcError);
-        }
+        } catch (kcError) {}
     }
 

[NoCoverage] ObjectLiteral
services/suggestionService.ts:58:12
         }
     }
 
-    return {
-        ...result,
-        validation,
-        kc_awarded: 100,
-        newBalance
-    };
+    return {};
 };
 

[NoCoverage] BlockStatement
services/suggestionService.ts:66:43
     };
 };
 
-export const getSuggestions = async () => {
-    const { data, error } = await supabase
-        .from('suggestions')
-        .select('*')
-        .order('created_at', { ascending: false });
-
-    if (error) throw error;
-    return data;
-};
+export const getSuggestions = async () => {};
 
 export const deleteSuggestion = async (id: number) => {

[NoCoverage] BlockStatement
services/suggestionService.ts:76:55
     return data;
 };
 
-export const deleteSuggestion = async (id: number) => {
-    const { error } = await supabase.from('suggestions').delete().eq('id', id);
-    if (error) throw error;
-    return { success: true };
-};
+export const deleteSuggestion = async (id: number) => {};
 
 async function awardApprovalBonusAndBadge(userId: string): Promise<void> {

[NoCoverage] ConditionalExpression
services/suggestionService.ts:78:9
 
 export const deleteSuggestion = async (id: number) => {
     const { error } = await supabase.from('suggestions').delete().eq('id', id);
-    if (error) throw error;
+    if (true) throw error;
     return { success: true };
 };

[NoCoverage] ConditionalExpression
services/suggestionService.ts:78:9
 
 export const deleteSuggestion = async (id: number) => {
     const { error } = await supabase.from('suggestions').delete().eq('id', id);
-    if (error) throw error;
+    if (false) throw error;
     return { success: true };
 };

[NoCoverage] BlockStatement
services/suggestionService.ts:82:74
     return { success: true };
 };
 
-async function awardApprovalBonusAndBadge(userId: string): Promise<void> {
-    try {
-        await addGachaBalance(userId, 500);
-
-        const { data: profile } = await supabase
-            .from('profiles')
-            .select('badges')
-            .eq('id', userId)
-            .single();
-
-        const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
-        if (!currentBadges.includes('Mente Creativa')) {
-            const updatedBadges = [...currentBadges, 'Mente Creativa'];
-            await supabase
-                .from('profiles')
-                .update({ badges: updatedBadges })
-                .eq('id', userId);
-        }
-    } catch (kcError) {
-        console.error('[SuggestionService] Failed to award 500 KC approval bonus or badge:', kcError);
-    }
-}
+async function awardApprovalBonusAndBadge(userId: string): Promise<void> {}
 
 async function queueInGameBroadcast(authorNick: string): Promise<void> {

[NoCoverage] BlockStatement
services/suggestionService.ts:83:9
 };
 
 async function awardApprovalBonusAndBadge(userId: string): Promise<void> {
-    try {
-        await addGachaBalance(userId, 500);
-
-        const { data: profile } = await supabase
-            .from('profiles')
-            .select('badges')
-            .eq('id', userId)
-            .single();
-
-        const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
-        if (!currentBadges.includes('Mente Creativa')) {
-            const updatedBadges = [...currentBadges, 'Mente Creativa'];
-            await supabase
-                .from('profiles')
-                .update({ badges: updatedBadges })
-                .eq('id', userId);
-        }
-    } catch (kcError) {
+    try {} catch (kcError) {
         console.error('[SuggestionService] Failed to award 500 KC approval bonus or badge:', kcError);
     }

[NoCoverage] StringLiteral
services/suggestionService.ts:88:21
 
         const { data: profile } = await supabase
             .from('profiles')
-            .select('badges')
+            .select("")
             .eq('id', userId)
             .single();

[NoCoverage] OptionalChaining
services/suggestionService.ts:92:55
             .eq('id', userId)
             .single();
 
-        const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
+        const currentBadges: string[] = Array.isArray(profile.badges) ? profile.badges : [];
         if (!currentBadges.includes('Mente Creativa')) {
             const updatedBadges = [...currentBadges, 'Mente Creativa'];

[NoCoverage] ArrayDeclaration
services/suggestionService.ts:92:91
             .eq('id', userId)
             .single();
 
-        const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
+        const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : ["Stryker was here"];
         if (!currentBadges.includes('Mente Creativa')) {
             const updatedBadges = [...currentBadges, 'Mente Creativa'];

[NoCoverage] ConditionalExpression
services/suggestionService.ts:93:13
             .single();
 
         const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
-        if (!currentBadges.includes('Mente Creativa')) {
+        if (false) {
             const updatedBadges = [...currentBadges, 'Mente Creativa'];
             await supabase

[NoCoverage] ConditionalExpression
services/suggestionService.ts:93:13
             .single();
 
         const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
-        if (!currentBadges.includes('Mente Creativa')) {
+        if (true) {
             const updatedBadges = [...currentBadges, 'Mente Creativa'];
             await supabase

[NoCoverage] StringLiteral
services/suggestionService.ts:94:54
 
         const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
         if (!currentBadges.includes('Mente Creativa')) {
-            const updatedBadges = [...currentBadges, 'Mente Creativa'];
+            const updatedBadges = [...currentBadges, ""];
             await supabase
                 .from('profiles')

[NoCoverage] ArrayDeclaration
services/suggestionService.ts:94:35
 
         const currentBadges: string[] = Array.isArray(profile?.badges) ? profile.badges : [];
         if (!currentBadges.includes('Mente Creativa')) {
-            const updatedBadges = [...currentBadges, 'Mente Creativa'];
+            const updatedBadges = [];
             await supabase
                 .from('profiles')

[NoCoverage] ObjectLiteral
services/suggestionService.ts:97:25
             const updatedBadges = [...currentBadges, 'Mente Creativa'];
             await supabase
                 .from('profiles')
-                .update({ badges: updatedBadges })
+                .update({})
                 .eq('id', userId);
         }

[NoCoverage] StringLiteral
services/suggestionService.ts:98:21
             await supabase
                 .from('profiles')
                 .update({ badges: updatedBadges })
-                .eq('id', userId);
+                .eq("", userId);
         }
     } catch (kcError) {

[NoCoverage] BlockStatement
services/suggestionService.ts:100:23
                 .update({ badges: updatedBadges })
                 .eq('id', userId);
         }
-    } catch (kcError) {
-        console.error('[SuggestionService] Failed to award 500 KC approval bonus or badge:', kcError);
-    }
+    } catch (kcError) {}
 }
 

[NoCoverage] BlockStatement
services/suggestionService.ts:105:72
     }
 }
 
-async function queueInGameBroadcast(authorNick: string): Promise<void> {
-    try {
-        await supabase.from('web_pending_commands').insert([{
-            command: `broadcast &a&l[SUGERENCIA APROBADA] &fLa propuesta de &e${authorNick}&f fue aprobada. ¡+500 KC!`,
-            created_at: new Date().toISOString()
-        }]);
-    } catch (cmdError) {
-        console.error('[SuggestionService] Failed to queue in-game broadcast command:', cmdError);
-    }
-}
+async function queueInGameBroadcast(authorNick: string): Promise<void> {}
 
 async function notifyDiscordWebhook(authorNick: string, message: string): Promise<void> {

[NoCoverage] BlockStatement
services/suggestionService.ts:106:9
 }
 
 async function queueInGameBroadcast(authorNick: string): Promise<void> {
-    try {
-        await supabase.from('web_pending_commands').insert([{
-            command: `broadcast &a&l[SUGERENCIA APROBADA] &fLa propuesta de &e${authorNick}&f fue aprobada. ¡+500 KC!`,
-            created_at: new Date().toISOString()
-        }]);
-    } catch (cmdError) {
+    try {} catch (cmdError) {
         console.error('[SuggestionService] Failed to queue in-game broadcast command:', cmdError);
     }

[NoCoverage] StringLiteral
services/suggestionService.ts:107:29
 
 async function queueInGameBroadcast(authorNick: string): Promise<void> {
     try {
-        await supabase.from('web_pending_commands').insert([{
+        await supabase.from("").insert([{
             command: `broadcast &a&l[SUGERENCIA APROBADA] &fLa propuesta de &e${authorNick}&f fue aprobada. ¡+500 KC!`,
             created_at: new Date().toISOString()

[NoCoverage] BlockStatement
services/suggestionService.ts:111:24
             command: `broadcast &a&l[SUGERENCIA APROBADA] &fLa propuesta de &e${authorNick}&f fue aprobada. ¡+500 KC!`,
             created_at: new Date().toISOString()
         }]);
-    } catch (cmdError) {
-        console.error('[SuggestionService] Failed to queue in-game broadcast command:', cmdError);
-    }
+    } catch (cmdError) {}
 }
 

[NoCoverage] StringLiteral
services/suggestionService.ts:112:23
             created_at: new Date().toISOString()
         }]);
     } catch (cmdError) {
-        console.error('[SuggestionService] Failed to queue in-game broadcast command:', cmdError);
+        console.error("", cmdError);
     }
 }

[NoCoverage] BlockStatement
services/suggestionService.ts:116:89
     }
 }
 
-async function notifyDiscordWebhook(authorNick: string, message: string): Promise<void> {
-    const discordWebhook = process.env.DISCORD_SUGGESTIONS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
-    if (!discordWebhook) return;
-
-    try {
-        await fetch(discordWebhook, {
-            method: 'POST',
-            headers: { 'Content-Type': 'application/json' },
-            body: JSON.stringify({
-                embeds: [{
-                    title: '💡 Sugerencia Aprobada',
-                    description: `**Propuesta de ${authorNick}:**\n"${message}"`,
-                    color: 0x22c55e,
-                    fields: [
-                        { name: 'Recompensa', value: '+500 KilluCoins (KC)', inline: true },
-                        { name: 'Insignia', value: '🎨 Mente Creativa', inline: true }
-                    ],
-                    timestamp: new Date().toISOString()
-                }]
-            })
-        });
-    } catch (webhookError) {
-        console.error('[SuggestionService] Failed to trigger Discord webhook:', webhookError);
-    }
-}
+async function notifyDiscordWebhook(authorNick: string, message: string): Promise<void> {}
 
 export const updateStatus = async (id: number, status: string) => {

[NoCoverage] ConditionalExpression
services/suggestionService.ts:117:28
 }
 
 async function notifyDiscordWebhook(authorNick: string, message: string): Promise<void> {
-    const discordWebhook = process.env.DISCORD_SUGGESTIONS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
+    const discordWebhook = false;
     if (!discordWebhook) return;
 

[NoCoverage] ConditionalExpression
services/suggestionService.ts:117:28
 }
 
 async function notifyDiscordWebhook(authorNick: string, message: string): Promise<void> {
-    const discordWebhook = process.env.DISCORD_SUGGESTIONS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
+    const discordWebhook = true;
     if (!discordWebhook) return;
 

[NoCoverage] ConditionalExpression
services/suggestionService.ts:118:9
 
 async function notifyDiscordWebhook(authorNick: string, message: string): Promise<void> {
     const discordWebhook = process.env.DISCORD_SUGGESTIONS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
-    if (!discordWebhook) return;
+    if (false) return;
 
     try {

[NoCoverage] BooleanLiteral
services/suggestionService.ts:118:9
 
 async function notifyDiscordWebhook(authorNick: string, message: string): Promise<void> {
     const discordWebhook = process.env.DISCORD_SUGGESTIONS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
-    if (!discordWebhook) return;
+    if (discordWebhook) return;
 
     try {

[NoCoverage] BlockStatement
services/suggestionService.ts:120:9
     const discordWebhook = process.env.DISCORD_SUGGESTIONS_WEBHOOK_URL || process.env.DISCORD_WEBHOOK_URL;
     if (!discordWebhook) return;
 
-    try {
-        await fetch(discordWebhook, {
-            method: 'POST',
-            headers: { 'Content-Type': 'application/json' },
-            body: JSON.stringify({
-                embeds: [{
-                    title: '💡 Sugerencia Aprobada',
-                    description: `**Propuesta de ${authorNick}:**\n"${message}"`,
-                    color: 0x22c55e,
-                    fields: [
-                        { name: 'Recompensa', value: '+500 KilluCoins (KC)', inline: true },
-                        { name: 'Insignia', value: '🎨 Mente Creativa', inline: true }
-                    ],
-                    timestamp: new Date().toISOString()
-                }]
-            })
-        });
-    } catch (webhookError) {
+    try {} catch (webhookError) {
         console.error('[SuggestionService] Failed to trigger Discord webhook:', webhookError);
     }

[NoCoverage] ObjectLiteral
services/suggestionService.ts:124:34
         await fetch(discordWebhook, {
             method: 'POST',
             headers: { 'Content-Type': 'application/json' },
-            body: JSON.stringify({
-                embeds: [{
-                    title: '💡 Sugerencia Aprobada',
-                    description: `**Propuesta de ${authorNick}:**\n"${message}"`,
-                    color: 0x22c55e,
-                    fields: [
-                        { name: 'Recompensa', value: '+500 KilluCoins (KC)', inline: true },
-                        { name: 'Insignia', value: '🎨 Mente Creativa', inline: true }
-                    ],
-                    timestamp: new Date().toISOString()
-                }]
-            })
+            body: JSON.stringify({})
         });
     } catch (webhookError) {

[NoCoverage] ArrayDeclaration
services/suggestionService.ts:125:25
             method: 'POST',
             headers: { 'Content-Type': 'application/json' },
             body: JSON.stringify({
-                embeds: [{
-                    title: '💡 Sugerencia Aprobada',
-                    description: `**Propuesta de ${authorNick}:**\n"${message}"`,
-                    color: 0x22c55e,
-                    fields: [
-                        { name: 'Recompensa', value: '+500 KilluCoins (KC)', inline: true },
-                        { name: 'Insignia', value: '🎨 Mente Creativa', inline: true }
-                    ],
-                    timestamp: new Date().toISOString()
-                }]
+                embeds: []
             })
         });

[NoCoverage] BooleanLiteral
services/suggestionService.ts:130:86
                     description: `**Propuesta de ${authorNick}:**\n"${message}"`,
                     color: 0x22c55e,
                     fields: [
-                        { name: 'Recompensa', value: '+500 KilluCoins (KC)', inline: true },
+                        { name: 'Recompensa', value: '+500 KilluCoins (KC)', inline: false },
                         { name: 'Insignia', value: '🎨 Mente Creativa', inline: true }
                     ],

[NoCoverage] BooleanLiteral
services/suggestionService.ts:131:81
                     color: 0x22c55e,
                     fields: [
                         { name: 'Recompensa', value: '+500 KilluCoins (KC)', inline: true },
-                        { name: 'Insignia', value: '🎨 Mente Creativa', inline: true }
+                        { name: 'Insignia', value: '🎨 Mente Creativa', inline: tfalse}
                     ],
                     timestamp: new Date().toISOString()

[NoCoverage] BlockStatement
services/suggestionService.ts:137:28
                 }]
             })
         });
-    } catch (webhookError) {
-        console.error('[SuggestionService] Failed to trigger Discord webhook:', webhookError);
-    }
+    } catch (webhookError) {}
 }
 

[NoCoverage] StringLiteral
services/suggestionService.ts:138:23
             })
         });
     } catch (webhookError) {
-        console.error('[SuggestionService] Failed to trigger Discord webhook:', webhookError);
+        console.error("", webhookError);
     }
 }

[NoCoverage] StringLiteral
services/suggestionService.ts:144:15
 
 export const updateStatus = async (id: number, status: string) => {
     const { data: existing, error: fetchError } = await supabase
-        .from('suggestions')
+        .from("")
         .select('*')
         .eq('id', id)

[NoCoverage] StringLiteral
services/suggestionService.ts:146:13
     const { data: existing, error: fetchError } = await supabase
         .from('suggestions')
         .select('*')
-        .eq('id', id)
+        .eq("", id)
         .single();
 

[NoCoverage] StringLiteral
services/suggestionService.ts:152:15
     if (fetchError) throw fetchError;
 
     const { data, error } = await supabase
-        .from('suggestions')
+        .from("")
         .update({ status })
         .eq('id', id)

[NoCoverage] LogicalOperator
services/suggestionService.ts:160:30
 
     if (error) throw error;
 
-    const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
+    const isNewlyApproved = (status === 'approved' && status === 'implemented') && existing.status !== status;
     if (isNewlyApproved) {
         const authorNick = existing.nickname || 'Un usuario';

[NoCoverage] EqualityOperator
services/suggestionService.ts:160:84
 
     if (error) throw error;
 
-    const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
+    const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status === status;
     if (isNewlyApproved) {
         const authorNick = existing.nickname || 'Un usuario';

[NoCoverage] BlockStatement
services/suggestionService.ts:161:26
     if (error) throw error;
 
     const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
-    if (isNewlyApproved) {
-        const authorNick = existing.nickname || 'Un usuario';
-        if (existing.user_id) {
-            await awardApprovalBonusAndBadge(existing.user_id);
-        }
-        await queueInGameBroadcast(authorNick);
-        await notifyDiscordWebhook(authorNick, existing.message);
-    }
+    if (isNewlyApproved) {}
 
     return data;

[NoCoverage] ConditionalExpression
services/suggestionService.ts:161:9
     if (error) throw error;
 
     const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
-    if (isNewlyApproved) {
+    if (true) {
         const authorNick = existing.nickname || 'Un usuario';
         if (existing.user_id) {

[NoCoverage] ConditionalExpression
services/suggestionService.ts:162:28
 
     const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
     if (isNewlyApproved) {
-        const authorNick = existing.nickname || 'Un usuario';
+        const authorNick = false;
         if (existing.user_id) {
             await awardApprovalBonusAndBadge(existing.user_id);

[NoCoverage] LogicalOperator
services/suggestionService.ts:162:28
 
     const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
     if (isNewlyApproved) {
-        const authorNick = existing.nickname || 'Un usuario';
+        const authorNick = existing.nickname && 'Un usuario';
         if (existing.user_id) {
             await awardApprovalBonusAndBadge(existing.user_id);

[NoCoverage] ConditionalExpression
services/suggestionService.ts:163:13
     const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
     if (isNewlyApproved) {
         const authorNick = existing.nickname || 'Un usuario';
-        if (existing.user_id) {
+        if (true) {
             await awardApprovalBonusAndBadge(existing.user_id);
         }

[NoCoverage] ConditionalExpression
services/suggestionService.ts:163:13
     const isNewlyApproved = (status === 'approved' || status === 'implemented') && existing.status !== status;
     if (isNewlyApproved) {
         const authorNick = existing.nickname || 'Un usuario';
-        if (existing.user_id) {
+        if (false) {
             await awardApprovalBonusAndBadge(existing.user_id);
         }
