[Timeout] Regex
services/suggestionValidatorService.ts:14:5
     /qwer/i,
     /zxcv/i,
     /(.)\1{5,}/i, // Caracteres repetidos 6+ veces
-    /^test$/i,
+    /test$/i,
     /^hola$/i,
     /^a+$/i

[Timeout] ArrayDeclaration
services/suggestionValidatorService.ts:19:25
     /^a+$/i
 ];
 
-const SERVER_KEYWORDS = [
-    'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
-    'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
-    'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',
-    'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', 'mazmorra'
-];
+const SERVER_KEYWORDS = [];
 
 export async function validateWithLocalNLP(message: string): Promise<ValidationResult> {

[Timeout] StringLiteral
services/suggestionValidatorService.ts:20:47
 ];
 
 const SERVER_KEYWORDS = [
-    'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
+    'minecraft', 'server', 'servidor', 'mod', "", 'jefe', 'item', 'ítem',
     'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
     'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',

[Timeout] StringLiteral
services/suggestionValidatorService.ts:20:71
 ];
 
 const SERVER_KEYWORDS = [
-    'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
+    'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', "",
     'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
     'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',

[Timeout] StringLiteral
services/suggestionValidatorService.ts:21:54
 
 const SERVER_KEYWORDS = [
     'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
-    'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
+    'arma', 'armadura', 'gacha', 'mercado', 'bolsa', "", 'killucoin', 'plugin',
     'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',
     'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', 'mazmorra'

[Timeout] StringLiteral
services/suggestionValidatorService.ts:21:5
 
 const SERVER_KEYWORDS = [
     'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
-    'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
+    "", 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
     'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',
     'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', 'mazmorra'

[Timeout] StringLiteral
services/suggestionValidatorService.ts:22:71
 const SERVER_KEYWORDS = [
     'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
     'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
-    'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',
+    'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', "",
     'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', 'mazmorra'
 ];

[Timeout] StringLiteral
services/suggestionValidatorService.ts:22:57
 const SERVER_KEYWORDS = [
     'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
     'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
-    'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',
+    'mapa', 'craft', 'crafteo', 'evento', 'recompensa', "", 'pve', 'discord',
     'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', 'mazmorra'
 ];

[Timeout] StringLiteral
services/suggestionValidatorService.ts:23:67
     'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
     'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
     'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',
-    'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', 'mazmorra'
+    'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', ""
 ];
 

[Timeout] StringLiteral
services/suggestionValidatorService.ts:23:37
     'minecraft', 'server', 'servidor', 'mod', 'boss', 'jefe', 'item', 'ítem',
     'arma', 'armadura', 'gacha', 'mercado', 'bolsa', 'kc', 'killucoin', 'plugin',
     'mapa', 'craft', 'crafteo', 'evento', 'recompensa', 'pvp', 'pve', 'discord',
-    'sculk', 'cataclysm', 'mowzie', 'nether', 'end', 'dimension', 'mazmorra'
+    'sculk', 'cataclysm', 'mowzie', "", 'end', 'dimension', 'mazmorra'
 ];
 

[Survived] MethodExpression
services/suggestionValidatorService.ts:27:21
 ];
 
 export async function validateWithLocalNLP(message: string): Promise<ValidationResult> {
-    const trimmed = message.trim();
+    const trimmed = message;
     if (trimmed.length < MIN_LENGTH) {
         return {

[Killed] BlockStatement
services/suggestionValidatorService.ts:28:38
 
 export async function validateWithLocalNLP(message: string): Promise<ValidationResult> {
     const trimmed = message.trim();
-    if (trimmed.length < MIN_LENGTH) {
-        return {
-            isValid: false,
-            confidence: 1.0,
-            explanation: `La sugerencia debe contener al menos ${MIN_LENGTH} caracteres.`,
-            engine: 'local_nlp'
-        };
-    }
+    if (trimmed.length < MIN_LENGTH) {}
 
     for (const pattern of PROHIBITED_PATTERNS) {
killedBy: Suggestion Validator (Local NLP) should reject short suggestions (<15 chars)
statusReason: expected 'La sugerencia contiene patrones repet…' to contain '15 caracteres'

[Killed] EqualityOperator
services/suggestionValidatorService.ts:28:9
 
 export async function validateWithLocalNLP(message: string): Promise<ValidationResult> {
     const trimmed = message.trim();
-    if (trimmed.length < MIN_LENGTH) {
+    if (trimmed.length >= MIN_LENGTH) {
         return {
             isValid: false,
killedBy: Suggestion Validator (Local NLP) should reject short suggestions (<15 chars)
statusReason: expected 'La sugerencia contiene patrones repet…' to contain '15 caracteres'

[Killed] ObjectLiteral
services/suggestionValidatorService.ts:29:16
 export async function validateWithLocalNLP(message: string): Promise<ValidationResult> {
     const trimmed = message.trim();
     if (trimmed.length < MIN_LENGTH) {
-        return {
-            isValid: false,
-            confidence: 1.0,
-            explanation: `La sugerencia debe contener al menos ${MIN_LENGTH} caracteres.`,
-            engine: 'local_nlp'
-        };
+        return {};
     }
 
killedBy: Suggestion Validator (Local NLP) should reject short suggestions (<15 chars)
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
services/suggestionValidatorService.ts:33:21
             isValid: false,
             confidence: 1.0,
             explanation: `La sugerencia debe contener al menos ${MIN_LENGTH} caracteres.`,
-            engine: 'local_nlp'
+            engine: ""
         };
     }

[Killed] BlockStatement
services/suggestionValidatorService.ts:37:48
         };
     }
 
-    for (const pattern of PROHIBITED_PATTERNS) {
-        if (pattern.test(trimmed)) {
-            return {
-                isValid: false,
-                confidence: 0.9,
-                explanation: 'La sugerencia contiene patrones repetitivos o texto de prueba no válido.',
-                engine: 'local_nlp'
-            };
-        }
-    }
+    for (const pattern of PROHIBITED_PATTERNS) {}
 
     const words = trimmed.toLowerCase().split(/\s+/);
killedBy: Suggestion Validator (Local NLP) should reject repetitive spam patterns
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
services/suggestionValidatorService.ts:38:13
     }
 
     for (const pattern of PROHIBITED_PATTERNS) {
-        if (pattern.test(trimmed)) {
+        if (false) {
             return {
                 isValid: false,
killedBy: Suggestion Validator (Local NLP) should reject repetitive spam patterns
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
services/suggestionValidatorService.ts:38:36
     }
 
     for (const pattern of PROHIBITED_PATTERNS) {
-        if (pattern.test(trimmed)) {
-            return {
-                isValid: false,
-                confidence: 0.9,
-                explanation: 'La sugerencia contiene patrones repetitivos o texto de prueba no válido.',
-                engine: 'local_nlp'
-            };
-        }
+        if (pattern.test(trimmed)) {}
     }
 
killedBy: Suggestion Validator (Local NLP) should reject repetitive spam patterns
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
services/suggestionValidatorService.ts:48:19
         }
     }
 
-    const words = trimmed.toLowerCase().split(/\s+/);
+    const words = trimmed.toUpperCase().split(/\s+/);
     const uniqueWords = new Set(words);
     const lexicalDiversity = uniqueWords.size / words.length;

[Survived] ArithmeticOperator
services/suggestionValidatorService.ts:50:30
 
     const words = trimmed.toLowerCase().split(/\s+/);
     const uniqueWords = new Set(words);
-    const lexicalDiversity = uniqueWords.size / words.length;
+    const lexicalDiversity = uniqueWords.size * words.length;
 
     if (words.length >= 3 && lexicalDiversity < 0.4) {

[Killed] EqualityOperator
services/suggestionValidatorService.ts:52:30
     const uniqueWords = new Set(words);
     const lexicalDiversity = uniqueWords.size / words.length;
 
-    if (words.length >= 3 && lexicalDiversity < 0.4) {
+    if (words.length >= 3 && lexicalDiversity >= 0.4) {
         return {
             isValid: false,
killedBy: Suggestion Validator (Local NLP) should approve valid detailed suggestions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
services/suggestionValidatorService.ts:52:30
     const uniqueWords = new Set(words);
     const lexicalDiversity = uniqueWords.size / words.length;
 
-    if (words.length >= 3 && lexicalDiversity < 0.4) {
+    if (words.length >= 3 && true) {
         return {
             isValid: false,
killedBy: Suggestion Validator (Local NLP) should approve valid detailed suggestions
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
services/suggestionValidatorService.ts:61:44
         };
     }
 
-    const matchesKeyword = words.some(w => SERVER_KEYWORDS.some(k => w.includes(k)));
+    const matchesKeyword = words.some(w => SERVER_KEYWORDS.every(k => w.includes(k)));
     const confidence = matchesKeyword ? 0.95 : 0.75;
 

[Survived] MethodExpression
services/suggestionValidatorService.ts:61:28
         };
     }
 
-    const matchesKeyword = words.some(w => SERVER_KEYWORDS.some(k => w.includes(k)));
+    const matchesKeyword = words.every(w => SERVER_KEYWORDS.some(k => w.includes(k)));
     const confidence = matchesKeyword ? 0.95 : 0.75;
 

[Killed] ObjectLiteral
services/suggestionValidatorService.ts:64:12
     const matchesKeyword = words.some(w => SERVER_KEYWORDS.some(k => w.includes(k)));
     const confidence = matchesKeyword ? 0.95 : 0.75;
 
-    return {
-        isValid: true,
-        confidence,
-        explanation: 'Propuesta válida evaluada mediante análisis sintáctico local.',
-        engine: 'local_nlp'
-    };
+    return {};
 }
 
killedBy: Suggestion Validator (Local NLP) should approve valid detailed suggestions
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
services/suggestionValidatorService.ts:67:22
     return {
         isValid: true,
         confidence,
-        explanation: 'Propuesta válida evaluada mediante análisis sintáctico local.',
+        explanation: "",
         engine: 'local_nlp'
     };

[Survived] StringLiteral
services/suggestionValidatorService.ts:68:17
         isValid: true,
         confidence,
         explanation: 'Propuesta válida evaluada mediante análisis sintáctico local.',
-        engine: 'local_nlp'
+        engine: ""
     };
 }

[NoCoverage] ConditionalExpression
services/suggestionValidatorService.ts:73:20
 }
 
 export async function validateSuggestion(message: string): Promise<ValidationResult> {
-    const apiKey = process.env.GEMINI_API_KEY || process.env.GOOGLE_AI_KEY;
+    const apiKey = true;
 
     if (apiKey) {

[NoCoverage] LogicalOperator
services/suggestionValidatorService.ts:73:20
 }
 
 export async function validateSuggestion(message: string): Promise<ValidationResult> {
-    const apiKey = process.env.GEMINI_API_KEY || process.env.GOOGLE_AI_KEY;
+    const apiKey = process.env.GEMINI_API_KEY && process.env.GOOGLE_AI_KEY;
 
     if (apiKey) {

[NoCoverage] ConditionalExpression
services/suggestionValidatorService.ts:75:9
 export async function validateSuggestion(message: string): Promise<ValidationResult> {
     const apiKey = process.env.GEMINI_API_KEY || process.env.GOOGLE_AI_KEY;
 
-    if (apiKey) {
+    if (false) {
         try {
             const prompt = `Eres el validador automático de sugerencias para el servidor de Minecraft CrystalTides SMP.

[NoCoverage] ConditionalExpression
services/suggestionValidatorService.ts:75:9
 export async function validateSuggestion(message: string): Promise<ValidationResult> {
     const apiKey = process.env.GEMINI_API_KEY || process.env.GOOGLE_AI_KEY;
 
-    if (apiKey) {
+    if (true) {
         try {
             const prompt = `Eres el validador automático de sugerencias para el servidor de Minecraft CrystalTides SMP.

[NoCoverage] StringLiteral
services/suggestionValidatorService.ts:89:25
 Responde ESTRICTAMENTE en formato JSON plano sin bloques markdown:
 {"isValid": true|false, "confidence": 0.0-1.0, "explanation": "razón breve en español"}`;
 
-            const url = `https://generativelanguage.googleapis.com/v1beta/models/gemini-2.0-flash:generateContent?key=${apiKey}`;
+            const url = ``;
             const res = await fetch(url, {
                 method: 'POST',

[NoCoverage] ArrayDeclaration
services/suggestionValidatorService.ts:94:31
                 method: 'POST',
                 headers: { 'Content-Type': 'application/json' },
                 body: JSON.stringify({
-                    contents: [{ parts: [{ text: prompt }] }]
+                    contents: []
                 })
             });

[NoCoverage] ObjectLiteral
services/suggestionValidatorService.ts:94:32
                 method: 'POST',
                 headers: { 'Content-Type': 'application/json' },
                 body: JSON.stringify({
-                    contents: [{ parts: [{ text: prompt }] }]
+                    contents: [{}]
                 })
             });

[NoCoverage] BlockStatement
services/suggestionValidatorService.ts:98:25
                 })
             });
 
-            if (res.ok) {
-                const data = await res.json();
-                const text = data?.candidates?.[0]?.content?.parts?.[0]?.text?.trim() || '';
-                const cleanJson = text.replace(/```json/g, '').replace(/```/g, '').trim();
-                const parsed = JSON.parse(cleanJson);
-
-                if (typeof parsed.isValid === 'boolean') {
-                    return {
-                        isValid: parsed.isValid,
-                        confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.9,
-                        explanation: parsed.explanation || (parsed.isValid ? 'Sugerencia aprobada por Gemini AI.' : 'Sugerencia no válida.'),
-                        engine: 'gemini_flash'
-                    };
-                }
-            }
+            if (res.ok) {}
         } catch (error) {
             console.warn('[SuggestionValidator] Fallback to Local NLP due to REST API call failure:', error instanceof Error ? error.message : error);

[NoCoverage] ConditionalExpression
services/suggestionValidatorService.ts:98:17
                 })
             });
 
-            if (res.ok) {
+            if (false) {
                 const data = await res.json();
                 const text = data?.candidates?.[0]?.content?.parts?.[0]?.text?.trim() || '';

[NoCoverage] OptionalChaining
services/suggestionValidatorService.ts:100:30
 
             if (res.ok) {
                 const data = await res.json();
-                const text = data?.candidates?.[0]?.content?.parts?.[0]?.text?.trim() || '';
+                const text = data?.candidates?.[0]?.content?.parts?.[0]?.text.trim() || '';
                 const cleanJson = text.replace(/```json/g, '').replace(/```/g, '').trim();
                 const parsed = JSON.parse(cleanJson);

[NoCoverage] OptionalChaining
services/suggestionValidatorService.ts:100:30
 
             if (res.ok) {
                 const data = await res.json();
-                const text = data?.candidates?.[0]?.content?.parts?.[0]?.text?.trim() || '';
+                const text = data?.candidates?.[0]?.content?.parts[0]?.text?.trim() || '';
                 const cleanJson = text.replace(/```json/g, '').replace(/```/g, '').trim();
                 const parsed = JSON.parse(cleanJson);

[NoCoverage] MethodExpression
services/suggestionValidatorService.ts:101:35
             if (res.ok) {
                 const data = await res.json();
                 const text = data?.candidates?.[0]?.content?.parts?.[0]?.text?.trim() || '';
-                const cleanJson = text.replace(/```json/g, '').replace(/```/g, '').trim();
+                const cleanJson = text.replace(/```json/g, '').replace(/```/g, '');
                 const parsed = JSON.parse(cleanJson);
 

[NoCoverage] BlockStatement
services/suggestionValidatorService.ts:104:58
                 const cleanJson = text.replace(/```json/g, '').replace(/```/g, '').trim();
                 const parsed = JSON.parse(cleanJson);
 
-                if (typeof parsed.isValid === 'boolean') {
-                    return {
-                        isValid: parsed.isValid,
-                        confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.9,
-                        explanation: parsed.explanation || (parsed.isValid ? 'Sugerencia aprobada por Gemini AI.' : 'Sugerencia no válida.'),
-                        engine: 'gemini_flash'
-                    };
-                }
+                if (typeof parsed.isValid === 'boolean') {}
             }
         } catch (error) {

[NoCoverage] ConditionalExpression
services/suggestionValidatorService.ts:104:21
                 const cleanJson = text.replace(/```json/g, '').replace(/```/g, '').trim();
                 const parsed = JSON.parse(cleanJson);
 
-                if (typeof parsed.isValid === 'boolean') {
+                if (false) {
                     return {
                         isValid: parsed.isValid,

[NoCoverage] ConditionalExpression
services/suggestionValidatorService.ts:107:37
                 if (typeof parsed.isValid === 'boolean') {
                     return {
                         isValid: parsed.isValid,
-                        confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.9,
+                        confidence: true ? parsed.confidence : 0.9,
                         explanation: parsed.explanation || (parsed.isValid ? 'Sugerencia aprobada por Gemini AI.' : 'Sugerencia no válida.'),
                         engine: 'gemini_flash'

[NoCoverage] EqualityOperator
services/suggestionValidatorService.ts:107:37
                 if (typeof parsed.isValid === 'boolean') {
                     return {
                         isValid: parsed.isValid,
-                        confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.9,
+                        confidence: typeof parsed.confidence !== 'number' ? parsed.confidence : 0.9,
                         explanation: parsed.explanation || (parsed.isValid ? 'Sugerencia aprobada por Gemini AI.' : 'Sugerencia no válida.'),
                         engine: 'gemini_flash'

[NoCoverage] ConditionalExpression
services/suggestionValidatorService.ts:108:38
                     return {
                         isValid: parsed.isValid,
                         confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.9,
-                        explanation: parsed.explanation || (parsed.isValid ? 'Sugerencia aprobada por Gemini AI.' : 'Sugerencia no válida.'),
+                        explanation: false,
                         engine: 'gemini_flash'
                     };

[NoCoverage] LogicalOperator
services/suggestionValidatorService.ts:108:38
                     return {
                         isValid: parsed.isValid,
                         confidence: typeof parsed.confidence === 'number' ? parsed.confidence : 0.9,
-                        explanation: parsed.explanation || (parsed.isValid ? 'Sugerencia aprobada por Gemini AI.' : 'Sugerencia no válida.'),
+                        explanation: parsed.explanation && (parsed.isValid ? 'Sugerencia aprobada por Gemini AI.' : 'Sugerencia no válida.'),
                         engine: 'gemini_flash'
                     };

[NoCoverage] BlockStatement
services/suggestionValidatorService.ts:113:25
                     };
                 }
             }
-        } catch (error) {
-            console.warn('[SuggestionValidator] Fallback to Local NLP due to REST API call failure:', error instanceof Error ? error.message : error);
-        }
+        } catch (error) {}
     }
 
