[Killed] ConditionalExpression
services/twoFactorService.ts:6:26
 import jwt from 'jsonwebtoken';
 import supabase from '../config/supabaseClient.js';
 
-const ADMIN_JWT_SECRET = process.env.ADMIN_JWT_SECRET || (process.env.NODE_ENV === 'test' ? 'test-admin-jwt-secret' : undefined);
+const ADMIN_JWT_SECRET = true;
 if (!ADMIN_JWT_SECRET) {
     throw new Error('ADMIN_JWT_SECRET environment variable is required');
killedBy: Two-Factor Authentication Service should sign and verify admin JWT tokens
statusReason: secretOrPrivateKey is not valid key material

[Timeout] LogicalOperator
services/twoFactorService.ts:6:26
 import jwt from 'jsonwebtoken';
 import supabase from '../config/supabaseClient.js';
 
-const ADMIN_JWT_SECRET = process.env.ADMIN_JWT_SECRET || (process.env.NODE_ENV === 'test' ? 'test-admin-jwt-secret' : undefined);
+const ADMIN_JWT_SECRET = process.env.ADMIN_JWT_SECRET && (process.env.NODE_ENV === 'test' ? 'test-admin-jwt-secret' : undefined);
 if (!ADMIN_JWT_SECRET) {
     throw new Error('ADMIN_JWT_SECRET environment variable is required');

[Timeout] ConditionalExpression
services/twoFactorService.ts:7:5
 import supabase from '../config/supabaseClient.js';
 
 const ADMIN_JWT_SECRET = process.env.ADMIN_JWT_SECRET || (process.env.NODE_ENV === 'test' ? 'test-admin-jwt-secret' : undefined);
-if (!ADMIN_JWT_SECRET) {
+if (true) {
     throw new Error('ADMIN_JWT_SECRET environment variable is required');
 }

[Timeout] ConditionalExpression
services/twoFactorService.ts:7:5
 import supabase from '../config/supabaseClient.js';
 
 const ADMIN_JWT_SECRET = process.env.ADMIN_JWT_SECRET || (process.env.NODE_ENV === 'test' ? 'test-admin-jwt-secret' : undefined);
-if (!ADMIN_JWT_SECRET) {
+if (false) {
     throw new Error('ADMIN_JWT_SECRET environment variable is required');
 }

[Killed] BlockStatement
services/twoFactorService.ts:11:50
     throw new Error('ADMIN_JWT_SECRET environment variable is required');
 }
 
-export const generateSecret = (email: string) => {
-    const secret = speakeasy.generateSecret({
-        name: `CrystalTides (${email})`,
-        issuer: 'CrystalTides'
-    });
-    // Authy/authenticator logo support (non-standard but widely supported)
-    // Ideally this should be an absolute URL to the hosted logo
-    const logoUrl = process.env.TWO_FACTOR_LOGO_URL || 'https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/items/master-ball.png';
-    const otpauth_url = secret.otpauth_url 
-        ? `${secret.otpauth_url}&image=${encodeURIComponent(logoUrl)}` 
-        : secret.otpauth_url;
-
-    return {
-        otpauth_url,
-        base32: secret.base32
-    };
-};
+export const generateSecret = (email: string) => {};
 
 export const generateQRCode = async (otpauth_url: string) => {
killedBy: Two-Factor Authentication Service should generate a secret with appropriate otpauth_url and base32 secret
statusReason: Cannot convert undefined or null to object

[Killed] ObjectLiteral
services/twoFactorService.ts:12:45
 }
 
 export const generateSecret = (email: string) => {
-    const secret = speakeasy.generateSecret({
-        name: `CrystalTides (${email})`,
-        issuer: 'CrystalTides'
-    });
+    const secret = speakeasy.generateSecret({});
     // Authy/authenticator logo support (non-standard but widely supported)
     // Ideally this should be an absolute URL to the hosted logo
killedBy: Two-Factor Authentication Service should generate a secret with appropriate otpauth_url and base32 secret
statusReason: expected 'otpauth://totp/SecretKey?secret=NNBDE…' to contain 'CrystalTides'

[Killed] StringLiteral
services/twoFactorService.ts:13:15
 
 export const generateSecret = (email: string) => {
     const secret = speakeasy.generateSecret({
-        name: `CrystalTides (${email})`,
+        name: ``,
         issuer: 'CrystalTides'
     });
killedBy: Two-Factor Authentication Service should generate a secret with appropriate otpauth_url and base32 secret
statusReason: expected 'otpauth://totp/SecretKey?secret=GVGFG…' to contain 'CrystalTides'

[Survived] LogicalOperator
services/twoFactorService.ts:18:21
     });
     // Authy/authenticator logo support (non-standard but widely supported)
     // Ideally this should be an absolute URL to the hosted logo
-    const logoUrl = process.env.TWO_FACTOR_LOGO_URL || 'https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/items/master-ball.png';
+    const logoUrl = process.env.TWO_FACTOR_LOGO_URL && 'https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/items/master-ball.png';
     const otpauth_url = secret.otpauth_url 
         ? `${secret.otpauth_url}&image=${encodeURIComponent(logoUrl)}` 

[Survived] ConditionalExpression
services/twoFactorService.ts:18:21
     });
     // Authy/authenticator logo support (non-standard but widely supported)
     // Ideally this should be an absolute URL to the hosted logo
-    const logoUrl = process.env.TWO_FACTOR_LOGO_URL || 'https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/items/master-ball.png';
+    const logoUrl = false;
     const otpauth_url = secret.otpauth_url 
         ? `${secret.otpauth_url}&image=${encodeURIComponent(logoUrl)}` 

[Killed] ObjectLiteral
services/twoFactorService.ts:23:12
         ? `${secret.otpauth_url}&image=${encodeURIComponent(logoUrl)}` 
         : secret.otpauth_url;
 
-    return {
-        otpauth_url,
-        base32: secret.base32
-    };
+    return {};
 };
 
killedBy: Two-Factor Authentication Service should generate a secret with appropriate otpauth_url and base32 secret
statusReason: expected {} to have property "otpauth_url"

[Killed] BlockStatement
services/twoFactorService.ts:29:62
     };
 };
 
-export const generateQRCode = async (otpauth_url: string) => {
-    return await QRCode.toDataURL(otpauth_url, {
-        errorCorrectionLevel: 'H',
-        margin: 1,
-        width: 300,
-        color: {
-            dark: '#000000',
-            light: '#ffffff'
-        }
-    });
-};
+export const generateQRCode = async (otpauth_url: string) => {};
 
 export const verifyToken = (token: string, secret: string) => {
killedBy: Two-Factor Authentication Service should generate a base64 data URL for QR Code
statusReason: expected undefined to be type of 'string'

[Survived] ObjectLiteral
services/twoFactorService.ts:30:48
 };
 
 export const generateQRCode = async (otpauth_url: string) => {
-    return await QRCode.toDataURL(otpauth_url, {
-        errorCorrectionLevel: 'H',
-        margin: 1,
-        width: 300,
-        color: {
-            dark: '#000000',
-            light: '#ffffff'
-        }
-    });
+    return await QRCode.toDataURL(otpauth_url, {});
 };
 

[Survived] StringLiteral
services/twoFactorService.ts:31:31
 
 export const generateQRCode = async (otpauth_url: string) => {
     return await QRCode.toDataURL(otpauth_url, {
-        errorCorrectionLevel: 'H',
+        errorCorrectionLevel: "",
         margin: 1,
         width: 300,

[Survived] ObjectLiteral
services/twoFactorService.ts:34:16
         errorCorrectionLevel: 'H',
         margin: 1,
         width: 300,
-        color: {
-            dark: '#000000',
-            light: '#ffffff'
-        }
+        color: {}
     });
 };

[Survived] StringLiteral
services/twoFactorService.ts:36:20
         width: 300,
         color: {
             dark: '#000000',
-            light: '#ffffff'
+            light: ""
         }
     });

[Killed] BlockStatement
services/twoFactorService.ts:41:63
     });
 };
 
-export const verifyToken = (token: string, secret: string) => {
-    return speakeasy.totp.verify({
-        secret: secret,
-        encoding: 'base32',
-        token: token,
-        window: 1 // Allow 30s drift (1 step before/after)
-    });
-};
+export const verifyToken = (token: string, secret: string) => {};
 
 export const updateUser2FARecord = async (userId: string, secret: string | null, enabled: boolean) => {
killedBy: Two-Factor Authentication Service should verify a valid TOTP token and reject invalid ones
statusReason: expected undefined to be true // Object.is equality

[NoCoverage] BlockStatement
services/twoFactorService.ts:50:103
     });
 };
 
-export const updateUser2FARecord = async (userId: string, secret: string | null, enabled: boolean) => {
-    // We store the secret in app_metadata so users can't see/edit it easily from client
-    const { data: { user }, error } = await supabase.auth.admin.updateUserById(
-        userId,
-        {
-            app_metadata: {
-                two_factor_enabled: enabled,
-                two_factor_secret: secret
-            }
-        }
-    );
-    
-    if (error) throw error;
-    return user;
-};
+export const updateUser2FARecord = async (userId: string, secret: string | null, enabled: boolean) => {};
 
 export const signAdminToken = (userId: string, role: string) => {

[NoCoverage] ObjectLiteral
services/twoFactorService.ts:55:27
     const { data: { user }, error } = await supabase.auth.admin.updateUserById(
         userId,
         {
-            app_metadata: {
-                two_factor_enabled: enabled,
-                two_factor_secret: secret
-            }
+            app_metadata: {}
         }
     );

[Killed] BlockStatement
services/twoFactorService.ts:66:65
     return user;
 };
 
-export const signAdminToken = (userId: string, role: string) => {
-    return jwt.sign(
-        { sub: userId, role, verified: true },
-        ADMIN_JWT_SECRET,
-        { expiresIn: '15m' }
-    );
-};
+export const signAdminToken = (userId: string, role: string) => {};
 
 export const verifyAdminToken = (token: string) => {
killedBy: Two-Factor Authentication Service should sign and verify admin JWT tokens
statusReason: expected undefined to be type of 'string'

[Killed] BooleanLiteral
services/twoFactorService.ts:68:40
 
 export const signAdminToken = (userId: string, role: string) => {
     return jwt.sign(
-        { sub: userId, role, verified: true },
+        { sub: userId, role, verified: false },
         ADMIN_JWT_SECRET,
         { expiresIn: '15m' }
killedBy: Two-Factor Authentication Service should sign and verify admin JWT tokens
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
services/twoFactorService.ts:68:9
 
 export const signAdminToken = (userId: string, role: string) => {
     return jwt.sign(
-        { sub: userId, role, verified: true },
+        {},
         ADMIN_JWT_SECRET,
         { expiresIn: '15m' }
killedBy: Two-Factor Authentication Service should sign and verify admin JWT tokens
statusReason: expected undefined to be 'user-123-uuid' // Object.is equality

[Survived] ObjectLiteral
services/twoFactorService.ts:70:9
     return jwt.sign(
         { sub: userId, role, verified: true },
         ADMIN_JWT_SECRET,
-        { expiresIn: '15m' }
+        {}
     );
 };

[Killed] BlockStatement
services/twoFactorService.ts:74:52
     );
 };
 
-export const verifyAdminToken = (token: string) => {
-    try {
-        return jwt.verify(token, ADMIN_JWT_SECRET) as { sub: string, role: string, verified: boolean };
-    } catch {
-        return null;
-    }
-};
+export const verifyAdminToken = (token: string) => {};
 
killedBy: Two-Factor Authentication Service should sign and verify admin JWT tokens
statusReason: Cannot read properties of undefined (reading 'sub')

[Killed] BlockStatement
services/twoFactorService.ts:75:9
 };
 
 export const verifyAdminToken = (token: string) => {
-    try {
-        return jwt.verify(token, ADMIN_JWT_SECRET) as { sub: string, role: string, verified: boolean };
-    } catch {
+    try {} catch {
         return null;
     }
killedBy: Two-Factor Authentication Service should sign and verify admin JWT tokens
statusReason: Cannot read properties of undefined (reading 'sub')

[Killed] BlockStatement
services/twoFactorService.ts:77:13
 export const verifyAdminToken = (token: string) => {
     try {
         return jwt.verify(token, ADMIN_JWT_SECRET) as { sub: string, role: string, verified: boolean };
-    } catch {
-        return null;
-    }
+    } catch {}
 };
 
killedBy: Two-Factor Authentication Service should sign and verify admin JWT tokens
statusReason: expected undefined to be null
