[NoCoverage] BlockStatement
services/userService.ts:20:42
 /**
  * Get Staff Users from Database (Stubbed - Legacy)
  */
-export const getStaffUsers = async () => {
-    return [];
-};
+export const getStaffUsers = async () => {};
 
 /**

[NoCoverage] ArrayDeclaration
services/userService.ts:21:12
  * Get Staff Users from Database (Stubbed - Legacy)
  */
 export const getStaffUsers = async () => {
-    return [];
+    return ["Stryker was here"];
 };
 

[NoCoverage] ConditionalExpression
services/userService.ts:36:9
     // If you have a LOT of users, you should rely on server-side pagination or search if available.
     // Standard Supabase List Users does not search by email easily. We will filter in memory for now.
     const { data: { users }, error } = await supabase.auth.admin.listUsers();
-    if (error) throw error;
+    if (false) throw error;
     
     let filtered = users || [];

[NoCoverage] ConditionalExpression
services/userService.ts:36:9
     // If you have a LOT of users, you should rely on server-side pagination or search if available.
     // Standard Supabase List Users does not search by email easily. We will filter in memory for now.
     const { data: { users }, error } = await supabase.auth.admin.listUsers();
-    if (error) throw error;
+    if (true) throw error;
     
     let filtered = users || [];

[NoCoverage] LogicalOperator
services/userService.ts:38:20
     const { data: { users }, error } = await supabase.auth.admin.listUsers();
     if (error) throw error;
     
-    let filtered = users || [];
+    let filtered = users && [];
     if(query) {
         filtered = filtered.filter((u) => 

[NoCoverage] ConditionalExpression
services/userService.ts:38:20
     const { data: { users }, error } = await supabase.auth.admin.listUsers();
     if (error) throw error;
     
-    let filtered = users || [];
+    let filtered = true;
     if(query) {
         filtered = filtered.filter((u) => 

[NoCoverage] ConditionalExpression
services/userService.ts:39:8
     if (error) throw error;
     
     let filtered = users || [];
-    if(query) {
+    if(true) {
         filtered = filtered.filter((u) => 
             (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||

[NoCoverage] ConditionalExpression
services/userService.ts:39:8
     if (error) throw error;
     
     let filtered = users || [];
-    if(query) {
+    if(false) {
         filtered = filtered.filter((u) => 
             (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||

[NoCoverage] MethodExpression
services/userService.ts:40:20
     
     let filtered = users || [];
     if(query) {
-        filtered = filtered.filter((u) => 
-            (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
-        );
+        filtered = filtered;
     }
 

[NoCoverage] ArrowFunction
services/userService.ts:40:36
     
     let filtered = users || [];
     if(query) {
-        filtered = filtered.filter((u) => 
-            (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
+        filtered = filtered.filter(() => undefined
         );
     }

[NoCoverage] ConditionalExpression
services/userService.ts:41:13
     let filtered = users || [];
     if(query) {
         filtered = filtered.filter((u) => 
-            (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
+            false
         );
     }

[NoCoverage] ConditionalExpression
services/userService.ts:41:13
     let filtered = users || [];
     if(query) {
         filtered = filtered.filter((u) => 
-            (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
+            false ||
             (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
         );

[NoCoverage] MethodExpression
services/userService.ts:42:43
     if(query) {
         filtered = filtered.filter((u) => 
             (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
+            (u.user_metadata?.username && u.user_metadata.username.toUpperCase().includes(query.toLowerCase())) ||
             (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
         );

[NoCoverage] ConditionalExpression
services/userService.ts:42:14
     if(query) {
         filtered = filtered.filter((u) => 
             (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
+            (false) ||
             (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
         );

[NoCoverage] OptionalChaining
services/userService.ts:43:14
         filtered = filtered.filter((u) => 
             (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
             (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
+            (u.user_metadata.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
         );
     }

[NoCoverage] ConditionalExpression
services/userService.ts:43:14
         filtered = filtered.filter((u) => 
             (u.email && u.email.toLowerCase().includes(query.toLowerCase())) ||
             (u.user_metadata?.username && u.user_metadata.username.toLowerCase().includes(query.toLowerCase())) ||
-            (u.user_metadata?.full_name && u.user_metadata.full_name.toLowerCase().includes(query.toLowerCase()))
+            (false)
         );
     }

[NoCoverage] BlockStatement
services/userService.ts:48:32
     }
 
     // Map to a friendlier format
-    return filtered.map((u) => {
-        const discordIdentity = u.identities?.find((i) => i.provider === 'discord');
-        const twitchIdentity = u.identities?.find((i) => i.provider === 'twitch');
-
-        return {
-            id: u.id,
-            email: u.email,
-            username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
-            role: u.user_metadata?.role || 'user', // Read from metadata
-            medals: u.user_metadata?.medals || [], // Start empty if none
-            avatar_url: u.user_metadata?.avatar_url,
-            // Connected Accounts
-            discord: discordIdentity ? {
-                id: discordIdentity.id,
-                username: discordIdentity.identity_data?.full_name || discordIdentity.identity_data?.name || discordIdentity.identity_data?.custom_claims?.global_name
-            } : null,
-            twitch: twitchIdentity ? {
-                id: twitchIdentity.id,
-                username: twitchIdentity.identity_data?.full_name || twitchIdentity.identity_data?.name || twitchIdentity.identity_data?.preferred_username
-            } : null,
-            created_at: u.created_at,
-            last_sign_in: u.last_sign_in_at
-        };
-    });
+    return filtered.map((u) => {});
 };
 

[NoCoverage] ConditionalExpression
services/userService.ts:49:59
 
     // Map to a friendlier format
     return filtered.map((u) => {
-        const discordIdentity = u.identities?.find((i) => i.provider === 'discord');
+        const discordIdentity = u.identities?.find((i) => false);
         const twitchIdentity = u.identities?.find((i) => i.provider === 'twitch');
 

[NoCoverage] ArrowFunction
services/userService.ts:49:52
 
     // Map to a friendlier format
     return filtered.map((u) => {
-        const discordIdentity = u.identities?.find((i) => i.provider === 'discord');
+        const discordIdentity = u.identities?.find(() => undefined);
         const twitchIdentity = u.identities?.find((i) => i.provider === 'twitch');
 

[NoCoverage] ConditionalExpression
services/userService.ts:50:58
     // Map to a friendlier format
     return filtered.map((u) => {
         const discordIdentity = u.identities?.find((i) => i.provider === 'discord');
-        const twitchIdentity = u.identities?.find((i) => i.provider === 'twitch');
+        const twitchIdentity = u.identities?.find((i) => true);
 
         return {

[NoCoverage] OptionalChaining
services/userService.ts:50:32
     // Map to a friendlier format
     return filtered.map((u) => {
         const discordIdentity = u.identities?.find((i) => i.provider === 'discord');
-        const twitchIdentity = u.identities?.find((i) => i.provider === 'twitch');
+        const twitchIdentity = u.identities.find((i) => i.provider === 'twitch');
 
         return {

[NoCoverage] ConditionalExpression
services/userService.ts:55:23
         return {
             id: u.id,
             email: u.email,
-            username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
+            username: true,
             role: u.user_metadata?.role || 'user', // Read from metadata
             medals: u.user_metadata?.medals || [], // Start empty if none

[NoCoverage] OptionalChaining
services/userService.ts:55:23
         return {
             id: u.id,
             email: u.email,
-            username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
+            username: u.user_metadata.username || u.user_metadata?.full_name || 'Sin Nick',
             role: u.user_metadata?.role || 'user', // Read from metadata
             medals: u.user_metadata?.medals || [], // Start empty if none

[NoCoverage] ConditionalExpression
services/userService.ts:56:19
             id: u.id,
             email: u.email,
             username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
-            role: u.user_metadata?.role || 'user', // Read from metadata
+            role: false, // Read from metadata
             medals: u.user_metadata?.medals || [], // Start empty if none
             avatar_url: u.user_metadata?.avatar_url,

[NoCoverage] ConditionalExpression
services/userService.ts:56:19
             id: u.id,
             email: u.email,
             username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
-            role: u.user_metadata?.role || 'user', // Read from metadata
+            role: true, // Read from metadata
             medals: u.user_metadata?.medals || [], // Start empty if none
             avatar_url: u.user_metadata?.avatar_url,

[NoCoverage] ConditionalExpression
services/userService.ts:57:21
             email: u.email,
             username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
             role: u.user_metadata?.role || 'user', // Read from metadata
-            medals: u.user_metadata?.medals || [], // Start empty if none
+            medals: false, // Start empty if none
             avatar_url: u.user_metadata?.avatar_url,
             // Connected Accounts

[NoCoverage] OptionalChaining
services/userService.ts:57:21
             email: u.email,
             username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
             role: u.user_metadata?.role || 'user', // Read from metadata
-            medals: u.user_metadata?.medals || [], // Start empty if none
+            medals: u.user_metadata.medals || [], // Start empty if none
             avatar_url: u.user_metadata?.avatar_url,
             // Connected Accounts

[NoCoverage] OptionalChaining
services/userService.ts:58:25
             username: u.user_metadata?.username || u.user_metadata?.full_name || 'Sin Nick',
             role: u.user_metadata?.role || 'user', // Read from metadata
             medals: u.user_metadata?.medals || [], // Start empty if none
-            avatar_url: u.user_metadata?.avatar_url,
+            avatar_url: u.user_metadata.avatar_url,
             // Connected Accounts
             discord: discordIdentity ? {

[NoCoverage] OptionalChaining
services/userService.ts:62:110
             // Connected Accounts
             discord: discordIdentity ? {
                 id: discordIdentity.id,
-                username: discordIdentity.identity_data?.full_name || discordIdentity.identity_data?.name || discordIdentity.identity_data?.custom_claims?.global_name
+                username: discordIdentity.identity_data?.full_name || discordIdentity.identity_data?.name || discordIdentity.identity_data.custom_claims?.global_name
             } : null,
             twitch: twitchIdentity ? {

[NoCoverage] OptionalChaining
services/userService.ts:62:71
             // Connected Accounts
             discord: discordIdentity ? {
                 id: discordIdentity.id,
-                username: discordIdentity.identity_data?.full_name || discordIdentity.identity_data?.name || discordIdentity.identity_data?.custom_claims?.global_name
+                username: discordIdentity.identity_data?.full_name || discordIdentity.identity_data.name || discordIdentity.identity_data?.custom_claims?.global_name
             } : null,
             twitch: twitchIdentity ? {

[NoCoverage] OptionalChaining
services/userService.ts:66:27
             } : null,
             twitch: twitchIdentity ? {
                 id: twitchIdentity.id,
-                username: twitchIdentity.identity_data?.full_name || twitchIdentity.identity_data?.name || twitchIdentity.identity_data?.preferred_username
+                username: twitchIdentity.identity_data.full_name || twitchIdentity.identity_data?.name || twitchIdentity.identity_data?.preferred_username
             } : null,
             created_at: u.created_at,

[NoCoverage] LogicalOperator
services/userService.ts:66:27
             } : null,
             twitch: twitchIdentity ? {
                 id: twitchIdentity.id,
-                username: twitchIdentity.identity_data?.full_name || twitchIdentity.identity_data?.name || twitchIdentity.identity_data?.preferred_username
+                username: twitchIdentity.identity_data?.full_name && twitchIdentity.identity_data?.name || twitchIdentity.identity_data?.preferred_username
             } : null,
             created_at: u.created_at,

[NoCoverage] BlockStatement
services/userService.ts:78:96
  * Update user role
  * We will store the role in user_metadata for simplicity
  */
-export const updateUserRole = async (userId: string, newRole: string): Promise<User | null> => {
-    const { data: { user }, error } = await supabase.auth.admin.updateUserById(
-        userId,
-        { user_metadata: { role: newRole } }
-    );
-
-    if (error) throw error;
-    return user;
-};
+export const updateUserRole = async (userId: string, newRole: string): Promise<User | null> => {};
 
 /**

[NoCoverage] BlockStatement
services/userService.ts:92:118
  * Update any user metadata (e.g. medals)
  * This performs a merge with existing metadata
  */
-export const updateUserMetadata = async (userId: string, metadata: Record<string, unknown>): Promise<User | null> => {
-    const { data: { user }, error } = await supabase.auth.admin.updateUserById(
-        userId,
-        { user_metadata: metadata }
-    );
-
-    if (error) throw error;
-    return user;
-};
+export const updateUserMetadata = async (userId: string, metadata: Record<string, unknown>): Promise<User | null> => {};
 
 /**

[NoCoverage] ObjectLiteral
services/userService.ts:95:9
 export const updateUserMetadata = async (userId: string, metadata: Record<string, unknown>): Promise<User | null> => {
     const { data: { user }, error } = await supabase.auth.admin.updateUserById(
         userId,
-        { user_metadata: metadata }
+        {}
     );
 

[Survived] MethodExpression
services/userService.ts:111:24
     const { data: { users }, error } = await supabase.auth.admin.listUsers();
     if (error) throw error;
 
-    const searchTerm = identifier.toLowerCase().replace(/[-_]/g, ' '); // Map neroferno_ultranix back to Neroferno Ultranix
+    const searchTerm = identifier.toUpperCase().replace(/[-_]/g, ' '); // Map neroferno_ultranix back to Neroferno Ultranix
     const searchTermWithUnderscore = identifier.toLowerCase().replace(/ /g, '_');
     const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');

[Survived] MethodExpression
services/userService.ts:112:38
     if (error) throw error;
 
     const searchTerm = identifier.toLowerCase().replace(/[-_]/g, ' '); // Map neroferno_ultranix back to Neroferno Ultranix
-    const searchTermWithUnderscore = identifier.toLowerCase().replace(/ /g, '_');
+    const searchTermWithUnderscore = identifier.toUpperCase().replace(/ /g, '_');
     const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');
 

[Survived] MethodExpression
services/userService.ts:113:32
 
     const searchTerm = identifier.toLowerCase().replace(/[-_]/g, ' '); // Map neroferno_ultranix back to Neroferno Ultranix
     const searchTermWithUnderscore = identifier.toLowerCase().replace(/ /g, '_');
-    const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');
+    const searchTermWithDash = identifier.toUpperCase().replace(/ /g, '-');
 
     const target = users?.find((u) => {

[Survived] StringLiteral
services/userService.ts:113:71
 
     const searchTerm = identifier.toLowerCase().replace(/[-_]/g, ' '); // Map neroferno_ultranix back to Neroferno Ultranix
     const searchTermWithUnderscore = identifier.toLowerCase().replace(/ /g, '_');
-    const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');
+    const searchTermWithDash = identifier.toLowerCase().replace(/ /g, "");
 
     const target = users?.find((u) => {

[Survived] OptionalChaining
services/userService.ts:115:20
     const searchTermWithUnderscore = identifier.toLowerCase().replace(/ /g, '_');
     const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');
 
-    const target = users?.find((u) => {
+    const target = users.find((u) => {
         const meta = u.user_metadata || {};
         const uUsername = (meta.username || '').toLowerCase();

[Survived] BlockStatement
services/userService.ts:115:39
     const searchTermWithUnderscore = identifier.toLowerCase().replace(/ /g, '_');
     const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');
 
-    const target = users?.find((u) => {
-        const meta = u.user_metadata || {};
-        const uUsername = (meta.username || '').toLowerCase();
-        const uFullName = (meta.full_name || '').toLowerCase();
-        const uMcNick = (meta.minecraft_nick || '').toLowerCase();
-        
-        return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
-               uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
-               uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
-               (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
-    });
+    const target = users?.find((u) => {});
 
     if (!target) return null;

[Survived] ConditionalExpression
services/userService.ts:116:22
     const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');
 
     const target = users?.find((u) => {
-        const meta = u.user_metadata || {};
+        const meta = true;
         const uUsername = (meta.username || '').toLowerCase();
         const uFullName = (meta.full_name || '').toLowerCase();

[Survived] LogicalOperator
services/userService.ts:116:22
     const searchTermWithDash = identifier.toLowerCase().replace(/ /g, '-');
 
     const target = users?.find((u) => {
-        const meta = u.user_metadata || {};
+        const meta = u.user_metadata && {};
         const uUsername = (meta.username || '').toLowerCase();
         const uFullName = (meta.full_name || '').toLowerCase();

[Killed] ConditionalExpression
services/userService.ts:117:28
 
     const target = users?.find((u) => {
         const meta = u.user_metadata || {};
-        const uUsername = (meta.username || '').toLowerCase();
+        const uUsername = (false).toLowerCase();
         const uFullName = (meta.full_name || '').toLowerCase();
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Killed] LogicalOperator
services/userService.ts:117:28
 
     const target = users?.find((u) => {
         const meta = u.user_metadata || {};
-        const uUsername = (meta.username || '').toLowerCase();
+        const uUsername = (meta.username && '').toLowerCase();
         const uFullName = (meta.full_name || '').toLowerCase();
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Killed] ConditionalExpression
services/userService.ts:118:28
     const target = users?.find((u) => {
         const meta = u.user_metadata || {};
         const uUsername = (meta.username || '').toLowerCase();
-        const uFullName = (meta.full_name || '').toLowerCase();
+        const uFullName = (false).toLowerCase();
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
         
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Killed] LogicalOperator
services/userService.ts:118:28
     const target = users?.find((u) => {
         const meta = u.user_metadata || {};
         const uUsername = (meta.username || '').toLowerCase();
-        const uFullName = (meta.full_name || '').toLowerCase();
+        const uFullName = (meta.full_name && '').toLowerCase();
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
         
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Killed] ConditionalExpression
services/userService.ts:119:26
         const meta = u.user_metadata || {};
         const uUsername = (meta.username || '').toLowerCase();
         const uFullName = (meta.full_name || '').toLowerCase();
-        const uMcNick = (meta.minecraft_nick || '').toLowerCase();
+        const uMcNick = (true).toLowerCase();
         
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Killed] ConditionalExpression
services/userService.ts:119:26
         const meta = u.user_metadata || {};
         const uUsername = (meta.username || '').toLowerCase();
         const uFullName = (meta.full_name || '').toLowerCase();
-        const uMcNick = (meta.minecraft_nick || '').toLowerCase();
+        const uMcNick = (false).toLowerCase();
         
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Survived] ConditionalExpression
services/userService.ts:121:86
         const uFullName = (meta.full_name || '').toLowerCase();
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
         
-        return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
+        return uUsername === searchTerm || uUsername === searchTermWithUnderscore || false ||
                uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
                uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||

[Survived] ConditionalExpression
services/userService.ts:121:16
         const uFullName = (meta.full_name || '').toLowerCase();
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
         
-        return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
-               uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
-               uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
-               (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
+        return false;
     });
 

[Survived] EqualityOperator
services/userService.ts:122:16
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
         
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
-               uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
+               uFullName !== searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
                uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
                (meta.minecraft_uuid && meta.minecraft_uuid === identifier);

[Survived] ConditionalExpression
services/userService.ts:122:16
         const uMcNick = (meta.minecraft_nick || '').toLowerCase();
         
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
-               uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
+               false || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
                uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
                (meta.minecraft_uuid && meta.minecraft_uuid === identifier);

[Survived] ConditionalExpression
services/userService.ts:123:42
         
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
                uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
-               uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
+               uMcNick === searchTerm || false || uMcNick === searchTermWithDash ||
                (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
     });

[Survived] EqualityOperator
services/userService.ts:123:82
         
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
                uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
-               uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
+               uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick !== searchTermWithDash ||
                (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
     });

[Survived] ConditionalExpression
services/userService.ts:124:40
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
                uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
                uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
-               (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
+               (meta.minecraft_uuid && true);
     });
 

[Survived] EqualityOperator
services/userService.ts:124:40
         return uUsername === searchTerm || uUsername === searchTermWithUnderscore || uUsername === searchTermWithDash ||
                uFullName === searchTerm || uFullName === searchTermWithUnderscore || uFullName === searchTermWithDash ||
                uMcNick === searchTerm || uMcNick === searchTermWithUnderscore || uMcNick === searchTermWithDash ||
-               (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
+               (meta.minecraft_uuid && meta.minecraft_uuid !== identifier);
     });
 
