[Killed] BooleanLiteral
services/userService.ts:127:9
                (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
     });
 
-    if (!target) return null;
+    if (target) return null;
 
     // Determine displayName for UI
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Killed] ConditionalExpression
services/userService.ts:127:9
                (meta.minecraft_uuid && meta.minecraft_uuid === identifier);
     });
 
-    if (!target) return null;
+    if (false) return null;
 
     // Determine displayName for UI
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[NoCoverage] LogicalOperator
services/userService.ts:130:25
     if (!target) return null;
 
     // Determine displayName for UI
-    const displayName = target.user_metadata?.minecraft_nick || 
-                        target.user_metadata?.username || 
-                        target.user_metadata?.full_name || 
+    const displayName = (target.user_metadata?.minecraft_nick || target.user_metadata?.username) && target.user_metadata?.full_name || 
                         'Usuario';
 

[NoCoverage] LogicalOperator
services/userService.ts:130:25
     if (!target) return null;
 
     // Determine displayName for UI
-    const displayName = target.user_metadata?.minecraft_nick || 
-                        target.user_metadata?.username || 
+    const displayName = target.user_metadata?.minecraft_nick && target.user_metadata?.username || 
                         target.user_metadata?.full_name || 
                         'Usuario';

[NoCoverage] OptionalChaining
services/userService.ts:131:25
 
     // Determine displayName for UI
     const displayName = target.user_metadata?.minecraft_nick || 
-                        target.user_metadata?.username || 
+                        target.user_metadata.username || 
                         target.user_metadata?.full_name || 
                         'Usuario';

[NoCoverage] OptionalChaining
services/userService.ts:132:25
     // Determine displayName for UI
     const displayName = target.user_metadata?.minecraft_nick || 
                         target.user_metadata?.username || 
-                        target.user_metadata?.full_name || 
+                        target.user_metadata.full_name || 
                         'Usuario';
 

[NoCoverage] OptionalChaining
services/userService.ts:138:25
     return {
         id: target.id,
         username: displayName,
-        minecraft_nick: target.user_metadata?.minecraft_nick,
+        minecraft_nick: target.user_metadata.minecraft_nick,
         original_username: target.user_metadata?.username,
         full_name: target.user_metadata?.full_name,

[NoCoverage] OptionalChaining
services/userService.ts:139:28
         id: target.id,
         username: displayName,
         minecraft_nick: target.user_metadata?.minecraft_nick,
-        original_username: target.user_metadata?.username,
+        original_username: target.user_metadata.username,
         full_name: target.user_metadata?.full_name,
         role: target.user_metadata?.role || 'user',

[NoCoverage] OptionalChaining
services/userService.ts:140:20
         username: displayName,
         minecraft_nick: target.user_metadata?.minecraft_nick,
         original_username: target.user_metadata?.username,
-        full_name: target.user_metadata?.full_name,
+        full_name: target.user_metadata.full_name,
         role: target.user_metadata?.role || 'user',
         medals: target.user_metadata?.medals || [],

[NoCoverage] OptionalChaining
services/userService.ts:141:15
         minecraft_nick: target.user_metadata?.minecraft_nick,
         original_username: target.user_metadata?.username,
         full_name: target.user_metadata?.full_name,
-        role: target.user_metadata?.role || 'user',
+        role: target.user_metadata.role || 'user',
         medals: target.user_metadata?.medals || [],
         avatar_url: target.user_metadata?.avatar_url,

[NoCoverage] ConditionalExpression
services/userService.ts:141:15
         minecraft_nick: target.user_metadata?.minecraft_nick,
         original_username: target.user_metadata?.username,
         full_name: target.user_metadata?.full_name,
-        role: target.user_metadata?.role || 'user',
+        role: false,
         medals: target.user_metadata?.medals || [],
         avatar_url: target.user_metadata?.avatar_url,

[NoCoverage] ConditionalExpression
services/userService.ts:142:17
         original_username: target.user_metadata?.username,
         full_name: target.user_metadata?.full_name,
         role: target.user_metadata?.role || 'user',
-        medals: target.user_metadata?.medals || [],
+        medals: false,
         avatar_url: target.user_metadata?.avatar_url,
         profile_banner_url: target.user_metadata?.profile_banner_url,

[NoCoverage] OptionalChaining
services/userService.ts:142:17
         original_username: target.user_metadata?.username,
         full_name: target.user_metadata?.full_name,
         role: target.user_metadata?.role || 'user',
-        medals: target.user_metadata?.medals || [],
+        medals: target.user_metadata.medals || [],
         avatar_url: target.user_metadata?.avatar_url,
         profile_banner_url: target.user_metadata?.profile_banner_url,

[NoCoverage] OptionalChaining
services/userService.ts:143:21
         full_name: target.user_metadata?.full_name,
         role: target.user_metadata?.role || 'user',
         medals: target.user_metadata?.medals || [],
-        avatar_url: target.user_metadata?.avatar_url,
+        avatar_url: target.user_metadata.avatar_url,
         profile_banner_url: target.user_metadata?.profile_banner_url,
         created_at: target.created_at,

[NoCoverage] OptionalChaining
services/userService.ts:144:29
         role: target.user_metadata?.role || 'user',
         medals: target.user_metadata?.medals || [],
         avatar_url: target.user_metadata?.avatar_url,
-        profile_banner_url: target.user_metadata?.profile_banner_url,
+        profile_banner_url: target.user_metadata.profile_banner_url,
         created_at: target.created_at,
         public_stats: target.user_metadata?.public_stats || false,

[NoCoverage] ConditionalExpression
services/userService.ts:146:23
         avatar_url: target.user_metadata?.avatar_url,
         profile_banner_url: target.user_metadata?.profile_banner_url,
         created_at: target.created_at,
-        public_stats: target.user_metadata?.public_stats || false,
+        public_stats: true,
         bio: target.user_metadata?.bio,
         reputation: target.user_metadata?.reputation || 0,

[NoCoverage] ConditionalExpression
services/userService.ts:146:23
         avatar_url: target.user_metadata?.avatar_url,
         profile_banner_url: target.user_metadata?.profile_banner_url,
         created_at: target.created_at,
-        public_stats: target.user_metadata?.public_stats || false,
+        public_stats: false,
         bio: target.user_metadata?.bio,
         reputation: target.user_metadata?.reputation || 0,

[NoCoverage] OptionalChaining
services/userService.ts:147:14
         profile_banner_url: target.user_metadata?.profile_banner_url,
         created_at: target.created_at,
         public_stats: target.user_metadata?.public_stats || false,
-        bio: target.user_metadata?.bio,
+        bio: target.user_metadata.bio,
         reputation: target.user_metadata?.reputation || 0,
         social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,

[NoCoverage] LogicalOperator
services/userService.ts:148:21
         created_at: target.created_at,
         public_stats: target.user_metadata?.public_stats || false,
         bio: target.user_metadata?.bio,
-        reputation: target.user_metadata?.reputation || 0,
+        reputation: target.user_metadata?.reputation && 0,
         social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,
         social_twitter: target.user_metadata?.social_twitter,

[NoCoverage] ConditionalExpression
services/userService.ts:148:21
         created_at: target.created_at,
         public_stats: target.user_metadata?.public_stats || false,
         bio: target.user_metadata?.bio,
-        reputation: target.user_metadata?.reputation || 0,
+        reputation: false,
         social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,
         social_twitter: target.user_metadata?.social_twitter,

[NoCoverage] OptionalChaining
services/userService.ts:149:65
         public_stats: target.user_metadata?.public_stats || false,
         bio: target.user_metadata?.bio,
         reputation: target.user_metadata?.reputation || 0,
-        social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,
+        social_discord: target.user_metadata?.social_discord || target.user_metadata.discord,
         social_twitter: target.user_metadata?.social_twitter,
         social_twitch: target.user_metadata?.social_twitch,

[NoCoverage] OptionalChaining
services/userService.ts:149:25
         public_stats: target.user_metadata?.public_stats || false,
         bio: target.user_metadata?.bio,
         reputation: target.user_metadata?.reputation || 0,
-        social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,
+        social_discord: target.user_metadata.social_discord || target.user_metadata?.discord,
         social_twitter: target.user_metadata?.social_twitter,
         social_twitch: target.user_metadata?.social_twitch,

[NoCoverage] OptionalChaining
services/userService.ts:150:25
         bio: target.user_metadata?.bio,
         reputation: target.user_metadata?.reputation || 0,
         social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,
-        social_twitter: target.user_metadata?.social_twitter,
+        social_twitter: target.user_metadata.social_twitter,
         social_twitch: target.user_metadata?.social_twitch,
         social_youtube: target.user_metadata?.social_youtube,

[NoCoverage] OptionalChaining
services/userService.ts:151:24
         reputation: target.user_metadata?.reputation || 0,
         social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,
         social_twitter: target.user_metadata?.social_twitter,
-        social_twitch: target.user_metadata?.social_twitch,
+        social_twitch: target.user_metadata.social_twitch,
         social_youtube: target.user_metadata?.social_youtube,
         minecraft_uuid: target.user_metadata?.minecraft_uuid,

[NoCoverage] OptionalChaining
services/userService.ts:152:25
         social_discord: target.user_metadata?.social_discord || target.user_metadata?.discord,
         social_twitter: target.user_metadata?.social_twitter,
         social_twitch: target.user_metadata?.social_twitch,
-        social_youtube: target.user_metadata?.social_youtube,
+        social_youtube: target.user_metadata.social_youtube,
         minecraft_uuid: target.user_metadata?.minecraft_uuid,
         social_avatar_url: target.user_metadata?.picture || target.user_metadata?.avatar_url,

[NoCoverage] OptionalChaining
services/userService.ts:153:25
         social_twitter: target.user_metadata?.social_twitter,
         social_twitch: target.user_metadata?.social_twitch,
         social_youtube: target.user_metadata?.social_youtube,
-        minecraft_uuid: target.user_metadata?.minecraft_uuid,
+        minecraft_uuid: target.user_metadata.minecraft_uuid,
         social_avatar_url: target.user_metadata?.picture || target.user_metadata?.avatar_url,
         avatar_preference: target.user_metadata?.avatar_preference || 'minecraft'

[NoCoverage] ConditionalExpression
services/userService.ts:154:28
         social_twitch: target.user_metadata?.social_twitch,
         social_youtube: target.user_metadata?.social_youtube,
         minecraft_uuid: target.user_metadata?.minecraft_uuid,
-        social_avatar_url: target.user_metadata?.picture || target.user_metadata?.avatar_url,
+        social_avatar_url: false,
         avatar_preference: target.user_metadata?.avatar_preference || 'minecraft'
     };

[NoCoverage] LogicalOperator
services/userService.ts:154:28
         social_twitch: target.user_metadata?.social_twitch,
         social_youtube: target.user_metadata?.social_youtube,
         minecraft_uuid: target.user_metadata?.minecraft_uuid,
-        social_avatar_url: target.user_metadata?.picture || target.user_metadata?.avatar_url,
+        social_avatar_url: target.user_metadata?.picture && target.user_metadata?.avatar_url,
         avatar_preference: target.user_metadata?.avatar_preference || 'minecraft'
     };

[NoCoverage] ConditionalExpression
services/userService.ts:155:28
         social_youtube: target.user_metadata?.social_youtube,
         minecraft_uuid: target.user_metadata?.minecraft_uuid,
         social_avatar_url: target.user_metadata?.picture || target.user_metadata?.avatar_url,
-        avatar_preference: target.user_metadata?.avatar_preference || 'minecraft'
+        avatar_preference: false
     };
 };

[NoCoverage] ConditionalExpression
services/userService.ts:155:28
         social_youtube: target.user_metadata?.social_youtube,
         minecraft_uuid: target.user_metadata?.minecraft_uuid,
         social_avatar_url: target.user_metadata?.picture || target.user_metadata?.avatar_url,
-        avatar_preference: target.user_metadata?.avatar_preference || 'minecraft'
+        avatar_preference: true
     };
 };

[NoCoverage] ConditionalExpression
services/userService.ts:170:9
  */
 export const giveKarma = async (userId: string, voterId: string): Promise<number> => {
     const { data: { user }, error: fetchError } = await supabase.auth.admin.getUserById(userId);
-    if (fetchError || !user) throw new Error('User not found');
+    if (true) throw new Error('User not found');
 
     const { error: insertError } = await supabase

[NoCoverage] BooleanLiteral
services/userService.ts:170:23
  */
 export const giveKarma = async (userId: string, voterId: string): Promise<number> => {
     const { data: { user }, error: fetchError } = await supabase.auth.admin.getUserById(userId);
-    if (fetchError || !user) throw new Error('User not found');
+    if (fetchError || user) throw new Error('User not found');
 
     const { error: insertError } = await supabase

[NoCoverage] ObjectLiteral
services/userService.ts:174:17
 
     const { error: insertError } = await supabase
         .from('karma_votes')
-        .insert({ user_id: userId, voter_id: voterId });
+        .insert({});
 
     if (insertError) {

[NoCoverage] BlockStatement
services/userService.ts:176:22
         .from('karma_votes')
         .insert({ user_id: userId, voter_id: voterId });
 
-    if (insertError) {
-        // Unique violation -> this voter already voted for this user
-        if (insertError.code === '23505') {
-            throw new Error('Ya le has dado karma a este usuario');
-        }
-        throw insertError;
-    }
+    if (insertError) {}
 
     const { count, error: countError } = await supabase

[NoCoverage] ConditionalExpression
services/userService.ts:176:9
         .from('karma_votes')
         .insert({ user_id: userId, voter_id: voterId });
 
-    if (insertError) {
+    if (false) {
         // Unique violation -> this voter already voted for this user
         if (insertError.code === '23505') {

[NoCoverage] BlockStatement
services/userService.ts:178:43
 
     if (insertError) {
         // Unique violation -> this voter already voted for this user
-        if (insertError.code === '23505') {
-            throw new Error('Ya le has dado karma a este usuario');
-        }
+        if (insertError.code === '23505') {}
         throw insertError;
     }

[NoCoverage] ConditionalExpression
services/userService.ts:178:13
 
     if (insertError) {
         // Unique violation -> this voter already voted for this user
-        if (insertError.code === '23505') {
+        if (true) {
             throw new Error('Ya le has dado karma a este usuario');
         }

[NoCoverage] StringLiteral
services/userService.ts:179:29
     if (insertError) {
         // Unique violation -> this voter already voted for this user
         if (insertError.code === '23505') {
-            throw new Error('Ya le has dado karma a este usuario');
+            throw new Error("");
         }
         throw insertError;

[NoCoverage] BooleanLiteral
services/userService.ts:186:46
 
     const { count, error: countError } = await supabase
         .from('karma_votes')
-        .select('*', { count: 'exact', head: true })
+        .select('*', { count: 'exact', head: false })
         .eq('user_id', userId);
 

[NoCoverage] ObjectLiteral
services/userService.ts:186:22
 
     const { count, error: countError } = await supabase
         .from('karma_votes')
-        .select('*', { count: 'exact', head: true })
+        .select('*', {})
         .eq('user_id', userId);
 

[NoCoverage] ConditionalExpression
services/userService.ts:189:9
         .select('*', { count: 'exact', head: true })
         .eq('user_id', userId);
 
-    if (countError) throw countError;
+    if (true) throw countError;
 
     const newReputation = count ?? 1;

[NoCoverage] ConditionalExpression
services/userService.ts:189:9
         .select('*', { count: 'exact', head: true })
         .eq('user_id', userId);
 
-    if (countError) throw countError;
+    if (false) throw countError;
 
     const newReputation = count ?? 1;

[NoCoverage] LogicalOperator
services/userService.ts:191:27
 
     if (countError) throw countError;
 
-    const newReputation = count ?? 1;
+    const newReputation = count && 1;
 
     // Best-effort cache sync for profile read paths (non-critical if it lags)

[NoCoverage] ConditionalExpression
services/userService.ts:194:33
     const newReputation = count ?? 1;
 
     // Best-effort cache sync for profile read paths (non-critical if it lags)
-    const cleanMetadata = { ...(user.user_metadata || {}) };
+    const cleanMetadata = { ...(true) };
     delete cleanMetadata.voters; // drop legacy unbounded array
     await supabase.auth.admin.updateUserById(

[NoCoverage] LogicalOperator
services/userService.ts:194:33
     const newReputation = count ?? 1;
 
     // Best-effort cache sync for profile read paths (non-critical if it lags)
-    const cleanMetadata = { ...(user.user_metadata || {}) };
+    const cleanMetadata = { ...(user.user_metadata && {}) };
     delete cleanMetadata.voters; // drop legacy unbounded array
     await supabase.auth.admin.updateUserById(
