[NoCoverage] ObjectLiteral
services/websocketService.ts:8:31
 const clients = new Set<WebSocket>();
 
 export const initWebSocket = (server: Server) => {
-    wss = new WebSocketServer({ server });
+    wss = new WebSocketServer({});
 
     wss.on('connection', (ws: WebSocket, req) => {

[NoCoverage] BlockStatement
services/websocketService.ts:19:39
 
         clients.add(ws);
 
-        ws.on('message', (message) => {
-            try {
-                const msgString = message.toString();
-                console.log(`[WebSocket] Received: ${msgString}`);
-                // Handle Heartbeat or other messages from Plugin
-                if (msgString === 'ping') {
-                    ws.send('pong');
-                }
-            } catch (error) {
-                console.error('[WebSocket] Error parsing message:', error);
-            }
-        });
+        ws.on('message', (message) => {});
 
         ws.on('close', () => {

[NoCoverage] BlockStatement
services/websocketService.ts:20:17
         clients.add(ws);
 
         ws.on('message', (message) => {
-            try {
-                const msgString = message.toString();
-                console.log(`[WebSocket] Received: ${msgString}`);
-                // Handle Heartbeat or other messages from Plugin
-                if (msgString === 'ping') {
-                    ws.send('pong');
-                }
-            } catch (error) {
+            try {} catch (error) {
                 console.error('[WebSocket] Error parsing message:', error);
             }

[NoCoverage] EqualityOperator
services/websocketService.ts:24:21
                 const msgString = message.toString();
                 console.log(`[WebSocket] Received: ${msgString}`);
                 // Handle Heartbeat or other messages from Plugin
-                if (msgString === 'ping') {
+                if (msgString !== 'ping') {
                     ws.send('pong');
                 }

[NoCoverage] ConditionalExpression
services/websocketService.ts:24:21
                 const msgString = message.toString();
                 console.log(`[WebSocket] Received: ${msgString}`);
                 // Handle Heartbeat or other messages from Plugin
-                if (msgString === 'ping') {
+                if (false) {
                     ws.send('pong');
                 }

[NoCoverage] BlockStatement
services/websocketService.ts:27:29
                 if (msgString === 'ping') {
                     ws.send('pong');
                 }
-            } catch (error) {
-                console.error('[WebSocket] Error parsing message:', error);
-            }
+            } catch (error) {}
         });
 

[NoCoverage] StringLiteral
services/websocketService.ts:28:31
                     ws.send('pong');
                 }
             } catch (error) {
-                console.error('[WebSocket] Error parsing message:', error);
+                console.error("", error);
             }
         });

[NoCoverage] BlockStatement
services/websocketService.ts:32:30
             }
         });
 
-        ws.on('close', () => {
-            console.log(`[WebSocket] Client disconnected (${ip})`);
-            clients.delete(ws);
-        });
+        ws.on('close', () => {});
 
         ws.on('error', (error) => {

[NoCoverage] BlockStatement
services/websocketService.ts:37:35
             clients.delete(ws);
         });
 
-        ws.on('error', (error) => {
-            console.error(`[WebSocket] Error: ${error.message}`);
-        });
+        ws.on('error', (error) => {});
     });
 

[NoCoverage] StringLiteral
services/websocketService.ts:38:27
         });
 
         ws.on('error', (error) => {
-            console.error(`[WebSocket] Error: ${error.message}`);
+            console.error(``);
         });
     });

[NoCoverage] BlockStatement
services/websocketService.ts:45:38
     console.log('[WebSocket] Server initialized');
 };
 
-const broadcast = (data: unknown) => {
-    if (!wss) return;
-    const message = JSON.stringify(data);
-    clients.forEach(client => {
-        if (client.readyState === WebSocket.OPEN) {
-            client.send(message);
-        }
-    });
-};
+const broadcast = (data: unknown) => {};
 
 export const sendToAll = (command: string) => {

[NoCoverage] ConditionalExpression
services/websocketService.ts:46:9
 };
 
 const broadcast = (data: unknown) => {
-    if (!wss) return;
+    if (false) return;
     const message = JSON.stringify(data);
     clients.forEach(client => {

[NoCoverage] BooleanLiteral
services/websocketService.ts:46:9
 };
 
 const broadcast = (data: unknown) => {
-    if (!wss) return;
+    if (wss) return;
     const message = JSON.stringify(data);
     clients.forEach(client => {

[NoCoverage] BlockStatement
services/websocketService.ts:48:31
 const broadcast = (data: unknown) => {
     if (!wss) return;
     const message = JSON.stringify(data);
-    clients.forEach(client => {
-        if (client.readyState === WebSocket.OPEN) {
-            client.send(message);
-        }
-    });
+    clients.forEach(client => {});
 };
 

[NoCoverage] BlockStatement
services/websocketService.ts:49:51
     if (!wss) return;
     const message = JSON.stringify(data);
     clients.forEach(client => {
-        if (client.readyState === WebSocket.OPEN) {
-            client.send(message);
-        }
+        if (client.readyState === WebSocket.OPEN) {}
     });
 };

[NoCoverage] EqualityOperator
services/websocketService.ts:49:13
     if (!wss) return;
     const message = JSON.stringify(data);
     clients.forEach(client => {
-        if (client.readyState === WebSocket.OPEN) {
+        if (client.readyState !== WebSocket.OPEN) {
             client.send(message);
         }

[NoCoverage] BlockStatement
services/websocketService.ts:55:47
     });
 };
 
-export const sendToAll = (command: string) => {
-     broadcast({ type: 'EXECUTE_COMMAND', command });
-};
+export const sendToAll = (command: string) => {};
 

[NoCoverage] StringLiteral
services/websocketService.ts:56:24
 };
 
 export const sendToAll = (command: string) => {
-     broadcast({ type: 'EXECUTE_COMMAND', command });
+     broadcast({ type: "", command });
 };
 
