[Killed] BlockStatement
utils/responseHandler.ts:19:108
     };
 }
 
-export const sendSuccess = <T>(res: Response, data: T, message?: string, meta?: ApiResponse<T>['meta']) => {
-    return res.status(200).json({
-        success: true,
-        message,
-        data,
-        meta
-    });
-};
+export const sendSuccess = <T>(res: Response, data: T, message?: string, meta?: ApiResponse<T>['meta']) => {};
 
 export const sendError = (res: Response, message: string, code: string = 'INTERNAL_ERROR', statusCode: number = 500, details?: unknown) => {
killedBy: Public Registration Endpoint (/api/auth/register) should silent-drop honeypot bot submissions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
utils/responseHandler.ts:28:140
     });
 };
 
-export const sendError = (res: Response, message: string, code: string = 'INTERNAL_ERROR', statusCode: number = 500, details?: unknown) => {
-    // Sanitize details to avoid circular references and leak info
-    let safeDetails = process.env.NODE_ENV === 'development' ? details : undefined;
-    const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode >= 500 ? 'Internal server error' : message);
-
-    if (details instanceof Error && process.env.NODE_ENV === 'development') {
-        safeDetails = {
-            message: details.message,
-            stack: details.stack
-        };
-    }
-
-
-    return res.status(statusCode).json({
-        success: false,
-        error: {
-            code,
-            message: safeMessage,
-            details: safeDetails
-        }
-    });
-};
+export const sendError = (res: Response, message: string, code: string = 'INTERNAL_ERROR', statusCode: number = 500, details?: unknown) => {};
 
killedBy: 🛡️ Stealth Honeypot & Security Engine should pass form honeypot check when confirm_email is empty on POST /api/auth/register
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ConditionalExpression
utils/responseHandler.ts:30:23
 
 export const sendError = (res: Response, message: string, code: string = 'INTERNAL_ERROR', statusCode: number = 500, details?: unknown) => {
     // Sanitize details to avoid circular references and leak info
-    let safeDetails = process.env.NODE_ENV === 'development' ? details : undefined;
+    let safeDetails = true ? details : undefined;
     const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode >= 500 ? 'Internal server error' : message);
 

[Survived] EqualityOperator
utils/responseHandler.ts:30:23
 
 export const sendError = (res: Response, message: string, code: string = 'INTERNAL_ERROR', statusCode: number = 500, details?: unknown) => {
     // Sanitize details to avoid circular references and leak info
-    let safeDetails = process.env.NODE_ENV === 'development' ? details : undefined;
+    let safeDetails = process.env.NODE_ENV !== 'development' ? details : undefined;
     const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode >= 500 ? 'Internal server error' : message);
 

[Survived] ConditionalExpression
utils/responseHandler.ts:31:77
 export const sendError = (res: Response, message: string, code: string = 'INTERNAL_ERROR', statusCode: number = 500, details?: unknown) => {
     // Sanitize details to avoid circular references and leak info
     let safeDetails = process.env.NODE_ENV === 'development' ? details : undefined;
-    const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode >= 500 ? 'Internal server error' : message);
+    const safeMessage = process.env.NODE_ENV === 'development' ? message : (false ? 'Internal server error' : message);
 
     if (details instanceof Error && process.env.NODE_ENV === 'development') {

[Survived] EqualityOperator
utils/responseHandler.ts:31:77
 export const sendError = (res: Response, message: string, code: string = 'INTERNAL_ERROR', statusCode: number = 500, details?: unknown) => {
     // Sanitize details to avoid circular references and leak info
     let safeDetails = process.env.NODE_ENV === 'development' ? details : undefined;
-    const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode >= 500 ? 'Internal server error' : message);
+    const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode < 500 ? 'Internal server error' : message);
 
     if (details instanceof Error && process.env.NODE_ENV === 'development') {

[Killed] ConditionalExpression
utils/responseHandler.ts:33:9
     let safeDetails = process.env.NODE_ENV === 'development' ? details : undefined;
     const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode >= 500 ? 'Internal server error' : message);
 
-    if (details instanceof Error && process.env.NODE_ENV === 'development') {
+    if (true) {
         safeDetails = {
             message: details.message,
killedBy: A01 — Broken Access Control F-01 · Gacha add-funds must require admin should reject unauthenticated requests (401)
statusReason: expected 500 to be 401 // Object.is equality

[NoCoverage] BlockStatement
utils/responseHandler.ts:33:77
     let safeDetails = process.env.NODE_ENV === 'development' ? details : undefined;
     const safeMessage = process.env.NODE_ENV === 'development' ? message : (statusCode >= 500 ? 'Internal server error' : message);
 
-    if (details instanceof Error && process.env.NODE_ENV === 'development') {
-        safeDetails = {
-            message: details.message,
-            stack: details.stack
-        };
-    }
+    if (details instanceof Error && process.env.NODE_ENV === 'development') {}
 
 

[Survived] BooleanLiteral
utils/responseHandler.ts:42:18
 
 
     return res.status(statusCode).json({
-        success: false,
+        success: true,
         error: {
             code,
