[Killed] BlockStatement
utils/typeUtils.ts:5:75
  * utility to safely extract a single string from Express 5's req.query or req.params
  * which can now be string | string[] | undefined | ParsedQs
  */
-export function ensureString(val: unknown, fallback: string = ''): string {
-    if (typeof val === 'string') return val;
-    if (Array.isArray(val) && val.length > 0) return String(val[0]);
-    if (val === undefined || val === null) return fallback;
-    return String(val);
-}
+export function ensureString(val: unknown, fallback: string = ''): string {}
 
killedBy: A01 — Broken Access Control F-03 · Full profile public exposure should require auth to view full profile with wallet (currently public)
statusReason: expected [ 200, 401, 404 ] to include 500

[Survived] ConditionalExpression
utils/typeUtils.ts:6:9
  * which can now be string | string[] | undefined | ParsedQs
  */
 export function ensureString(val: unknown, fallback: string = ''): string {
-    if (typeof val === 'string') return val;
+    if (false) return val;
     if (Array.isArray(val) && val.length > 0) return String(val[0]);
     if (val === undefined || val === null) return fallback;

[Survived] EqualityOperator
utils/typeUtils.ts:6:9
  * which can now be string | string[] | undefined | ParsedQs
  */
 export function ensureString(val: unknown, fallback: string = ''): string {
-    if (typeof val === 'string') return val;
+    if (typeof val !== 'string') return val;
     if (Array.isArray(val) && val.length > 0) return String(val[0]);
     if (val === undefined || val === null) return fallback;

[NoCoverage] EqualityOperator
utils/typeUtils.ts:7:31
  */
 export function ensureString(val: unknown, fallback: string = ''): string {
     if (typeof val === 'string') return val;
-    if (Array.isArray(val) && val.length > 0) return String(val[0]);
+    if (Array.isArray(val) && val.length <= 0) return String(val[0]);
     if (val === undefined || val === null) return fallback;
     return String(val);

[NoCoverage] ConditionalExpression
utils/typeUtils.ts:7:9
  */
 export function ensureString(val: unknown, fallback: string = ''): string {
     if (typeof val === 'string') return val;
-    if (Array.isArray(val) && val.length > 0) return String(val[0]);
+    if (false) return String(val[0]);
     if (val === undefined || val === null) return fallback;
     return String(val);

[NoCoverage] ConditionalExpression
utils/typeUtils.ts:8:9
 export function ensureString(val: unknown, fallback: string = ''): string {
     if (typeof val === 'string') return val;
     if (Array.isArray(val) && val.length > 0) return String(val[0]);
-    if (val === undefined || val === null) return fallback;
+    if (true) return fallback;
     return String(val);
 }

[NoCoverage] EqualityOperator
utils/typeUtils.ts:8:30
 export function ensureString(val: unknown, fallback: string = ''): string {
     if (typeof val === 'string') return val;
     if (Array.isArray(val) && val.length > 0) return String(val[0]);
-    if (val === undefined || val === null) return fallback;
+    if (val === undefined || val !== null) return fallback;
     return String(val);
 }
