[Timeout] StringLiteral
routes/discordRoutes.ts:13:12
 router.post('/link', authenticateToken, validate(linkDiscordSchema), linkAccount);
 
 // GET /api/discord/announcements (Public endpoint for live Discord announcements)
-router.get('/announcements', getDiscordAnnouncements);
+router.get("", getDiscordAnnouncements);
 
 export default router;
