[Timeout] StringLiteral
routes/donationRoutes.ts:61:12
  *     security:
  *       - bearerAuth: []
  */
-router.get('/', authenticateToken, checkRole(STAFF_ROLES), getDonations);
+router.get("", authenticateToken, checkRole(STAFF_ROLES), getDonations);
 
 /**

[Timeout] StringLiteral
routes/donationRoutes.ts:94:12
  *     security:
  *       - bearerAuth: []
  */
-router.put('/:id', authenticateToken, checkRole(STAFF_ROLES), validate(updateDonationSchema), updateDonation);
+router.put("", authenticateToken, checkRole(STAFF_ROLES), validate(updateDonationSchema), updateDonation);
 
 /**

[Timeout] StringLiteral
routes/donationRoutes.ts:105:15
  *     security:
  *       - bearerAuth: []
  */
-router.delete('/:id', authenticateToken, checkRole(ADMIN_ROLES), deleteDonation);
+router.delete("", authenticateToken, checkRole(ADMIN_ROLES), deleteDonation);
 
 export default router;
