[Timeout] StringLiteral
routes/eventRoutes.ts:51:12
  *       200:
  *         description: Lista de eventos
  */
-router.get('/', eventController.getAllEvents);
+router.get("", eventController.getAllEvents);
 
 /**

[Timeout] StringLiteral
routes/eventRoutes.ts:106:15
  *     security:
  *       - bearerAuth: []
  */
-router.delete('/:id', authenticateToken, checkRole(ADMIN_ROLES), eventController.deleteEvent);
+router.delete("", authenticateToken, checkRole(ADMIN_ROLES), eventController.deleteEvent);
 
 /**
