[Timeout] StringLiteral
routes/forumRoutes.ts:12:12
 router.get('/stats', forumController.getStats);
 router.get('/category/:categoryId', forumController.getThreads);
 router.get('/user/:userId/threads', forumController.getUserThreads);
-router.get('/thread/:id', forumController.getThread);
+router.get("", forumController.getThread);
 router.get('/thread/:id/full', forumController.getThreadFull); // Aggregated
 router.get('/thread/:id/posts', forumController.getPosts);

[Timeout] StringLiteral
routes/forumRoutes.ts:13:12
 router.get('/category/:categoryId', forumController.getThreads);
 router.get('/user/:userId/threads', forumController.getUserThreads);
 router.get('/thread/:id', forumController.getThread);
-router.get('/thread/:id/full', forumController.getThreadFull); // Aggregated
+router.get("", forumController.getThreadFull); // Aggregated
 router.get('/thread/:id/posts', forumController.getPosts);
 

[Timeout] StringLiteral
routes/forumRoutes.ts:22:15
 router.post('/threads', validate(createThreadSchema), forumController.createThread);
 router.post('/thread/:id/posts', validate(createPostSchema), forumController.createPost);
 router.put('/thread/:id', validate(updateThreadSchema), forumController.updateThread);
-router.delete('/thread/:id', forumController.deleteThread);
+router.delete("", forumController.deleteThread);
 router.put('/posts/:id', validate(updatePostSchema), forumController.updatePost);
 router.delete('/posts/:id', forumController.deletePost);

[Timeout] StringLiteral
routes/forumRoutes.ts:23:12
 router.post('/thread/:id/posts', validate(createPostSchema), forumController.createPost);
 router.put('/thread/:id', validate(updateThreadSchema), forumController.updateThread);
 router.delete('/thread/:id', forumController.deleteThread);
-router.put('/posts/:id', validate(updatePostSchema), forumController.updatePost);
+router.put("", validate(updatePostSchema), forumController.updatePost);
 router.delete('/posts/:id', forumController.deletePost);
 
