[Timeout] StringLiteral
routes/gachaRoutes.ts:10:12
 
 const router = express.Router();
 
-router.get('/tiers', gachaController.getTiers);
+router.get("", gachaController.getTiers);
 
 router.post('/roll', authenticateToken, validate(rollGachaSchema), gachaController.roll);

[Timeout] StringLiteral
routes/gachaRoutes.ts:18:12
 
 router.get('/history/:userId', authenticateToken, validate(gachaHistorySchema), gachaController.getHistory);
 
-router.get('/status/:userId', authenticateToken, validate(gachaStatusSchema), gachaController.getStatus);
+router.get("", authenticateToken, validate(gachaStatusSchema), gachaController.getStatus);
 
 export default router;
