[Timeout] StringLiteral
routes/locationRoutes.ts:15:12
 
 // Admin routes
 router.post('/', authenticateToken, checkRole(STAFF_ROLES), validate(createLocationSchema), locationController.createLocation);
-router.put('/:id', authenticateToken, checkRole(STAFF_ROLES), validate(updateLocationSchema), locationController.updateLocation);
+router.put("", authenticateToken, checkRole(STAFF_ROLES), validate(updateLocationSchema), locationController.updateLocation);
 router.delete('/:id', authenticateToken, checkRole(STAFF_ROLES), locationController.deleteLocation);
 

[Timeout] StringLiteral
routes/locationRoutes.ts:16:15
 // Admin routes
 router.post('/', authenticateToken, checkRole(STAFF_ROLES), validate(createLocationSchema), locationController.createLocation);
 router.put('/:id', authenticateToken, checkRole(STAFF_ROLES), validate(updateLocationSchema), locationController.updateLocation);
-router.delete('/:id', authenticateToken, checkRole(STAFF_ROLES), locationController.deleteLocation);
+router.delete("", authenticateToken, checkRole(STAFF_ROLES), locationController.deleteLocation);
 
 export default router;
