[Timeout] StringLiteral
routes/minecraftRoutes.ts:11:12
 
 // GET /api/minecraft/status
 router.get('/status', minecraftController.getStatus);
-router.get('/skin/:username', validate(getSkinSchema), minecraftController.getSkin);
+router.get("", validate(getSkinSchema), minecraftController.getSkin);
 
 // Minecraft Account Linking (Requires authentication)

[Timeout] StringLiteral
routes/minecraftRoutes.ts:21:13
 router.post('/link/unlink-discord', authenticateToken, minecraftController.unlinkDiscord);
 
 // Microsoft OAuth proxy routes for Web Client
-router.post('/link/ms-device-code', authenticateToken, minecraftController.requestMsDeviceCode);
+router.post("", authenticateToken, minecraftController.requestMsDeviceCode);
 router.post('/link/ms-poll', authenticateToken, minecraftController.pollMsDeviceToken);
 router.post('/link/ms-callback', authenticateToken, minecraftController.exchangeMsAuthCode);

[Timeout] StringLiteral
routes/minecraftRoutes.ts:22:13
 
 // Microsoft OAuth proxy routes for Web Client
 router.post('/link/ms-device-code', authenticateToken, minecraftController.requestMsDeviceCode);
-router.post('/link/ms-poll', authenticateToken, minecraftController.pollMsDeviceToken);
+router.post("", authenticateToken, minecraftController.pollMsDeviceToken);
 router.post('/link/ms-callback', authenticateToken, minecraftController.exchangeMsAuthCode);
 
