[Timeout] StringLiteral
routes/policyRoutes.ts:13:12
 
 // Get settings: uses optional auth to decide if we show full list or public whitelist
 router.get('/', policyController.getPolicies);
-router.get('/:slug', policyController.getPolicy);
+router.get("", policyController.getPolicy);
 
 // Admin routes

[Timeout] StringLiteral
routes/policyRoutes.ts:16:12
 router.get('/:slug', policyController.getPolicy);
 
 // Admin routes
-router.put('/:slug', 
+router.put("", 
     authenticateToken, 
     checkRole(ADMIN_ROLES), 
