[Timeout] StringLiteral
routes/pollRoutes.ts:66:12
  *       200:
  *         description: Encuesta activa
  */
-router.get('/active', pollController.getActivePoll);
+router.get("", pollController.getActivePoll);
 
 /**

[Timeout] StringLiteral
routes/pollRoutes.ts:89:13
  *       200:
  *         description: Voto registrado
  */
-router.post('/vote', authenticateToken, validate(votePollSchema), pollController.vote);
+router.post("", authenticateToken, validate(votePollSchema), pollController.vote);
 
 /**

[Timeout] StringLiteral
routes/pollRoutes.ts:133:15
  *     security:
  *       - bearerAuth: []
  */
-router.delete('/:id', authenticateToken, checkRole(ADMIN_ROLES), pollController.deletePoll);
+router.delete("", authenticateToken, checkRole(ADMIN_ROLES), pollController.deletePoll);
 
 export default router;
