[Timeout] StringLiteral
routes/profileCommentRoutes.ts:13:13
 router.get('/:profileId', validate(getCommentsSchema), commentController.getComments);
 
 // Protected: Post a comment
-router.post('/:profileId', authenticateToken, validate(postCommentSchema), commentController.postComment);
+router.post("", authenticateToken, validate(postCommentSchema), commentController.postComment);
 
 // Protected: Delete a comment (RLS handles ownership)
