[Timeout] StringLiteral
routes/roadmapRoutes.ts:13:12
 const router = Router();
 
 // Public / User Routes
-router.get('/config', getRoadmapConfig);
+router.get("", getRoadmapConfig);
 router.get('/streak', getUserStreakStatus);
 router.post('/claim', authenticateToken, claimDailyReward);

[Timeout] StringLiteral
routes/roadmapRoutes.ts:14:12
 
 // Public / User Routes
 router.get('/config', getRoadmapConfig);
-router.get('/streak', getUserStreakStatus);
+router.get("", getUserStreakStatus);
 router.post('/claim', authenticateToken, claimDailyReward);
 
