[Timeout] StringLiteral
routes/ruleRoutes.ts:33:15
 // Protected Routes (Admin/Staff only)
 router.post('/', authenticateToken, checkRole(STAFF_ROLES), validate(ruleSchema), ruleController.createRule);
 router.put('/:id', authenticateToken, checkRole(STAFF_ROLES), validate(updateRuleSchema), ruleController.updateRule);
-router.delete('/:id', authenticateToken, checkRole(STAFF_ROLES), ruleController.deleteRule);
+router.delete("", authenticateToken, checkRole(STAFF_ROLES), ruleController.deleteRule);
 
 export default router;
