[Timeout] StringLiteral
routes/suggestionRoutes.ts:50:12
  *       200:
  *         description: Lista de sugerencias
  */
-router.get('/', suggestionController.getSuggestions);
+router.get("", suggestionController.getSuggestions);
 
 /**
