[Timeout] StringLiteral
routes/userRoutes.ts:31:12
  *       200:
  *         description: Lista de usuarios
  */
-router.get('/', authenticateToken, checkRole(ADMIN_ROLES), userController.getAllUsers);
+router.get("", authenticateToken, checkRole(ADMIN_ROLES), userController.getAllUsers);
 router.get('/staff', authenticateToken, checkRole(STAFF_ROLES), userController.getStaffUsers);
 

[Timeout] StringLiteral
routes/userRoutes.ts:32:12
  *         description: Lista de usuarios
  */
 router.get('/', authenticateToken, checkRole(ADMIN_ROLES), userController.getAllUsers);
-router.get('/staff', authenticateToken, checkRole(STAFF_ROLES), userController.getStaffUsers);
+router.get("", authenticateToken, checkRole(STAFF_ROLES), userController.getStaffUsers);
 
 /**

[Killed] StringLiteral
routes/userRoutes.ts:110:14
 // optionalAuthenticateToken: wallet data is only exposed to the owner or staff
 router.get('/profile/:username/full', optionalAuthenticateToken, validate(profileSchema), userController.getFullProfile);
 
-router.patch('/:id/role', authenticateToken, checkRole(ADMIN_ROLES), require2FA, validate(updateUserRoleSchema), userController.updateUserRole);
+router.patch("", authenticateToken, checkRole(ADMIN_ROLES), require2FA, validate(updateUserRoleSchema), userController.updateUserRole);
 router.patch('/:id/metadata', authenticateToken, checkRole(ADMIN_ROLES), require2FA, validate(updateUserMetadataSchema), userController.updateUserMetadata);
 router.post('/:id/karma', authenticateToken, validate(voteKarmaSchema), userController.giveKarma);
killedBy: A01 — Broken Access Control Admin route protection should reject unauthenticated role update
statusReason: expected 404 to be 401 // Object.is equality
