[Timeout] StringLiteral
routes/wikiRoutes.ts:57:12
  *       200:
  *         description: Lista de artículos
  */
-router.get('/', wikiController.getArticles);
+router.get("", wikiController.getArticles);
 
 /**

[Timeout] StringLiteral
routes/wikiRoutes.ts:86:13
  *     security:
  *       - bearerAuth: []
  */
-router.post('/', authenticateToken, checkRole(STAFF_ROLES), validate(createWikiArticleSchema), wikiController.createWikiArticle);
+router.post("", authenticateToken, checkRole(STAFF_ROLES), validate(createWikiArticleSchema), wikiController.createWikiArticle);
 
 /**
